{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 55074], "name": "inputs", "sparse": false}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Diagonal", "config": {"name": "h0", "dtype": "float32", "activation": "tanh", "trainable": true, "units": 18358, "batch_input_shape": [null, 55074], "use_bias": true}, "inbound_nodes": [[["inputs", 0, 0, {}]]], "name": "h0"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_0"}, "inbound_nodes": [[["h0", 0, 0, {"training": false}]]], "name": "dropout_0"}, {"class_name": "SparseTF", "config": {"W_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "h1", "bias_regularizer": null, "activation": "tanh", "trainable": true, "nonzero_ind": [[0, 142], [1, 142], [4, 2], [4, 3], [5, 150], [7, 15], [7, 351], [8, 305], [9, 305], [10, 74], [12, 178], [14, 98], [16, 146], [16, 169], [16, 241], [16, 248], [16, 271], [16, 272], [16, 300], [16, 309], [16, 310], [16, 331], [16, 335], [16, 348], [26, 272], [33, 154], [33, 176], [33, 177], [33, 178], [33, 223], [33, 302], [33, 345], [33, 346], [33, 347], [34, 154], [34, 176], [34, 177], [34, 178], [34, 223], [34, 302], [34, 345], [34, 346], [34, 347], [35, 58], [36, 126], [36, 127], [36, 128], [36, 163], [36, 164], [36, 233], [36, 260], [36, 268], [36, 272], [36, 274], [36, 345], [36, 346], [36, 347], [36, 348], [37, 126], [37, 127], [37, 128], [37, 163], [37, 164], [37, 233], [37, 260], [37, 268], [37, 272], [37, 274], [37, 345], [37, 346], [37, 347], [37, 348], [38, 126], [38, 127], [38, 128], [38, 163], [38, 164], [38, 233], [38, 260], [38, 268], [38, 272], [38, 274], [38, 345], [38, 346], [38, 347], [38, 348], [39, 154], [39, 176], [39, 177], [39, 194], [39, 223], [39, 302], [39, 345], [39, 346], [39, 347], [40, 151], [40, 154], [40, 176], [40, 177], [40, 184], [40, 194], [40, 223], [40, 302], [40, 309], [40, 313], [40, 329], [40, 345], [40, 346], [40, 347], [41, 154], [41, 176], [41, 177], [41, 194], [41, 223], [41, 302], [41, 309], [41, 329], [41, 345], [41, 346], [41, 347], [42, 154], [42, 176], [42, 177], [42, 178], [42, 194], [42, 204], [42, 205], [42, 223], [42, 288], [42, 289], [42, 302], [42, 345], [42, 346], [42, 347], [43, 113], [43, 151], [43, 154], [43, 176], [43, 177], [43, 194], [43, 223], [43, 280], [43, 284], [43, 286], [43, 288], [43, 302], [43, 305], [43, 313], [43, 314], [43, 345], [43, 346], [43, 347], [44, 154], [44, 176], [44, 177], [44, 178], [44, 194], [44, 223], [44, 293], [44, 302], [44, 309], [44, 329], [44, 345], [44, 346], [44, 347], [45, 154], [45, 176], [45, 177], [45, 223], [45, 302], [45, 345], [45, 346], [45, 347], [46, 126], [46, 138], [60, 138], [61, 169], [63, 41], [64, 41], [66, 48], [67, 47], [68, 48], [70, 48], [71, 47], [72, 48], [73, 183], [73, 223], [73, 296], [74, 132], [74, 156], [74, 310], [74, 328], [75, 151], [75, 154], [75, 176], [75, 177], [75, 178], [75, 223], [75, 233], [75, 300], [75, 302], [75, 309], [75, 313], [75, 329], [75, 345], [75, 346], [75, 347], [75, 351], [76, 126], [76, 235], [76, 239], [76, 321], [77, 125], [77, 178], [77, 186], [77, 195], [77, 204], [77, 223], [77, 292], [77, 303], [77, 306], [77, 341], [77, 349], [78, 125], [78, 151], [78, 178], [78, 183], [78, 186], [78, 194], [78, 204], [78, 223], [78, 286], [78, 287], [78, 289], [78, 294], [78, 296], [78, 310], [78, 328], [79, 223], [82, 126], [82, 128], [82, 157], [82, 172], [82, 173], [82, 209], [82, 211], [82, 214], [82, 235], [82, 239], [82, 276], [82, 279], [82, 321], [83, 113], [83, 149], [83, 150], [84, 262], [85, 262], [86, 262], [87, 262], [94, 65], [94, 152], [97, 24], [97, 152], [100, 127], [100, 128], [100, 163], [100, 164], [100, 225], [100, 232], [100, 233], [100, 239], [100, 253], [100, 254], [100, 256], [100, 258], [100, 259], [100, 260], [100, 261], [100, 262], [100, 264], [100, 266], [101, 127], [101, 128], [101, 163], [101, 164], [101, 225], [101, 232], [101, 233], [101, 239], [101, 253], [101, 254], [101, 256], [101, 258], [101, 259], [101, 260], [101, 261], [101, 262], [101, 264], [101, 266], [102, 127], [102, 128], [102, 163], [102, 164], [102, 225], [102, 232], [102, 233], [102, 239], [102, 253], [102, 254], [102, 256], [102, 258], [102, 259], [102, 260], [102, 261], [102, 262], [102, 264], [102, 266], [103, 127], [103, 128], [103, 163], [103, 164], [103, 225], [103, 232], [103, 233], [103, 239], [103, 253], [103, 254], [103, 256], [103, 258], [103, 259], [103, 260], [103, 261], [103, 262], [103, 264], [103, 266], [105, 58], [105, 126], [105, 136], [105, 137], [105, 171], [105, 172], [105, 202], [105, 296], [106, 58], [106, 126], [106, 136], [106, 137], [106, 171], [106, 172], [106, 202], [106, 296], [107, 0], [108, 140], [108, 228], [109, 140], [109, 228], [110, 140], [110, 228], [111, 140], [111, 228], [114, 31], [114, 64], [114, 65], [114, 216], [115, 128], [120, 182], [121, 117], [122, 138], [122, 243], [123, 145], [123, 147], [124, 145], [124, 147], [125, 145], [125, 147], [126, 145], [126, 147], [130, 183], [131, 15], [132, 183], [132, 308], [133, 183], [133, 308], [134, 305], [135, 100], [145, 127], [145, 128], [145, 154], [145, 155], [145, 157], [145, 164], [145, 173], [145, 185], [145, 203], [145, 206], [145, 207], [145, 208], [145, 214], [145, 217], [145, 225], [145, 230], [145, 232], [145, 236], [145, 238], [145, 239], [145, 240], [145, 241], [145, 245], [145, 248], [145, 255], [145, 271], [145, 273], [145, 275], [145, 276], [145, 279], [145, 296], [145, 298], [145, 300], [145, 302], [145, 303], [145, 304], [145, 311], [145, 315], [145, 322], [146, 305], [149, 178], [150, 178], [151, 178], [155, 170], [156, 170], [158, 219], [161, 305], [162, 305], [168, 21], [173, 224], [174, 224], [176, 134], [176, 136], [176, 138], [177, 310], [179, 121], [182, 33], [182, 53], [182, 54], [184, 178], [185, 219], [187, 100], [187, 270], [190, 232], [191, 232], [193, 142], [193, 284], [194, 121], [195, 151], [195, 178], [195, 185], [195, 194], [195, 197], [195, 198], [195, 205], [195, 251], [195, 289], [195, 293], [195, 296], [195, 301], [195, 303], [195, 305], [195, 306], [195, 337], [195, 338], [195, 339], [195, 340], [195, 341], [195, 342], [195, 343], [195, 349], [198, 147], [202, 206], [203, 206], [204, 126], [204, 128], [204, 138], [204, 181], [204, 217], [204, 269], [204, 275], [204, 276], [204, 277], [204, 279], [207, 124], [207, 132], [207, 195], [207, 197], [207, 198], [207, 199], [207, 288], [207, 336], [207, 344], [211, 122], [211, 124], [211, 125], [211, 128], [211, 131], [211, 136], [211, 166], [211, 170], [211, 171], [211, 176], [211, 179], [211, 186], [211, 195], [211, 200], [211, 201], [211, 202], [211, 204], [211, 223], [211, 273], [211, 288], [211, 300], [211, 307], [211, 309], [211, 317], [211, 319], [211, 335], [211, 348], [211, 349], [211, 351], [212, 122], [212, 124], [212, 125], [212, 128], [212, 131], [212, 136], [212, 166], [212, 170], [212, 171], [212, 176], [212, 179], [212, 195], [212, 200], [212, 201], [212, 223], [212, 288], [212, 300], [212, 307], [212, 309], [212, 317], [212, 319], [212, 335], [212, 349], [212, 351], [213, 122], [213, 124], [213, 125], [213, 128], [213, 131], [213, 136], [213, 151], [213, 154], [213, 166], [213, 170], [213, 171], [213, 173], [213, 176], [213, 179], [213, 180], [213, 186], [213, 188], [213, 195], [213, 200], [213, 201], [213, 202], [213, 204], [213, 211], [213, 223], [213, 246], [213, 247], [213, 260], [213, 270], [213, 273], [213, 274], [213, 280], [213, 282], [213, 283], [213, 284], [213, 285], [213, 288], [213, 300], [213, 304], [213, 306], [213, 307], [213, 309], [213, 311], [213, 313], [213, 316], [213, 317], [213, 318], [213, 319], [213, 335], [213, 348], [213, 349], [213, 350], [213, 351], [214, 176], [214, 179], [214, 204], [214, 223], [214, 280], [214, 284], [214, 294], [215, 210], [216, 210], [217, 210], [218, 210], [222, 310], [223, 241], [223, 248], [223, 310], [224, 142], [224, 344], [225, 302], [228, 302], [232, 168], [232, 309], [232, 324], [233, 128], [233, 168], [233, 170], [233, 309], [233, 313], [233, 324], [236, 162], [237, 162], [242, 47], [242, 49], [243, 43], [244, 43], [246, 124], [246, 125], [246, 126], [246, 127], [246, 128], [246, 135], [246, 140], [246, 162], [246, 164], [246, 165], [246, 172], [246, 192], [246, 207], [246, 209], [246, 211], [246, 217], [246, 219], [246, 221], [246, 222], [246, 224], [246, 226], [246, 230], [246, 235], [246, 236], [246, 238], [246, 239], [246, 258], [246, 259], [246, 268], [246, 269], [246, 274], [246, 276], [246, 279], [246, 286], [246, 296], [246, 300], [246, 304], [246, 307], [246, 309], [246, 321], [246, 350], [246, 351], [247, 124], [247, 125], [247, 126], [247, 127], [247, 128], [247, 135], [247, 140], [247, 162], [247, 164], [247, 165], [247, 172], [247, 192], [247, 207], [247, 209], [247, 211], [247, 217], [247, 219], [247, 221], [247, 222], [247, 224], [247, 226], [247, 230], [247, 235], [247, 236], [247, 238], [247, 239], [247, 258], [247, 259], [247, 268], [247, 269], [247, 274], [247, 276], [247, 279], [247, 286], [247, 296], [247, 300], [247, 304], [247, 307], [247, 309], [247, 321], [247, 350], [247, 351], [248, 150], [249, 124], [249, 125], [249, 126], [249, 127], [249, 128], [249, 135], [249, 140], [249, 162], [249, 164], [249, 165], [249, 172], [249, 192], [249, 207], [249, 209], [249, 211], [249, 217], [249, 219], [249, 221], [249, 222], [249, 224], [249, 226], [249, 230], [249, 235], [249, 236], [249, 238], [249, 239], [249, 258], [249, 259], [249, 268], [249, 269], [249, 274], [249, 276], [249, 279], [249, 286], [249, 296], [249, 300], [249, 304], [249, 307], [249, 309], [249, 321], [249, 350], [249, 351], [253, 186], [253, 189], [253, 191], [253, 285], [258, 213], [261, 126], [261, 138], [261, 259], [262, 10], [262, 296], [264, 186], [265, 266], [269, 186], [270, 186], [272, 148], [273, 311], [274, 148], [276, 178], [277, 156], [279, 124], [279, 137], [279, 170], [279, 192], [279, 193], [279, 195], [279, 204], [279, 211], [279, 234], [279, 245], [279, 282], [279, 283], [279, 305], [279, 313], [279, 316], [279, 318], [279, 327], [279, 336], [281, 138], [282, 138], [283, 138], [286, 99], [287, 99], [288, 99], [289, 99], [290, 99], [291, 99], [292, 99], [301, 134], [301, 139], [301, 140], [301, 141], [301, 154], [301, 162], [301, 228], [301, 248], [301, 297], [301, 298], [301, 299], [301, 302], [301, 303], [301, 306], [301, 309], [301, 311], [301, 322], [301, 329], [301, 333], [305, 151], [305, 178], [305, 185], [305, 194], [305, 197], [305, 198], [305, 205], [305, 251], [305, 289], [305, 293], [305, 296], [305, 301], [305, 303], [305, 305], [305, 306], [305, 337], [305, 338], [305, 339], [305, 340], [305, 341], [305, 342], [305, 343], [305, 349], [311, 151], [311, 296], [318, 125], [318, 137], [318, 138], [318, 154], [318, 223], [318, 283], [318, 309], [323, 137], [323, 138], [323, 154], [323, 309], [324, 147], [324, 155], [324, 157], [324, 234], [324, 235], [324, 250], [324, 279], [325, 279], [327, 125], [327, 137], [327, 154], [327, 223], [327, 283], [327, 309], [328, 283], [329, 283], [330, 283], [331, 283], [332, 283], [333, 283], [334, 283], [335, 283], [337, 125], [337, 150], [337, 170], [337, 174], [337, 180], [337, 302], [338, 150], [338, 161], [339, 99], [339, 308], [340, 150], [340, 161], [341, 109], [341, 150], [341, 161], [342, 150], [342, 161], [344, 219], [345, 219], [346, 219], [347, 18], [348, 18], [349, 219], [354, 310], [355, 310], [356, 104], [356, 127], [357, 40], [357, 42], [359, 40], [359, 42], [368, 138], [369, 138], [371, 116], [372, 138], [374, 262], [377, 202], [377, 283], [379, 229], [379, 295], [388, 53], [391, 40], [392, 40], [393, 40], [394, 59], [395, 53], [395, 54], [396, 53], [396, 54], [397, 53], [397, 160], [398, 53], [398, 54], [402, 229], [402, 295], [404, 146], [406, 67], [406, 74], [414, 133], [414, 334], [415, 348], [416, 348], [417, 10], [418, 348], [419, 187], [420, 67], [420, 74], [421, 108], [421, 148], [421, 151], [421, 281], [422, 108], [422, 148], [422, 151], [422, 281], [423, 67], [423, 74], [424, 55], [424, 132], [424, 171], [424, 192], [424, 196], [424, 203], [424, 212], [424, 215], [424, 227], [424, 235], [424, 237], [424, 268], [424, 274], [424, 289], [424, 300], [424, 302], [424, 304], [424, 309], [424, 312], [424, 314], [424, 329], [425, 55], [425, 184], [425, 215], [425, 237], [426, 314], [432, 283], [433, 310], [434, 268], [434, 269], [435, 268], [435, 269], [436, 268], [436, 269], [437, 268], [437, 269], [439, 160], [439, 268], [439, 269], [445, 267], [447, 122], [447, 148], [447, 156], [447, 246], [447, 268], [447, 269], [447, 270], [447, 273], [447, 274], [447, 310], [447, 350], [448, 147], [448, 153], [448, 154], [448, 314], [451, 129], [451, 169], [451, 170], [451, 174], [452, 129], [452, 169], [452, 174], [452, 227], [453, 129], [453, 169], [453, 174], [454, 129], [454, 169], [454, 174], [454, 182], [454, 233], [454, 309], [454, 324], [454, 351], [455, 129], [456, 129], [456, 169], [456, 174], [456, 309], [456, 324], [469, 124], [469, 174], [469, 175], [469, 309], [469, 314], [469, 326], [469, 330], [471, 175], [472, 124], [472, 125], [472, 162], [472, 204], [472, 309], [472, 330], [473, 175], [475, 174], [475, 175], [481, 302], [481, 311], [485, 166], [488, 149], [488, 267], [489, 149], [489, 267], [497, 252], [498, 51], [498, 135], [498, 151], [498, 223], [502, 177], [502, 345], [502, 346], [502, 347], [502, 349], [505, 79], [506, 24], [506, 208], [507, 116], [514, 83], [514, 151], [514, 186], [514, 310], [514, 328], [515, 129], [515, 193], [516, 137], [516, 138], [516, 165], [516, 255], [517, 4], [517, 44], [521, 178], [523, 208], [525, 309], [525, 329], [526, 219], [527, 219], [529, 80], [530, 136], [530, 137], [530, 184], [530, 192], [530, 195], [530, 201], [530, 296], [530, 337], [531, 102], [532, 102], [533, 102], [534, 102], [535, 13], [535, 38], [536, 13], [536, 322], [537, 13], [540, 162], [541, 162], [542, 149], [544, 149], [545, 149], [549, 285], [551, 0], [551, 9], [551, 27], [551, 62], [551, 75], [551, 81], [551, 82], [551, 250], [552, 0], [552, 9], [552, 27], [552, 62], [552, 75], [552, 81], [552, 82], [552, 250], [553, 0], [553, 9], [553, 27], [553, 62], [553, 75], [553, 81], [553, 82], [553, 250], [554, 0], [554, 9], [554, 27], [554, 62], [554, 75], [554, 81], [554, 82], [554, 250], [558, 107], [559, 107], [560, 107], [560, 268], [560, 269], [560, 270], [560, 271], [560, 272], [560, 273], [560, 274], [561, 107], [561, 268], [561, 269], [561, 270], [561, 271], [561, 272], [561, 273], [561, 274], [562, 107], [562, 268], [562, 269], [562, 270], [562, 271], [562, 272], [562, 273], [562, 274], [563, 107], [563, 268], [563, 269], [563, 270], [563, 271], [563, 272], [563, 273], [563, 274], [564, 107], [564, 268], [564, 269], [564, 270], [564, 271], [564, 272], [564, 273], [564, 274], [565, 107], [565, 268], [565, 269], [565, 270], [565, 271], [565, 272], [565, 273], [565, 274], [566, 107], [566, 268], [566, 269], [566, 270], [566, 271], [566, 272], [566, 273], [566, 274], [571, 121], [572, 121], [576, 150], [581, 62], [584, 150], [602, 314], [603, 77], [603, 152], [604, 124], [604, 125], [604, 128], [604, 138], [604, 207], [604, 209], [604, 213], [604, 217], [604, 268], [604, 270], [604, 271], [604, 272], [604, 273], [604, 274], [604, 275], [604, 276], [604, 278], [604, 279], [604, 340], [605, 126], [605, 128], [605, 138], [605, 207], [605, 209], [605, 213], [605, 268], [605, 270], [605, 272], [605, 273], [605, 274], [605, 275], [605, 276], [605, 278], [605, 279], [606, 124], [606, 125], [606, 126], [606, 128], [606, 138], [606, 207], [606, 209], [606, 213], [606, 217], [606, 268], [606, 270], [606, 272], [606, 273], [606, 274], [606, 275], [606, 276], [606, 278], [606, 279], [606, 340], [608, 126], [608, 128], [608, 138], [608, 207], [608, 209], [608, 213], [608, 268], [608, 270], [608, 272], [608, 273], [608, 274], [608, 275], [608, 276], [608, 278], [608, 279], [610, 97], [610, 151], [610, 185], [610, 300], [610, 305], [610, 306], [610, 307], [610, 344], [611, 129], [611, 130], [611, 182], [611, 193], [611, 198], [611, 304], [611, 308], [611, 309], [611, 311], [617, 265], [618, 220], [619, 220], [620, 220], [621, 220], [622, 21], [622, 71], [623, 21], [623, 71], [624, 220], [628, 106], [629, 75], [630, 34], [630, 80], [637, 148], [637, 154], [637, 196], [637, 229], [637, 232], [637, 285], [637, 309], [637, 315], [637, 322], [637, 350], [637, 351], [640, 183], [642, 233], [643, 233], [644, 233], [648, 141], [656, 210], [656, 214], [657, 210], [657, 215], [657, 217], [657, 269], [657, 275], [657, 276], [657, 279], [658, 210], [658, 215], [658, 217], [658, 269], [658, 275], [658, 276], [658, 279], [660, 124], [660, 309], [660, 319], [664, 305], [669, 100], [671, 9], [671, 24], [671, 29], [671, 62], [671, 63], [671, 65], [671, 77], [671, 263], [672, 9], [672, 24], [672, 29], [672, 62], [672, 63], [672, 65], [672, 77], [672, 263], [675, 304], [676, 174], [676, 175], [684, 219], [685, 129], [685, 130], [685, 150], [685, 154], [685, 193], [685, 194], [685, 197], [685, 198], [685, 299], [685, 303], [685, 309], [686, 129], [686, 130], [686, 150], [686, 154], [686, 193], [686, 197], [686, 198], [686, 299], [686, 303], [686, 309], [686, 310], [687, 150], [688, 126], [689, 126], [689, 260], [690, 129], [690, 130], [690, 150], [690, 154], [690, 193], [690, 197], [690, 198], [690, 299], [690, 303], [690, 309], [690, 339], [690, 344], [692, 149], [693, 210], [693, 212], [693, 213], [693, 278], [694, 210], [694, 212], [694, 213], [694, 278], [704, 142], [704, 150], [704, 203], [704, 246], [705, 109], [705, 150], [705, 161], [706, 109], [706, 150], [706, 161], [707, 150], [707, 161], [708, 21], [714, 261], [720, 310], [723, 134], [723, 139], [723, 154], [723, 162], [723, 302], [723, 311], [724, 305], [726, 305], [727, 305], [731, 13], [740, 122], [740, 126], [740, 127], [740, 140], [740, 162], [740, 166], [740, 170], [740, 171], [740, 173], [740, 192], [740, 195], [740, 197], [740, 198], [740, 199], [740, 200], [740, 209], [740, 213], [740, 217], [740, 235], [740, 236], [740, 238], [740, 268], [740, 270], [740, 273], [740, 274], [740, 276], [740, 296], [740, 300], [740, 303], [740, 304], [740, 307], [740, 336], [740, 350], [741, 122], [741, 126], [741, 127], [741, 140], [741, 162], [741, 166], [741, 170], [741, 171], [741, 173], [741, 192], [741, 195], [741, 197], [741, 198], [741, 199], [741, 200], [741, 209], [741, 213], [741, 217], [741, 235], [741, 236], [741, 238], [741, 268], [741, 270], [741, 273], [741, 274], [741, 276], [741, 296], [741, 300], [741, 303], [741, 304], [741, 307], [741, 336], [741, 350], [742, 122], [742, 126], [742, 127], [742, 140], [742, 162], [742, 166], [742, 170], [742, 171], [742, 173], [742, 192], [742, 195], [742, 197], [742, 198], [742, 199], [742, 200], [742, 209], [742, 213], [742, 217], [742, 235], [742, 236], [742, 238], [742, 268], [742, 270], [742, 273], [742, 274], [742, 276], [742, 296], [742, 300], [742, 303], [742, 304], [742, 307], [742, 336], [742, 350], [744, 129], [744, 182], [744, 193], [744, 203], [748, 59], [749, 59], [750, 40], [751, 48], [752, 48], [752, 59], [753, 40], [753, 59], [755, 99], [755, 308], [757, 127], [757, 138], [758, 127], [758, 138], [759, 127], [759, 138], [762, 149], [762, 156], [766, 166], [767, 166], [768, 151], [768, 178], [768, 185], [768, 194], [768, 197], [768, 198], [768, 205], [768, 251], [768, 289], [768, 293], [768, 296], [768, 301], [768, 303], [768, 305], [768, 306], [768, 337], [768, 338], [768, 339], [768, 340], [768, 341], [768, 342], [768, 343], [768, 349], [770, 151], [770, 178], [770, 185], [770, 194], [770, 197], [770, 198], [770, 205], [770, 251], [770, 289], [770, 293], [770, 296], [770, 301], [770, 303], [770, 305], [770, 306], [770, 337], [770, 338], [770, 339], [770, 340], [770, 341], [770, 342], [770, 343], [770, 349], [780, 210], [787, 221], [797, 306], [798, 169], [802, 128], [802, 138], [802, 235], [808, 155], [820, 58], [821, 58], [821, 136], [821, 149], [821, 161], [822, 58], [823, 58], [823, 136], [824, 119], [824, 121], [825, 16], [825, 248], [825, 277], [834, 102], [835, 106], [836, 129], [836, 130], [836, 133], [836, 154], [836, 193], [836, 194], [836, 198], [836, 246], [836, 300], [836, 308], [836, 309], [837, 0], [837, 102], [837, 133], [838, 0], [838, 102], [838, 133], [839, 0], [839, 102], [839, 133], [840, 0], [840, 102], [840, 133], [841, 102], [843, 183], [847, 123], [847, 131], [847, 154], [847, 170], [847, 171], [847, 176], [847, 204], [847, 223], [847, 280], [847, 284], [847, 288], [847, 294], [847, 300], [847, 302], [847, 307], [847, 309], [847, 310], [847, 313], [847, 316], [847, 329], [847, 350], [847, 351], [850, 134], [850, 147], [850, 153], [850, 154], [850, 155], [850, 157], [850, 158], [850, 172], [850, 180], [850, 206], [850, 208], [850, 224], [850, 234], [850, 235], [850, 236], [850, 245], [850, 246], [850, 250], [850, 345], [850, 351], [851, 134], [851, 147], [851, 153], [851, 154], [851, 155], [851, 157], [851, 158], [851, 172], [851, 180], [851, 206], [851, 208], [851, 224], [851, 234], [851, 235], [851, 236], [851, 245], [851, 246], [851, 250], [851, 345], [851, 351], [853, 154], [853, 156], [853, 193], [853, 314], [854, 115], [854, 179], [854, 224], [857, 25], [857, 36], [858, 129], [858, 130], [858, 339], [859, 145], [859, 147], [859, 189], [859, 284], [860, 147], [863, 129], [863, 196], [863, 250], [864, 77], [867, 77], [868, 106], [872, 305], [873, 305], [874, 305], [878, 142], [878, 148], [878, 269], [878, 274], [889, 314], [889, 315], [892, 127], [892, 128], [892, 219], [892, 221], [894, 128], [895, 125], [895, 150], [895, 170], [895, 174], [895, 180], [895, 302], [896, 125], [896, 150], [896, 170], [896, 174], [896, 180], [896, 302], [897, 53], [897, 54], [897, 55], [897, 56], [897, 57], [897, 124], [897, 165], [897, 202], [897, 222], [898, 54], [899, 53], [899, 54], [899, 55], [899, 56], [899, 57], [899, 124], [899, 165], [899, 260], [899, 263], [900, 53], [900, 54], [900, 55], [900, 56], [900, 57], [900, 124], [900, 165], [900, 260], [900, 263], [906, 152], [908, 219], [909, 219], [910, 219], [914, 109], [927, 122], [927, 156], [927, 269], [927, 270], [927, 274], [927, 305], [928, 16], [928, 18], [928, 70], [929, 16], [929, 18], [929, 70], [931, 16], [931, 18], [931, 70], [940, 109], [941, 109], [944, 170], [945, 138], [946, 170], [947, 170], [948, 109], [951, 125], [951, 126], [951, 127], [951, 131], [951, 136], [951, 164], [951, 165], [951, 172], [951, 181], [951, 184], [951, 207], [951, 209], [951, 212], [951, 213], [951, 214], [951, 215], [951, 217], [951, 218], [951, 222], [951, 225], [951, 226], [951, 230], [951, 232], [951, 235], [951, 236], [951, 238], [951, 239], [951, 241], [951, 243], [951, 248], [951, 254], [951, 258], [951, 259], [951, 260], [951, 268], [951, 271], [951, 272], [951, 274], [951, 288], [951, 290], [951, 291], [951, 294], [951, 300], [951, 307], [951, 309], [952, 125], [952, 126], [952, 128], [952, 137], [952, 164], [952, 165], [952, 181], [952, 184], [952, 207], [952, 208], [952, 213], [952, 215], [952, 217], [952, 218], [952, 222], [952, 225], [952, 226], [952, 227], [952, 230], [952, 232], [952, 235], [952, 236], [952, 237], [952, 238], [952, 239], [952, 240], [952, 241], [952, 248], [952, 254], [952, 255], [952, 258], [952, 259], [952, 260], [952, 264], [952, 269], [952, 275], [952, 276], [952, 277], [952, 279], [952, 281], [952, 290], [952, 294], [952, 300], [952, 302], [952, 309], [952, 315], [952, 347], [957, 218], [959, 126], [959, 217], [959, 219], [959, 269], [959, 290], [959, 294], [963, 99], [963, 308], [964, 310], [965, 169], [976, 70], [977, 70], [978, 70], [979, 55], [979, 215], [982, 71], [986, 64], [987, 0], [987, 62], [987, 63], [987, 64], [988, 0], [988, 62], [988, 63], [988, 64], [989, 211], [990, 285], [991, 285], [993, 305], [994, 142], [1000, 36], [1000, 81], [1000, 82], [1000, 83], [1000, 309], [1000, 312], [1000, 315], [1000, 316], [1000, 332], [1000, 351], [1002, 153], [1002, 166], [1002, 174], [1002, 182], [1002, 230], [1002, 248], [1002, 268], [1002, 274], [1002, 302], [1002, 309], [1002, 313], [1002, 314], [1002, 324], [1002, 331], [1002, 332], [1002, 333], [1003, 153], [1003, 166], [1003, 174], [1003, 182], [1003, 230], [1003, 248], [1003, 268], [1003, 274], [1003, 302], [1003, 309], [1003, 313], [1003, 324], [1003, 331], [1003, 332], [1003, 333], [1004, 153], [1004, 166], [1004, 174], [1004, 182], [1004, 230], [1004, 248], [1004, 268], [1004, 274], [1004, 302], [1004, 309], [1004, 313], [1004, 315], [1004, 324], [1004, 331], [1004, 332], [1004, 333], [1006, 63], [1006, 152], [1007, 153], [1007, 166], [1007, 174], [1007, 182], [1007, 230], [1007, 248], [1007, 268], [1007, 274], [1007, 302], [1007, 309], [1007, 313], [1007, 324], [1007, 331], [1007, 332], [1007, 333], [1009, 153], [1009, 166], [1009, 170], [1009, 174], [1009, 182], [1009, 230], [1009, 233], [1009, 248], [1009, 268], [1009, 274], [1009, 302], [1009, 309], [1009, 313], [1009, 324], [1009, 331], [1009, 332], [1009, 333], [1012, 52], [1018, 305], [1024, 219], [1025, 105], [1025, 116], [1025, 117], [1025, 118], [1025, 139], [1025, 180], [1025, 298], [1026, 335], [1027, 335], [1028, 335], [1029, 335], [1030, 335], [1033, 101], [1034, 101], [1037, 39], [1041, 102], [1044, 106], [1045, 183], [1045, 286], [1045, 308], [1045, 340], [1046, 151], [1046, 183], [1046, 286], [1046, 308], [1046, 340], [1047, 12], [1048, 12], [1049, 12], [1050, 12], [1052, 80], [1053, 291], [1053, 292], [1056, 159], [1058, 168], [1058, 170], [1062, 314], [1063, 314], [1065, 8], [1065, 149], [1066, 8], [1066, 149], [1067, 51], [1067, 135], [1068, 51], [1068, 135], [1081, 142], [1081, 307], [1083, 148], [1085, 252], [1092, 148], [1095, 76], [1095, 266], [1096, 138], [1103, 219], [1110, 14], [1110, 163], [1110, 208], [1110, 246], [1110, 268], [1110, 269], [1110, 270], [1110, 271], [1110, 273], [1110, 274], [1110, 316], [1110, 348], [1111, 150], [1111, 180], [1111, 202], [1111, 223], [1111, 280], [1111, 283], [1111, 284], [1111, 285], [1111, 288], [1112, 150], [1112, 180], [1112, 202], [1112, 223], [1112, 280], [1112, 283], [1112, 284], [1112, 285], [1112, 288], [1114, 138], [1114, 226], [1118, 125], [1118, 138], [1118, 208], [1118, 212], [1120, 138], [1121, 98], [1125, 178], [1125, 199], [1125, 205], [1125, 344], [1130, 46], [1130, 149], [1131, 219], [1132, 138], [1132, 226], [1132, 243], [1133, 138], [1133, 226], [1133, 243], [1134, 99], [1134, 308], [1135, 268], [1135, 282], [1139, 167], [1139, 268], [1139, 282], [1139, 308], [1143, 62], [1145, 153], [1145, 166], [1145, 174], [1145, 182], [1145, 230], [1145, 248], [1145, 268], [1145, 274], [1145, 302], [1145, 309], [1145, 313], [1145, 324], [1145, 331], [1145, 332], [1145, 333], [1146, 153], [1146, 166], [1146, 174], [1146, 182], [1146, 230], [1146, 248], [1146, 268], [1146, 274], [1146, 302], [1146, 309], [1146, 313], [1146, 324], [1146, 331], [1146, 332], [1146, 333], [1149, 106], [1149, 284], [1151, 213], [1152, 213], [1153, 213], [1157, 267], [1164, 162], [1165, 162], [1166, 162], [1167, 162], [1174, 210], [1181, 262], [1184, 115], [1184, 267], [1186, 166], [1187, 166], [1188, 166], [1189, 139], [1190, 123], [1190, 133], [1190, 134], [1190, 139], [1190, 154], [1190, 247], [1190, 248], [1190, 299], [1190, 302], [1190, 306], [1190, 309], [1190, 310], [1190, 311], [1190, 314], [1190, 322], [1190, 327], [1190, 329], [1190, 333], [1191, 123], [1191, 133], [1191, 134], [1191, 139], [1191, 141], [1191, 154], [1191, 162], [1191, 193], [1191, 235], [1191, 248], [1191, 297], [1191, 298], [1191, 300], [1191, 302], [1191, 303], [1191, 304], [1191, 306], [1191, 309], [1191, 310], [1191, 311], [1191, 313], [1191, 314], [1191, 317], [1191, 318], [1191, 319], [1191, 320], [1191, 321], [1191, 322], [1191, 323], [1191, 324], [1191, 325], [1191, 326], [1191, 327], [1191, 329], [1191, 330], [1191, 331], [1191, 332], [1191, 333], [1198, 129], [1198, 130], [1198, 154], [1198, 192], [1198, 193], [1198, 197], [1198, 198], [1198, 199], [1198, 205], [1198, 251], [1198, 288], [1198, 290], [1198, 299], [1198, 303], [1198, 308], [1198, 309], [1198, 338], [1198, 339], [1198, 342], [1198, 343], [1216, 144], [1219, 167], [1223, 167], [1224, 142], [1225, 98], [1226, 154], [1227, 196], [1228, 196], [1232, 219], [1233, 219], [1235, 219], [1242, 132], [1242, 142], [1242, 156], [1242, 159], [1242, 161], [1242, 174], [1242, 176], [1242, 189], [1242, 203], [1242, 285], [1242, 293], [1242, 305], [1242, 309], [1242, 310], [1242, 329], [1243, 248], [1243, 315], [1244, 138], [1244, 172], [1247, 2], [1248, 11], [1248, 115], [1249, 149], [1251, 139], [1251, 155], [1251, 162], [1251, 228], [1251, 298], [1251, 302], [1251, 303], [1251, 306], [1251, 309], [1251, 310], [1251, 311], [1251, 328], [1252, 223], [1253, 139], [1253, 155], [1253, 162], [1253, 228], [1253, 298], [1253, 302], [1253, 303], [1253, 306], [1253, 309], [1253, 310], [1253, 311], [1253, 328], [1254, 151], [1254, 255], [1254, 285], [1255, 150], [1256, 151], [1256, 255], [1256, 285], [1257, 220], [1273, 38], [1273, 41], [1273, 148], [1275, 153], [1275, 166], [1275, 174], [1275, 182], [1275, 230], [1275, 248], [1275, 268], [1275, 274], [1275, 302], [1275, 309], [1275, 313], [1275, 324], [1275, 331], [1275, 332], [1275, 333], [1276, 153], [1276, 166], [1276, 174], [1276, 182], [1276, 230], [1276, 248], [1276, 268], [1276, 274], [1276, 302], [1276, 309], [1276, 313], [1276, 324], [1276, 331], [1276, 332], [1276, 333], [1277, 124], [1277, 131], [1277, 154], [1277, 172], [1277, 207], [1277, 212], [1277, 213], [1277, 214], [1277, 215], [1277, 216], [1277, 217], [1277, 240], [1277, 277], [1277, 279], [1277, 300], [1277, 304], [1277, 307], [1277, 309], [1278, 124], [1278, 131], [1278, 154], [1278, 172], [1278, 207], [1278, 212], [1278, 213], [1278, 214], [1278, 215], [1278, 216], [1278, 217], [1278, 240], [1278, 277], [1278, 279], [1278, 300], [1278, 304], [1278, 307], [1278, 309], [1279, 122], [1279, 124], [1279, 131], [1279, 154], [1279, 172], [1279, 207], [1279, 212], [1279, 213], [1279, 214], [1279, 215], [1279, 216], [1279, 217], [1279, 223], [1279, 240], [1279, 277], [1279, 279], [1279, 300], [1279, 304], [1279, 307], [1279, 309], [1280, 124], [1280, 131], [1280, 154], [1280, 172], [1280, 207], [1280, 212], [1280, 213], [1280, 214], [1280, 215], [1280, 216], [1280, 217], [1280, 219], [1280, 220], [1280, 240], [1280, 277], [1280, 279], [1280, 300], [1280, 304], [1280, 307], [1280, 309], [1285, 148], [1285, 283], [1286, 148], [1286, 283], [1287, 148], [1287, 283], [1288, 148], [1288, 283], [1289, 219], [1290, 138], [1296, 305], [1301, 154], [1301, 176], [1301, 177], [1301, 293], [1301, 294], [1301, 302], [1301, 309], [1301, 329], [1302, 154], [1302, 176], [1302, 177], [1302, 293], [1302, 294], [1302, 302], [1302, 309], [1302, 329], [1303, 154], [1303, 176], [1303, 177], [1303, 293], [1303, 294], [1303, 302], [1303, 309], [1303, 329], [1304, 126], [1304, 138], [1305, 154], [1305, 176], [1305, 177], [1305, 293], [1305, 294], [1305, 302], [1305, 309], [1305, 329], [1306, 126], [1306, 138], [1310, 166], [1312, 102], [1319, 168], [1319, 170], [1319, 309], [1319, 313], [1319, 324], [1319, 333], [1322, 151], [1322, 255], [1322, 285], [1325, 125], [1325, 154], [1325, 176], [1325, 177], [1325, 184], [1325, 186], [1325, 194], [1325, 223], [1325, 302], [1325, 309], [1325, 329], [1325, 345], [1325, 346], [1325, 347], [1325, 351], [1329, 219], [1330, 219], [1332, 219], [1334, 16], [1342, 36], [1342, 55], [1342, 81], [1342, 82], [1342, 312], [1343, 305], [1345, 305], [1350, 70], [1350, 152], [1351, 167], [1351, 197], [1351, 309], [1351, 315], [1351, 331], [1353, 167], [1353, 197], [1353, 309], [1353, 315], [1353, 331], [1354, 16], [1354, 102], [1359, 152], [1360, 144], [1362, 144], [1362, 210], [1363, 144], [1363, 210], [1364, 144], [1365, 144], [1365, 255], [1366, 144], [1366, 151], [1367, 144], [1368, 99], [1368, 308], [1371, 183], [1374, 183], [1380, 178], [1383, 126], [1384, 183], [1385, 126], [1385, 163], [1386, 178], [1390, 24], [1391, 149], [1400, 189], [1401, 190], [1402, 223], [1404, 283], [1404, 285], [1412, 229], [1412, 295], [1414, 229], [1414, 295], [1415, 229], [1415, 295], [1416, 229], [1416, 295], [1417, 229], [1417, 295], [1418, 229], [1418, 295], [1419, 229], [1419, 295], [1420, 129], [1420, 193], [1420, 198], [1420, 339], [1421, 129], [1421, 130], [1421, 193], [1422, 129], [1422, 193], [1422, 198], [1422, 339], [1423, 129], [1423, 196], [1424, 129], [1424, 130], [1424, 193], [1425, 129], [1425, 193], [1425, 198], [1426, 129], [1426, 193], [1430, 337], [1433, 119], [1433, 121], [1433, 142], [1433, 154], [1433, 314], [1433, 331], [1434, 119], [1434, 121], [1434, 309], [1434, 319], [1434, 331], [1435, 183], [1435, 250], [1435, 286], [1435, 308], [1435, 340], [1436, 264], [1438, 16], [1438, 125], [1438, 126], [1438, 127], [1438, 128], [1438, 131], [1438, 137], [1438, 140], [1438, 157], [1438, 158], [1438, 164], [1438, 165], [1438, 172], [1438, 181], [1438, 184], [1438, 207], [1438, 208], [1438, 212], [1438, 213], [1438, 214], [1438, 216], [1438, 220], [1438, 222], [1438, 225], [1438, 226], [1438, 227], [1438, 228], [1438, 230], [1438, 232], [1438, 235], [1438, 237], [1438, 239], [1438, 240], [1438, 241], [1438, 248], [1438, 258], [1438, 259], [1438, 260], [1438, 264], [1438, 277], [1438, 300], [1438, 303], [1438, 309], [1438, 315], [1438, 347], [1439, 16], [1439, 125], [1439, 127], [1439, 128], [1439, 131], [1439, 137], [1439, 140], [1439, 157], [1439, 158], [1439, 164], [1439, 165], [1439, 172], [1439, 181], [1439, 184], [1439, 207], [1439, 208], [1439, 212], [1439, 213], [1439, 214], [1439, 215], [1439, 216], [1439, 217], [1439, 222], [1439, 225], [1439, 226], [1439, 227], [1439, 228], [1439, 230], [1439, 232], [1439, 235], [1439, 237], [1439, 238], [1439, 239], [1439, 240], [1439, 241], [1439, 248], [1439, 258], [1439, 259], [1439, 260], [1439, 264], [1439, 269], [1439, 275], [1439, 276], [1439, 277], [1439, 279], [1439, 300], [1439, 303], [1439, 309], [1439, 315], [1439, 347], [1440, 16], [1440, 125], [1440, 127], [1440, 128], [1440, 131], [1440, 137], [1440, 140], [1440, 157], [1440, 158], [1440, 164], [1440, 165], [1440, 172], [1440, 181], [1440, 184], [1440, 207], [1440, 208], [1440, 212], [1440, 213], [1440, 214], [1440, 216], [1440, 220], [1440, 222], [1440, 225], [1440, 226], [1440, 227], [1440, 228], [1440, 230], [1440, 232], [1440, 235], [1440, 237], [1440, 238], [1440, 239], [1440, 240], [1440, 241], [1440, 248], [1440, 254], [1440, 255], [1440, 258], [1440, 259], [1440, 260], [1440, 264], [1440, 277], [1440, 300], [1440, 303], [1440, 309], [1440, 315], [1440, 347], [1441, 16], [1441, 125], [1441, 126], [1441, 127], [1441, 128], [1441, 131], [1441, 137], [1441, 140], [1441, 157], [1441, 158], [1441, 164], [1441, 165], [1441, 172], [1441, 181], [1441, 184], [1441, 207], [1441, 208], [1441, 212], [1441, 213], [1441, 214], [1441, 216], [1441, 222], [1441, 225], [1441, 226], [1441, 227], [1441, 228], [1441, 230], [1441, 232], [1441, 235], [1441, 237], [1441, 239], [1441, 240], [1441, 241], [1441, 248], [1441, 258], [1441, 259], [1441, 260], [1441, 264], [1441, 277], [1441, 300], [1441, 303], [1441, 309], [1441, 315], [1441, 347], [1442, 16], [1442, 125], [1442, 126], [1442, 127], [1442, 128], [1442, 131], [1442, 137], [1442, 140], [1442, 157], [1442, 158], [1442, 164], [1442, 165], [1442, 172], [1442, 181], [1442, 184], [1442, 207], [1442, 208], [1442, 209], [1442, 212], [1442, 213], [1442, 214], [1442, 216], [1442, 222], [1442, 225], [1442, 226], [1442, 227], [1442, 228], [1442, 230], [1442, 232], [1442, 235], [1442, 237], [1442, 239], [1442, 240], [1442, 241], [1442, 248], [1442, 258], [1442, 259], [1442, 260], [1442, 264], [1442, 277], [1442, 290], [1442, 294], [1442, 300], [1442, 303], [1442, 309], [1442, 315], [1442, 347], [1443, 16], [1443, 125], [1443, 126], [1443, 127], [1443, 128], [1443, 131], [1443, 137], [1443, 140], [1443, 157], [1443, 158], [1443, 164], [1443, 165], [1443, 172], [1443, 181], [1443, 184], [1443, 207], [1443, 208], [1443, 212], [1443, 213], [1443, 214], [1443, 216], [1443, 222], [1443, 225], [1443, 226], [1443, 227], [1443, 228], [1443, 230], [1443, 232], [1443, 235], [1443, 236], [1443, 237], [1443, 239], [1443, 240], [1443, 241], [1443, 248], [1443, 258], [1443, 259], [1443, 260], [1443, 264], [1443, 277], [1443, 300], [1443, 303], [1443, 309], [1443, 315], [1443, 347], [1444, 16], [1444, 125], [1444, 126], [1444, 127], [1444, 128], [1444, 131], [1444, 137], [1444, 140], [1444, 157], [1444, 158], [1444, 164], [1444, 165], [1444, 172], [1444, 181], [1444, 184], [1444, 207], [1444, 208], [1444, 212], [1444, 213], [1444, 214], [1444, 216], [1444, 219], [1444, 222], [1444, 225], [1444, 226], [1444, 227], [1444, 228], [1444, 230], [1444, 232], [1444, 235], [1444, 237], [1444, 239], [1444, 240], [1444, 241], [1444, 248], [1444, 255], [1444, 258], [1444, 259], [1444, 260], [1444, 264], [1444, 277], [1444, 281], [1444, 300], [1444, 303], [1444, 309], [1444, 315], [1444, 347], [1449, 16], [1449, 125], [1449, 126], [1449, 127], [1449, 128], [1449, 131], [1449, 137], [1449, 140], [1449, 157], [1449, 158], [1449, 164], [1449, 165], [1449, 172], [1449, 181], [1449, 184], [1449, 207], [1449, 208], [1449, 209], [1449, 212], [1449, 213], [1449, 214], [1449, 216], [1449, 220], [1449, 222], [1449, 225], [1449, 226], [1449, 227], [1449, 228], [1449, 230], [1449, 232], [1449, 235], [1449, 237], [1449, 239], [1449, 240], [1449, 241], [1449, 248], [1449, 258], [1449, 259], [1449, 260], [1449, 264], [1449, 277], [1449, 300], [1449, 303], [1449, 309], [1449, 315], [1449, 347], [1450, 16], [1450, 125], [1450, 126], [1450, 127], [1450, 128], [1450, 131], [1450, 137], [1450, 140], [1450, 157], [1450, 158], [1450, 164], [1450, 165], [1450, 172], [1450, 181], [1450, 184], [1450, 207], [1450, 208], [1450, 212], [1450, 213], [1450, 214], [1450, 216], [1450, 222], [1450, 225], [1450, 226], [1450, 227], [1450, 228], [1450, 230], [1450, 232], [1450, 235], [1450, 237], [1450, 239], [1450, 240], [1450, 241], [1450, 248], [1450, 254], [1450, 255], [1450, 258], [1450, 259], [1450, 260], [1450, 264], [1450, 277], [1450, 281], [1450, 300], [1450, 303], [1450, 309], [1450, 315], [1450, 347], [1451, 314], [1452, 228], [1455, 264], [1455, 335], [1460, 116], [1462, 119], [1463, 119], [1464, 120], [1465, 120], [1466, 120], [1467, 142], [1467, 150], [1467, 168], [1467, 169], [1468, 335], [1469, 142], [1469, 150], [1469, 168], [1469, 169], [1472, 182], [1472, 310], [1474, 133], [1474, 150], [1474, 151], [1474, 160], [1474, 194], [1475, 335], [1476, 178], [1476, 199], [1476, 338], [1476, 341], [1480, 219], [1489, 16], [1489, 128], [1489, 172], [1489, 207], [1489, 208], [1492, 241], [1492, 248], [1498, 146], [1498, 270], [1498, 274], [1499, 21], [1506, 7], [1506, 62], [1506, 64], [1506, 155], [1506, 224], [1506, 236], [1506, 250], [1507, 7], [1507, 62], [1507, 64], [1507, 155], [1507, 224], [1507, 234], [1507, 236], [1507, 245], [1507, 250], [1512, 53], [1512, 54], [1512, 55], [1512, 56], [1512, 57], [1512, 124], [1512, 165], [1512, 260], [1512, 263], [1513, 53], [1513, 54], [1513, 55], [1513, 56], [1513, 57], [1513, 124], [1513, 165], [1513, 260], [1513, 263], [1514, 53], [1514, 54], [1514, 55], [1514, 56], [1514, 57], [1514, 124], [1514, 165], [1514, 260], [1514, 263], [1515, 53], [1515, 54], [1515, 55], [1515, 56], [1515, 57], [1515, 124], [1515, 165], [1515, 260], [1515, 263], [1516, 53], [1516, 54], [1516, 55], [1516, 56], [1516, 57], [1516, 124], [1516, 165], [1516, 260], [1516, 263], [1517, 131], [1517, 132], [1517, 184], [1517, 200], [1517, 201], [1517, 202], [1517, 218], [1517, 282], [1517, 304], [1517, 306], [1517, 311], [1517, 350], [1518, 219], [1519, 138], [1520, 80], [1521, 223], [1521, 283], [1521, 285], [1528, 29], [1529, 14], [1530, 147], [1531, 100], [1531, 270], [1536, 219], [1537, 219], [1539, 219], [1542, 187], [1546, 98], [1551, 79], [1552, 15], [1554, 167], [1554, 302], [1554, 309], [1554, 331], [1556, 134], [1556, 310], [1556, 315], [1557, 192], [1557, 203], [1558, 132], [1558, 133], [1558, 136], [1558, 141], [1558, 147], [1558, 148], [1558, 154], [1558, 156], [1558, 159], [1558, 161], [1558, 164], [1558, 168], [1558, 176], [1558, 189], [1558, 193], [1558, 211], [1558, 214], [1558, 229], [1558, 247], [1558, 270], [1558, 274], [1558, 284], [1558, 285], [1558, 293], [1558, 296], [1558, 298], [1558, 299], [1558, 305], [1558, 306], [1558, 307], [1558, 309], [1558, 314], [1558, 315], [1558, 317], [1558, 322], [1558, 329], [1558, 333], [1558, 350], [1558, 351], [1561, 134], [1561, 139], [1561, 140], [1561, 228], [1563, 134], [1565, 134], [1568, 135], [1569, 135], [1570, 51], [1570, 135], [1572, 168], [1573, 168], [1574, 168], [1577, 294], [1578, 183], [1579, 141], [1579, 314], [1580, 294], [1582, 294], [1583, 182], [1585, 182], [1586, 182], [1587, 182], [1588, 129], [1588, 130], [1588, 131], [1589, 182], [1590, 211], [1593, 104], [1606, 223], [1606, 283], [1606, 285], [1619, 151], [1619, 154], [1619, 186], [1619, 188], [1619, 285], [1619, 287], [1619, 289], [1619, 290], [1619, 292], [1619, 293], [1619, 294], [1619, 296], [1619, 298], [1619, 299], [1619, 305], [1619, 306], [1619, 307], [1619, 308], [1619, 313], [1619, 336], [1619, 339], [1619, 341], [1619, 350], [1620, 161], [1620, 188], [1620, 297], [1620, 298], [1620, 301], [1620, 302], [1620, 304], [1620, 305], [1620, 308], [1625, 16], [1625, 18], [1626, 16], [1636, 186], [1636, 188], [1636, 299], [1636, 301], [1636, 308], [1637, 223], [1639, 139], [1639, 140], [1642, 14], [1642, 208], [1642, 212], [1642, 246], [1642, 268], [1642, 269], [1642, 270], [1642, 271], [1642, 273], [1642, 274], [1642, 316], [1642, 348], [1658, 148], [1658, 270], [1658, 274], [1658, 287], [1660, 100], [1660, 270], [1662, 305], [1665, 43], [1674, 29], [1674, 63], [1676, 131], [1676, 189], [1676, 190], [1676, 191], [1676, 197], [1676, 198], [1676, 199], [1676, 200], [1676, 211], [1676, 234], [1676, 283], [1676, 284], [1676, 289], [1676, 293], [1676, 299], [1676, 301], [1676, 306], [1676, 308], [1676, 336], [1678, 146], [1687, 66], [1688, 66], [1689, 150], [1689, 151], [1689, 162], [1689, 178], [1689, 185], [1689, 251], [1689, 300], [1689, 302], [1689, 303], [1689, 304], [1689, 305], [1689, 306], [1689, 307], [1689, 311], [1689, 338], [1689, 342], [1689, 343], [1689, 349], [1694, 314], [1695, 166], [1695, 168], [1695, 268], [1695, 274], [1695, 302], [1695, 331], [1695, 332], [1695, 333], [1697, 124], [1702, 129], [1702, 196], [1702, 198], [1702, 339], [1703, 132], [1703, 156], [1703, 161], [1703, 188], [1703, 189], [1703, 190], [1703, 191], [1703, 203], [1703, 250], [1703, 283], [1703, 284], [1703, 285], [1703, 297], [1703, 300], [1703, 306], [1703, 307], [1704, 174], [1704, 175], [1705, 174], [1705, 175], [1706, 38], [1706, 41], [1706, 148], [1710, 129], [1710, 196], [1710, 198], [1710, 250], [1710, 339], [1710, 341], [1717, 305], [1718, 305], [1719, 305], [1720, 305], [1721, 305], [1729, 126], [1729, 149], [1730, 126], [1731, 126], [1732, 124], [1734, 122], [1734, 124], [1734, 311], [1735, 124], [1736, 346], [1738, 176], [1738, 179], [1738, 180], [1738, 204], [1738, 223], [1738, 284], [1738, 294], [1738, 311], [1738, 340], [1739, 176], [1739, 179], [1739, 180], [1739, 204], [1739, 223], [1739, 284], [1739, 294], [1739, 311], [1739, 340], [1740, 180], [1740, 204], [1740, 223], [1740, 259], [1740, 283], [1740, 313], [1740, 314], [1748, 219], [1754, 170], [1755, 170], [1759, 40], [1759, 42], [1762, 183], [1763, 117], [1769, 27], [1770, 109], [1770, 297], [1770, 299], [1770, 301], [1770, 302], [1770, 308], [1773, 109], [1773, 297], [1773, 299], [1773, 301], [1773, 302], [1773, 308], [1777, 106], [1779, 309], [1779, 328], [1783, 229], [1783, 295], [1786, 166], [1795, 212], [1796, 156], [1797, 46], [1797, 149], [1798, 313], [1806, 219], [1807, 310], [1809, 49], [1812, 36], [1814, 17], [1814, 83], [1814, 312], [1815, 17], [1815, 83], [1815, 312], [1821, 129], [1824, 125], [1824, 128], [1824, 131], [1824, 176], [1824, 195], [1824, 199], [1824, 200], [1824, 201], [1824, 202], [1824, 204], [1824, 223], [1824, 288], [1824, 313], [1824, 350], [1826, 14], [1826, 163], [1826, 208], [1826, 246], [1826, 268], [1826, 269], [1826, 270], [1826, 271], [1826, 273], [1826, 274], [1826, 316], [1826, 348], [1834, 101], [1834, 109], [1835, 101], [1835, 109], [1836, 101], [1836, 301], [1837, 101], [1838, 101], [1839, 101], [1840, 139], [1840, 140], [1840, 228], [1840, 303], [1840, 311], [1842, 125], [1843, 125], [1844, 125], [1861, 148], [1866, 348], [1867, 348], [1883, 167], [1883, 197], [1883, 272], [1883, 302], [1883, 306], [1883, 311], [1888, 13], [1888, 227], [1890, 139], [1893, 76], [1894, 27], [1894, 230], [1896, 38], [1897, 69], [1898, 38], [1898, 41], [1899, 38], [1899, 41], [1900, 38], [1900, 41], [1901, 38], [1902, 38], [1903, 166], [1904, 69], [1905, 101], [1908, 138], [1908, 240], [1913, 138], [1913, 240], [1914, 285], [1920, 219], [1924, 225], [1924, 244], [1924, 252], [1925, 129], [1925, 156], [1925, 193], [1925, 309], [1926, 29], [1926, 34], [1928, 116], [1928, 156], [1929, 76], [1931, 100], [1931, 153], [1931, 270], [1932, 314], [1938, 142], [1943, 124], [1943, 136], [1943, 137], [1943, 173], [1943, 201], [1943, 202], [1943, 327], [1944, 156], [1944, 203], [1945, 268], [1946, 219], [1949, 305], [1950, 138], [1954, 126], [1954, 163], [1959, 313], [1960, 183], [1964, 140], [1966, 152], [1968, 167], [1968, 233], [1968, 302], [1968, 309], [1968, 314], [1968, 331], [1972, 167], [1972, 197], [1972, 233], [1972, 273], [1972, 302], [1972, 309], [1972, 314], [1972, 331], [1973, 167], [1973, 197], [1973, 233], [1973, 302], [1973, 309], [1973, 314], [1973, 315], [1973, 331], [1974, 167], [1974, 172], [1974, 197], [1974, 233], [1974, 302], [1974, 309], [1974, 314], [1974, 331], [1975, 305], [1978, 126], [1978, 162], [1978, 189], [1978, 268], [1978, 269], [1978, 270], [1978, 272], [1978, 273], [1978, 274], [1982, 125], [1982, 128], [1982, 137], [1982, 164], [1982, 204], [1982, 225], [1983, 124], [1983, 125], [1984, 125], [1984, 180], [1986, 138], [1986, 240], [1987, 122], [1987, 125], [1987, 180], [1988, 125], [1988, 128], [1988, 137], [1988, 164], [1988, 204], [1988, 209], [1988, 215], [1990, 305], [1991, 305], [1992, 305], [1993, 305], [1994, 148], [2000, 134], [2000, 139], [2000, 141], [2000, 142], [2000, 150], [2000, 154], [2000, 162], [2000, 192], [2000, 233], [2000, 284], [2000, 300], [2000, 302], [2000, 306], [2000, 309], [2000, 310], [2000, 311], [2000, 313], [2000, 314], [2000, 321], [2000, 322], [2000, 325], [2000, 326], [2000, 327], [2001, 141], [2001, 314], [2002, 106], [2002, 340], [2003, 106], [2004, 106], [2004, 340], [2005, 183], [2005, 260], [2005, 262], [2006, 260], [2006, 262], [2008, 138], [2017, 122], [2017, 123], [2017, 125], [2017, 131], [2017, 176], [2017, 202], [2017, 211], [2017, 223], [2017, 224], [2017, 280], [2017, 284], [2017, 288], [2017, 300], [2017, 307], [2017, 309], [2017, 314], [2017, 318], [2017, 327], [2018, 128], [2018, 138], [2018, 218], [2018, 248], [2018, 279], [2020, 63], [2022, 1], [2022, 62], [2025, 13], [2030, 183], [2030, 194], [2030, 200], [2030, 306], [2031, 310], [2032, 183], [2032, 186], [2032, 194], [2032, 287], [2032, 289], [2032, 292], [2032, 296], [2033, 149], [2033, 185], [2034, 53], [2038, 24], [2038, 157], [2039, 24], [2039, 157], [2040, 155], [2040, 157], [2040, 234], [2040, 246], [2040, 250], [2041, 155], [2041, 157], [2041, 234], [2041, 246], [2041, 250], [2048, 145], [2048, 147], [2049, 149], [2049, 313], [2051, 149], [2062, 150], [2062, 180], [2062, 202], [2062, 223], [2062, 280], [2062, 283], [2062, 284], [2062, 285], [2062, 288], [2063, 150], [2063, 180], [2063, 202], [2063, 223], [2063, 280], [2063, 283], [2063, 284], [2063, 285], [2063, 288], [2068, 219], [2071, 27], [2071, 29], [2071, 69], [2071, 70], [2071, 75], [2071, 82], [2071, 193], [2079, 229], [2079, 295], [2080, 229], [2080, 295], [2083, 25], [2083, 26], [2083, 31], [2084, 154], [2084, 189], [2084, 285], [2084, 288], [2085, 154], [2086, 154], [2086, 189], [2086, 288], [2088, 80], [2089, 129], [2090, 24], [2091, 18], [2091, 83], [2092, 259], [2093, 262], [2094, 164], [2104, 168], [2104, 174], [2104, 181], [2104, 206], [2105, 134], [2105, 166], [2105, 168], [2105, 174], [2105, 175], [2105, 206], [2105, 268], [2105, 274], [2111, 129], [2117, 252], [2120, 103], [2132, 314], [2136, 2], [2141, 126], [2141, 127], [2141, 161], [2141, 162], [2141, 186], [2141, 268], [2141, 269], [2141, 271], [2141, 272], [2141, 273], [2141, 274], [2141, 301], [2141, 303], [2141, 316], [2141, 348], [2142, 102], [2143, 102], [2147, 151], [2147, 156], [2147, 180], [2147, 181], [2147, 268], [2147, 269], [2147, 270], [2147, 271], [2147, 273], [2147, 274], [2147, 283], [2147, 285], [2149, 151], [2149, 156], [2149, 180], [2149, 181], [2149, 268], [2149, 269], [2149, 270], [2149, 271], [2149, 273], [2149, 274], [2149, 283], [2149, 285], [2152, 178], [2153, 309], [2153, 327], [2162, 305], [2163, 2], [2163, 36], [2163, 334], [2163, 348], [2165, 42], [2165, 43], [2166, 42], [2166, 43], [2168, 54], [2168, 152], [2173, 148], [2175, 54], [2188, 166], [2189, 183], [2191, 150], [2192, 150], [2197, 219], [2198, 155], [2198, 224], [2198, 245], [2198, 246], [2198, 250], [2199, 65], [2200, 65], [2201, 272], [2202, 123], [2202, 125], [2202, 131], [2202, 146], [2202, 150], [2202, 170], [2202, 171], [2202, 176], [2202, 179], [2202, 180], [2202, 181], [2202, 184], [2202, 186], [2202, 192], [2202, 216], [2202, 222], [2202, 223], [2202, 226], [2202, 231], [2202, 233], [2202, 235], [2202, 240], [2202, 280], [2202, 282], [2202, 283], [2202, 284], [2202, 288], [2202, 296], [2202, 298], [2202, 300], [2202, 304], [2202, 305], [2202, 311], [2202, 313], [2202, 315], [2202, 316], [2202, 326], [2202, 350], [2202, 351], [2205, 219], [2207, 122], [2207, 127], [2207, 303], 