{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 69760], "name": "inputs", "sparse": false}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Diagonal", "config": {"name": "h0", "dtype": "float32", "activation": "tanh", "trainable": true, "units": 17440, "batch_input_shape": [null, 69760], "use_bias": true}, "inbound_nodes": [[["inputs", 0, 0, {}]]], "name": "h0"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_0"}, "inbound_nodes": [[["h0", 0, 0, {"training": false}]]], "name": "dropout_0"}, {"class_name": "SparseTF", "config": {"W_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "h1", "bias_regularizer": null, "activation": "tanh", "trainable": true, "nonzero_ind": [[0, 142], [2, 142], [8, 2], [8, 3], [15, 150], [15, 161], [16, 4], [16, 44], [17, 4], [17, 44], [18, 15], [18, 351], [19, 16], [19, 329], [19, 330], [20, 305], [21, 305], [22, 305], [23, 305], [25, 126], [25, 235], [25, 239], [25, 321], [27, 74], [28, 305], [29, 305], [30, 126], [30, 128], [30, 157], [30, 172], [30, 173], [30, 209], [30, 211], [30, 214], [30, 235], [30, 239], [30, 276], [30, 279], [30, 321], [37, 178], [38, 65], [38, 152], [40, 124], [40, 125], [40, 126], [40, 128], [40, 138], [40, 207], [40, 209], [40, 213], [40, 268], [40, 270], [40, 271], [40, 272], [40, 273], [40, 274], [40, 275], [40, 276], [40, 278], [40, 279], [43, 98], [45, 100], [45, 270], [45, 301], [46, 117], [47, 146], [47, 169], [47, 241], [47, 248], [47, 271], [47, 272], [47, 300], [47, 309], [47, 310], [47, 331], [47, 335], [47, 348], [57, 272], [63, 262], [70, 58], [70, 149], [74, 154], [74, 176], [74, 177], [74, 178], [74, 223], [74, 302], [74, 345], [74, 346], [74, 347], [75, 154], [75, 176], [75, 177], [75, 178], [75, 223], [75, 302], [75, 345], [75, 346], [75, 347], [76, 58], [78, 126], [78, 127], [78, 128], [78, 163], [78, 164], [78, 233], [78, 260], [78, 268], [78, 272], [78, 274], [78, 345], [78, 346], [78, 347], [78, 348], [79, 126], [79, 127], [79, 128], [79, 163], [79, 164], [79, 233], [79, 260], [79, 268], [79, 272], [79, 274], [79, 345], [79, 346], [79, 347], [79, 348], [80, 126], [80, 127], [80, 128], [80, 163], [80, 164], [80, 233], [80, 260], [80, 268], [80, 272], [80, 274], [80, 345], [80, 346], [80, 347], [80, 348], [81, 154], [81, 176], [81, 177], [81, 194], [81, 223], [81, 302], [81, 345], [81, 346], [81, 347], [82, 151], [82, 154], [82, 176], [82, 177], [82, 184], [82, 194], [82, 223], [82, 302], [82, 309], [82, 313], [82, 329], [82, 345], [82, 346], [82, 347], [83, 154], [83, 176], [83, 177], [83, 194], [83, 223], [83, 302], [83, 309], [83, 329], [83, 345], [83, 346], [83, 347], [84, 154], [84, 176], [84, 177], [84, 178], [84, 194], [84, 204], [84, 205], [84, 223], [84, 288], [84, 289], [84, 302], [84, 345], [84, 346], [84, 347], [85, 113], [85, 151], [85, 154], [85, 176], [85, 177], [85, 194], [85, 223], [85, 280], [85, 284], [85, 286], [85, 288], [85, 302], [85, 305], [85, 313], [85, 314], [85, 345], [85, 346], [85, 347], [86, 154], [86, 176], [86, 177], [86, 178], [86, 194], [86, 223], [86, 293], [86, 302], [86, 309], [86, 329], [86, 345], [86, 346], [86, 347], [87, 154], [87, 176], [87, 177], [87, 223], [87, 302], [87, 345], [87, 346], [87, 347], [88, 126], [88, 138], [91, 109], [103, 126], [103, 138], [103, 259], [104, 10], [104, 296], [112, 138], [114, 169], [117, 41], [118, 41], [119, 154], [119, 176], [119, 177], [119, 240], [119, 247], [119, 262], [119, 294], [119, 302], [119, 309], [119, 329], [120, 154], [120, 176], [120, 177], [120, 240], [120, 247], [120, 262], [120, 294], [120, 302], [120, 309], [120, 329], [121, 154], [121, 176], [121, 177], [121, 240], [121, 247], [121, 262], [121, 294], [121, 302], [121, 309], [121, 329], [122, 154], [122, 176], [122, 177], [122, 240], [122, 247], [122, 262], [122, 294], [122, 302], [122, 309], [122, 329], [123, 154], [123, 176], [123, 177], [123, 240], [123, 247], [123, 262], [123, 294], [123, 302], [123, 309], [123, 329], [125, 48], [126, 47], [127, 48], [129, 48], [130, 47], [131, 48], [132, 183], [132, 223], [132, 296], [133, 219], [134, 132], [134, 156], [134, 310], [134, 328], [135, 72], [136, 169], [137, 151], [137, 154], [137, 176], [137, 177], [137, 178], [137, 223], [137, 233], [137, 300], [137, 302], [137, 309], [137, 313], [137, 329], [137, 345], [137, 346], [137, 347], [137, 351], [138, 31], [138, 64], [140, 125], [140, 178], [140, 186], [140, 195], [140, 204], [140, 223], [140, 292], [140, 303], [140, 306], [140, 341], [140, 349], [141, 125], [141, 151], [141, 178], [141, 183], [141, 186], [141, 194], [141, 204], [141, 223], [141, 286], [141, 287], [141, 289], [141, 294], [141, 296], [141, 310], [141, 328], [143, 223], [145, 169], [145, 182], [147, 267], [148, 169], [148, 182], [149, 169], [150, 169], [150, 174], [152, 169], [152, 174], [152, 182], [152, 310], [155, 68], [159, 113], [159, 149], [159, 150], [160, 301], [163, 54], [166, 262], [167, 262], [168, 262], [169, 262], [170, 216], [170, 270], [170, 271], [170, 274], [175, 138], [183, 14], [183, 163], [183, 208], [183, 246], [183, 268], [183, 269], [183, 270], [183, 271], [183, 273], [183, 274], [183, 316], [183, 348], [184, 14], [184, 163], [184, 208], [184, 246], [184, 268], [184, 269], [184, 270], [184, 271], [184, 273], [184, 274], [184, 316], [184, 348], [186, 232], [189, 129], [189, 132], [190, 149], [190, 151], [190, 156], [190, 185], [190, 296], [191, 24], [191, 152], [200, 127], [200, 128], [200, 163], [200, 164], [200, 225], [200, 232], [200, 233], [200, 239], [200, 253], [200, 254], [200, 256], [200, 258], [200, 259], [200, 260], [200, 261], [200, 262], [200, 264], [200, 266], [201, 127], [201, 128], [201, 163], [201, 164], [201, 225], [201, 232], [201, 233], [201, 239], [201, 253], [201, 254], [201, 256], [201, 258], [201, 259], [201, 260], [201, 261], [201, 262], [201, 264], [201, 266], [202, 127], [202, 128], [202, 163], [202, 164], [202, 225], [202, 232], [202, 233], [202, 239], [202, 253], [202, 254], [202, 256], [202, 258], [202, 259], [202, 260], [202, 261], [202, 262], [202, 264], [202, 266], [203, 127], [203, 128], [203, 163], [203, 164], [203, 225], [203, 232], [203, 233], [203, 239], [203, 253], [203, 254], [203, 256], [203, 258], [203, 259], [203, 260], [203, 261], [203, 262], [203, 264], [203, 266], [205, 142], [205, 168], [207, 58], [207, 126], [207, 136], [207, 137], [207, 171], [207, 172], [207, 202], [207, 296], [208, 58], [208, 126], [208, 136], [208, 137], [208, 171], [208, 172], [208, 202], [208, 296], [212, 100], [213, 140], [213, 228], [214, 305], [215, 140], [215, 228], [216, 140], [216, 228], [221, 31], [221, 64], [221, 65], [221, 216], [222, 305], [223, 305], [228, 305], [232, 129], [232, 130], [232, 193], [232, 293], [232, 296], [232, 300], [233, 182], [235, 117], [236, 138], [236, 243], [238, 100], [238, 270], [240, 305], [241, 145], [241, 147], [242, 145], [242, 147], [243, 145], [243, 147], [245, 127], [245, 128], [245, 154], [245, 155], [245, 157], [245, 164], [245, 203], [245, 208], [245, 214], [245, 217], [245, 225], [245, 232], [245, 236], [245, 239], [245, 240], [245, 241], [245, 245], [245, 248], [245, 255], [245, 271], [245, 273], [245, 275], [245, 276], [245, 279], [245, 298], [245, 300], [245, 302], [245, 303], [245, 311], [245, 315], [245, 322], [246, 145], [246, 147], [252, 183], [253, 15], [254, 16], [254, 70], [255, 183], [255, 308], [256, 183], [256, 308], [257, 219], [258, 219], [261, 100], [261, 101], [262, 14], [262, 151], [262, 210], [262, 257], [262, 281], [262, 282], [262, 302], [262, 341], [263, 14], [263, 151], [263, 210], [263, 257], [263, 281], [263, 282], [263, 302], [263, 341], [264, 305], [266, 100], [267, 169], [269, 25], [269, 36], [272, 282], [273, 310], [277, 310], [284, 51], [284, 126], [284, 135], [284, 140], [284, 233], [284, 284], [285, 51], [285, 135], [289, 69], [296, 305], [303, 185], [303, 296], [303, 344], [304, 252], [306, 178], [307, 178], [308, 178], [312, 150], [314, 166], [314, 174], [314, 182], [314, 223], [314, 248], [314, 268], [314, 274], [314, 302], [314, 309], [314, 314], [314, 317], [314, 320], [314, 324], [314, 331], [314, 332], [314, 333], [317, 14], [317, 163], [317, 208], [317, 246], [317, 268], [317, 269], [317, 270], [317, 271], [317, 273], [317, 274], [317, 316], [317, 348], [319, 262], [320, 14], [320, 163], [320, 208], [320, 246], [320, 268], [320, 269], [320, 270], [320, 271], [320, 273], [320, 274], [320, 316], [320, 348], [321, 141], [324, 305], [328, 189], [329, 148], [329, 156], [329, 159], [329, 274], [329, 283], [329, 285], [329, 297], [329, 299], [329, 300], [329, 301], [329, 302], [329, 304], [329, 305], [329, 306], [329, 307], [329, 309], [329, 310], [329, 311], [329, 314], [329, 317], [329, 319], [329, 320], [329, 321], [329, 323], [329, 324], [329, 325], [329, 327], [329, 329], [329, 330], [329, 331], [329, 332], [329, 333], [332, 126], [332, 128], [332, 138], [332, 227], [332, 231], [334, 219], [335, 122], [335, 124], [335, 154], [335, 194], [335, 309], [335, 310], [335, 328], [335, 334], [336, 150], [338, 350], [339, 305], [341, 170], [342, 170], [344, 219], [349, 141], [349, 162], [349, 310], [355, 134], [355, 139], [355, 142], [355, 153], [355, 306], [355, 309], [355, 311], [355, 329], [356, 126], [356, 138], [357, 10], [358, 181], [358, 346], [360, 138], [360, 172], [363, 11], [363, 115], [364, 178], [364, 204], [365, 122], [365, 314], [366, 16], [366, 67], [367, 136], [367, 138], [368, 208], [370, 305], [371, 208], [372, 305], [379, 21], [384, 305], [385, 305], [387, 305], [388, 305], [389, 224], [390, 224], [392, 189], [394, 310], [395, 70], [401, 121], [402, 24], [402, 122], [402, 309], [402, 327], [403, 125], [403, 154], [403, 176], [403, 177], [403, 184], [403, 186], [403, 194], [403, 223], [403, 302], [403, 309], [403, 329], [403, 345], [403, 346], [403, 347], [403, 351], [405, 189], [410, 183], [413, 183], [415, 219], [417, 100], [417, 270], [423, 232], [424, 232], [431, 139], [431, 140], [431, 141], [431, 162], [431, 181], [431, 228], [431, 307], [431, 311], [433, 142], [433, 284], [440, 151], [440, 178], [440, 185], [440, 194], [440, 197], [440, 198], [440, 205], [440, 251], [440, 289], [440, 293], [440, 296], [440, 301], [440, 303], [440, 305], [440, 306], [440, 337], [440, 338], [440, 339], [440, 340], [440, 341], [440, 342], [440, 343], [440, 349], [442, 147], [447, 141], [448, 106], [451, 206], [452, 206], [453, 141], [453, 154], [453, 156], [453, 159], [453, 171], [453, 233], [453, 268], [453, 269], [453, 270], [453, 271], [453, 273], [453, 274], [453, 283], [453, 287], [453, 293], [453, 296], [453, 297], [453, 298], [453, 299], [453, 300], [453, 301], [453, 304], [453, 305], [453, 306], [453, 307], [453, 309], [453, 317], [453, 319], [453, 320], [453, 322], [453, 329], [453, 330], [453, 349], [453, 350], [456, 305], [457, 305], [458, 305], [461, 305], [464, 124], [464, 132], [464, 195], [464, 197], [464, 198], [464, 199], [464, 288], [464, 336], [464, 344], [468, 106], [469, 122], [469, 124], [469, 125], [469, 128], [469, 131], [469, 136], [469, 166], [469, 170], [469, 171], [469, 176], [469, 179], [469, 186], [469, 195], [469, 200], [469, 201], [469, 202], [469, 204], [469, 223], [469, 273], [469, 288], [469, 300], [469, 307], [469, 309], [469, 317], [469, 319], [469, 335], [469, 348], [469, 349], [469, 351], [470, 122], [470, 124], [470, 125], [470, 128], [470, 131], [470, 136], [470, 166], [470, 170], [470, 171], [470, 176], [470, 179], [470, 195], [470, 200], [470, 201], [470, 223], [470, 288], [470, 300], [470, 307], [470, 309], [470, 317], [470, 319], [470, 335], [470, 349], [470, 351], [471, 122], [471, 124], [471, 125], [471, 128], [471, 131], [471, 136], [471, 151], [471, 154], [471, 166], [471, 170], [471, 171], [471, 173], [471, 176], [471, 179], [471, 180], [471, 186], [471, 188], [471, 195], [471, 200], [471, 201], [471, 202], [471, 204], [471, 211], [471, 223], [471, 246], [471, 247], [471, 260], [471, 270], [471, 273], [471, 274], [471, 280], [471, 282], [471, 283], [471, 284], [471, 285], [471, 288], [471, 300], [471, 304], [471, 306], [471, 307], [471, 309], [471, 311], [471, 313], [471, 316], [471, 317], [471, 318], [471, 319], [471, 335], [471, 348], [471, 349], [471, 350], [471, 351], [472, 98], [473, 176], [473, 179], [473, 204], [473, 223], [473, 280], [473, 284], [473, 294], [474, 210], [475, 210], [476, 210], [477, 150], [477, 210], [477, 254], [477, 271], [478, 210], [479, 150], [479, 210], [479, 254], [479, 271], [483, 99], [485, 310], [486, 241], [486, 248], [486, 310], [488, 142], [488, 344], [489, 146], [496, 302], [499, 302], [503, 168], [503, 309], [503, 324], [504, 128], [504, 168], [504, 170], [504, 309], [504, 313], [504, 324], [509, 50], [509, 263], [510, 162], [511, 162], [512, 206], [519, 47], [519, 49], [520, 43], [521, 43], [524, 124], [524, 125], [524, 126], [524, 127], [524, 128], [524, 135], [524, 140], [524, 162], [524, 164], [524, 165], [524, 172], [524, 192], [524, 207], [524, 209], [524, 211], [524, 217], [524, 219], [524, 221], [524, 222], [524, 224], [524, 226], [524, 230], [524, 235], [524, 236], [524, 238], [524, 239], [524, 258], [524, 259], [524, 268], [524, 269], [524, 274], [524, 276], [524, 279], [524, 286], [524, 296], [524, 300], [524, 304], [524, 307], [524, 309], [524, 321], [524, 350], [524, 351], [525, 124], [525, 125], [525, 126], [525, 127], [525, 128], [525, 135], [525, 140], [525, 162], [525, 164], [525, 165], [525, 172], [525, 192], [525, 207], [525, 209], [525, 211], [525, 217], [525, 219], [525, 221], [525, 222], [525, 224], [525, 226], [525, 230], [525, 235], [525, 236], [525, 238], [525, 239], [525, 258], [525, 259], [525, 268], [525, 269], [525, 274], [525, 276], [525, 279], [525, 286], [525, 296], [525, 300], [525, 304], [525, 307], [525, 309], [525, 321], [525, 350], [525, 351], [526, 150], [527, 124], [527, 125], [527, 126], [527, 127], [527, 128], [527, 135], [527, 140], [527, 162], [527, 164], [527, 165], [527, 172], [527, 192], [527, 207], [527, 209], [527, 211], [527, 217], [527, 219], [527, 221], [527, 222], [527, 224], [527, 226], [527, 230], [527, 235], [527, 236], [527, 238], [527, 239], [527, 258], [527, 259], [527, 268], [527, 269], [527, 274], [527, 276], [527, 279], [527, 286], [527, 296], [527, 300], [527, 304], [527, 307], [527, 309], [527, 321], [527, 350], [527, 351], [531, 186], [531, 189], [531, 191], [531, 285], [536, 213], [543, 134], [543, 192], [543, 296], [545, 170], [546, 333], [549, 186], [550, 266], [552, 126], [552, 138], [552, 222], [555, 186], [556, 186], [561, 332], [565, 148], [566, 311], [567, 148], [570, 122], [570, 123], [570, 124], [570, 125], [570, 127], [570, 128], [570, 131], [570, 133], [570, 134], [570, 136], [570, 137], [570, 147], [570, 153], [570, 154], [570, 155], [570, 156], [570, 157], [570, 158], [570, 162], [570, 164], [570, 171], [570, 172], [570, 173], [570, 176], [570, 182], [570, 184], [570, 186], [570, 188], [570, 192], [570, 193], [570, 199], [570, 200], [570, 201], [570, 202], [570, 203], [570, 211], [570, 214], [570, 217], [570, 223], [570, 224], [570, 228], [570, 231], [570, 233], [570, 234], [570, 236], [570, 237], [570, 240], [570, 243], [570, 245], [570, 246], [570, 247], [570, 250], [570, 261], [570, 268], [570, 272], [570, 284], [570, 285], [570, 288], [570, 290], [570, 293], [570, 296], [570, 297], [570, 298], [570, 299], [570, 300], [570, 301], [570, 302], [570, 303], [570, 304], [570, 305], [570, 306], [570, 307], [570, 309], [570, 313], [570, 315], [570, 316], [570, 317], [570, 318], [570, 319], [570, 320], [570, 321], [570, 322], [570, 325], [570, 327], [570, 328], [570, 329], [570, 330], [570, 331], [570, 332], [570, 333], [570, 334], [570, 335], [570, 336], [570, 348], [570, 350], [570, 351], [571, 156], [573, 124], [573, 137], [573, 170], [573, 192], [573, 193], [573, 195], [573, 204], [573, 211], [573, 234], [573, 245], [573, 282], [573, 283], [573, 305], [573, 313], [573, 316], [573, 318], [573, 327], [573, 336], [576, 138], [577, 138], [578, 138], [581, 11], [582, 129], [582, 156], [582, 193], [582, 309], [583, 99], [584, 99], [585, 99], [586, 99], [587, 99], [588, 99], [591, 124], [591, 136], [591, 137], [591, 173], [591, 201], [591, 202], [591, 327], [592, 99], [593, 123], [593, 124], [593, 137], [593, 211], [593, 280], [593, 313], [593, 318], [593, 332], [593, 333], [595, 252], [597, 305], [600, 305], [606, 106], [606, 305], [607, 106], [607, 305], [608, 106], [608, 270], [608, 305], [609, 106], [609, 305], [610, 106], [610, 196], [610, 305], [612, 106], [612, 270], [612, 305], [615, 106], [615, 305], [616, 134], [616, 139], [616, 140], [616, 141], [616, 154], [616, 162], [616, 228], [616, 248], [616, 297], [616, 298], [616, 299], [616, 302], [616, 303], [616, 306], [616, 309], [616, 311], [616, 322], [616, 329], [616, 333], [619, 148], [621, 151], [621, 178], [621, 185], [621, 194], [621, 197], [621, 198], [621, 205], [621, 251], [621, 289], [621, 293], [621, 296], [621, 301], [621, 303], [621, 305], [621, 306], [621, 337], [621, 338], [621, 339], [621, 340], [621, 341], [621, 342], [621, 343], [621, 349], [626, 4], [627, 170], [627, 268], [627, 274], [627, 275], [632, 147], [642, 125], [642, 137], [642, 138], [642, 154], [642, 223], [642, 283], [642, 309], [643, 305], [644, 305], [646, 305], [647, 305], [648, 305], [649, 305], [650, 138], [652, 154], [652, 176], [652, 177], [652, 240], [652, 247], [652, 262], [652, 294], [652, 302], [652, 309], [652, 329], [655, 150], [656, 147], [656, 155], [656, 157], [656, 234], [656, 235], [656, 250], [656, 279], [657, 279], [660, 219], [663, 283], [664, 283], [665, 283], [666, 283], [667, 283], [668, 283], [669, 283], [670, 283], [673, 150], [673, 161], [674, 99], [674, 308], [675, 195], [677, 150], [677, 161], [678, 109], [678, 150], [678, 161], [679, 150], [679, 161], [681, 219], [682, 219], [683, 219], [684, 18], [685, 18], [686, 219], [691, 310], [692, 310], [705, 40], [705, 42], [706, 123], [706, 125], [706, 131], [706, 146], [706, 150], [706, 170], [706, 171], [706, 176], [706, 179], [706, 180], [706, 181], [706, 184], [706, 186], [706, 192], [706, 216], [706, 222], [706, 223], [706, 226], [706, 231], [706, 233], [706, 235], [706, 240], [706, 280], [706, 282], [706, 283], [706, 284], [706, 288], [706, 296], [706, 298], [706, 300], [706, 304], [706, 305], [706, 311], [706, 313], [706, 315], [706, 316], [706, 326], [706, 350], [706, 351], [708, 40], [708, 42], [709, 122], [709, 127], [709, 303], [709, 311], [710, 305], [718, 21], [718, 25], [718, 36], [719, 35], [730, 138], [731, 138], [733, 148], [733, 297], [733, 299], [733, 305], [734, 146], [734, 147], [734, 148], [734, 156], [734, 246], [734, 268], [734, 269], [734, 270], [734, 273], [734, 274], [734, 297], [734, 299], [734, 305], [734, 350], [736, 116], [737, 147], [737, 148], [737, 297], [737, 299], [737, 305], [738, 150], [738, 283], [738, 288], [740, 138], [741, 122], [741, 123], [741, 154], [741, 317], [746, 150], [746, 202], [747, 150], [747, 202], [748, 202], [748, 283], [749, 51], [749, 135], [750, 183], [750, 313], [751, 16], [751, 18], [761, 53], [765, 40], [767, 40], [768, 40], [769, 59], [770, 219], [771, 65], [774, 53], [774, 54], [775, 53], [775, 54], [776, 53], [776, 160], [777, 53], [777, 54], [778, 55], [778, 201], [778, 215], [778, 227], [778, 293], [780, 52], [781, 52], [782, 52], [783, 52], [784, 138], [784, 165], [785, 52], [787, 52], [788, 52], [789, 52], [790, 52], [791, 52], [792, 52], [793, 52], [794, 205], [795, 52], [797, 52], [799, 52], [800, 52], [801, 52], [802, 52], [803, 16], [803, 18], [803, 306], [806, 146], [809, 67], [809, 74], [811, 47], [812, 115], [812, 151], [812, 350], [821, 133], [821, 334], [823, 348], [824, 348], [825, 10], [826, 348], [827, 14], [827, 141], [827, 156], [827, 159], [827, 246], [827, 268], [827, 269], [827, 270], [827, 271], [827, 272], [827, 273], [827, 274], [827, 283], [827, 284], [827, 285], [827, 287], [827, 293], [827, 296], [827, 297], [827, 298], [827, 299], [827, 300], [827, 301], [827, 304], [827, 305], [827, 306], [827, 307], [827, 309], [827, 317], [827, 329], [827, 349], [827, 350], [829, 187], [830, 283], [831, 67], [831, 74], [833, 108], [833, 148], [833, 151], [833, 281], [834, 108], [834, 148], [834, 151], [834, 281], [835, 67], [835, 74], [836, 55], [836, 132], [836, 171], [836, 192], [836, 196], [836, 203], [836, 212], [836, 215], [836, 227], [836, 235], [836, 237], [836, 268], [836, 274], [836, 289], [836, 300], [836, 302], [836, 304], [836, 309], [836, 312], [836, 314], [836, 329], [837, 55], [837, 184], [837, 215], [837, 237], [839, 101], [839, 136], [839, 154], [839, 155], [839, 164], [839, 217], [839, 302], [840, 36], [840, 81], [840, 82], [840, 83], [840, 309], [840, 312], [840, 315], [840, 316], [840, 332], [840, 351], [846, 219], [848, 14], [848, 208], [848, 212], [848, 246], [848, 268], [848, 269], [848, 270], [848, 271], [848, 273], [848, 274], [848, 316], [848, 348], [849, 268], [849, 269], [851, 268], [851, 269], [852, 268], [852, 269], [853, 97], [854, 160], [854, 268], [854, 269], [859, 122], [859, 124], [859, 126], [859, 154], [859, 211], [859, 279], [860, 126], [860, 211], [860, 334], [862, 134], [862, 139], [862, 166], [862, 169], [862, 172], [862, 174], [862, 179], [862, 182], [862, 198], [862, 247], [862, 298], [862, 303], [862, 309], [862, 317], [862, 319], [862, 327], [862, 332], [862, 333], [867, 100], [867, 101], [871, 219], [873, 122], [873, 148], [873, 156], [873, 246], [873, 268], [873, 269], [873, 270], [873, 273], [873, 274], [873, 310], [873, 350], [876, 170], [878, 262], [880, 219], [881, 139], [881, 150], [881, 162], [881, 169], [881, 172], [881, 174], [881, 182], [881, 198], [881, 240], [881, 247], [881, 290], [881, 303], [881, 309], [881, 313], [881, 317], [881, 319], [881, 332], [881, 333], [881, 339], [881, 348], [883, 145], [883, 147], [883, 268], [883, 270], [883, 271], [883, 272], [883, 274], [884, 134], [884, 139], [884, 150], [884, 162], [884, 166], [884, 169], [884, 172], [884, 174], [884, 179], [884, 182], [884, 198], [884, 247], [884, 298], [884, 303], [884, 309], [884, 317], [884, 319], [884, 327], [884, 332], [884, 333], [884, 339], [884, 348], [885, 31], [885, 64], [885, 152], [885, 155], [885, 250], [886, 129], [886, 169], [886, 174], [886, 227], [887, 129], [887, 169], [887, 174], [888, 129], [888, 169], [888, 174], [888, 182], [888, 233], [888, 309], [888, 324], [888, 351], [889, 129], [890, 129], [890, 169], [890, 174], [890, 309], [890, 324], [892, 119], [892, 121], [902, 105], [902, 117], [902, 118], [902, 119], [902, 121], [903, 208], [909, 124], [909, 174], [909, 175], [909, 309], [909, 314], [909, 326], [909, 330], [912, 175], [913, 124], [913, 125], [913, 162], [913, 204], [913, 309], [913, 330], [914, 175], [916, 174], [916, 175], [918, 98], [920, 297], [920, 301], [923, 67], [923, 143], [927, 302], [927, 311], [931, 166], [932, 345], [932, 346], [932, 347], [932, 349], [935, 149], [935, 267], [936, 149], [936, 267], [941, 129], [941, 154], [941, 193], [941, 194], [941, 197], [941, 198], [941, 309], [941, 339], [942, 252], [943, 51], [943, 135], [943, 151], [943, 223], [944, 127], [944, 136], [944, 165], [944, 172], [944, 180], [944, 202], [944, 222], [944, 239], [944, 244], [944, 245], [944, 247], [944, 284], [944, 314], [948, 177], [948, 345], [948, 346], [948, 347], [948, 349], [949, 151], [949, 255], [949, 285], [956, 79], [957, 24], [957, 208], [958, 116], [965, 97], [965, 263], [965, 264], [965, 267], [966, 83], [966, 151], [966, 186], [966, 310], [966, 328], [967, 129], [967, 193], [968, 137], [968, 138], [968, 165], [968, 255], [970, 4], [970, 44], [971, 122], [976, 178], [978, 208], [980, 106], [981, 272], [982, 309], [982, 329], [983, 219], [984, 219], [986, 31], [986, 32], [986, 71], [989, 80], [990, 136], [990, 137], [990, 184], [990, 192], [990, 195], [990, 201], [990, 296], [990, 337], [991, 102], [992, 102], [993, 102], [994, 102], [995, 270], [995, 271], [995, 274], [1000, 13], [1000, 38], [1001, 13], [1001, 322], [1002, 13], [1009, 162], [1010, 162], [1011, 149], [1013, 149], [1014, 149], [1021, 285], [1023, 0], [1023, 9], [1023, 27], [1023, 62], [1023, 75], [1023, 81], [1023, 82], [1023, 250], [1024, 0], [1024, 9], [1024, 27], [1024, 62], [1024, 75], [1024, 81], [1024, 82], [1024, 250], [1025, 0], [1025, 9], [1025, 27], [1025, 62], [1025, 75], [1025, 81], [1025, 82], [1025, 250], [1026, 0], [1026, 9], [1026, 27], [1026, 62], [1026, 75], [1026, 81], [1026, 82], [1026, 250], [1029, 305], [1035, 4], [1035, 155], [1035, 236], [1036, 122], [1036, 124], [1036, 126], [1036, 128], [1036, 131], [1036, 140], [1036, 147], [1036, 157], [1036, 158], [1036, 164], [1036, 165], [1036, 166], [1036, 168], [1036, 172], [1036, 180], [1036, 181], [1036, 184], [1036, 207], [1036, 208], [1036, 209], [1036, 212], [1036, 213], [1036, 214], [1036, 215], [1036, 216], [1036, 217], [1036, 219], [1036, 220], [1036, 222], [1036, 224], [1036, 225], [1036, 226], [1036, 227], [1036, 228], [1036, 230], [1036, 232], [1036, 233], [1036, 235], [1036, 236], [1036, 237], [1036, 238], [1036, 239], [1036, 240], [1036, 241], [1036, 248], [1036, 254], [1036, 255], [1036, 258], [1036, 259], [1036, 264], [1036, 269], [1036, 273], [1036, 275], [1036, 276], [1036, 277], [1036, 279], [1036, 281], [1036, 294], [1036, 300], [1036, 302], [1036, 303], [1036, 309], [1036, 311], [1036, 313], [1036, 315], [1036, 347], [1038, 122], [1038, 124], [1038, 126], [1038, 128], [1038, 131], [1038, 140], [1038, 147], [1038, 157], [1038, 158], [1038, 164], [1038, 165], [1038, 166], [1038, 168], [1038, 172], [1038, 180], [1038, 181], [1038, 184], [1038, 207], [1038, 208], [1038, 209], [1038, 212], [1038, 213], [1038, 214], [1038, 215], [1038, 216], [1038, 217], [1038, 219], [1038, 220], [1038, 222], [1038, 224], [1038, 225], [1038, 226], [1038, 227], [1038, 228], [1038, 230], [1038, 232], [1038, 233], [1038, 235], [1038, 236], [1038, 237], [1038, 238], [1038, 239], [1038, 240], [1038, 241], [1038, 248], [1038, 254], [1038, 255], [1038, 258], [1038, 259], [1038, 264], [1038, 269], [1038, 273], [1038, 275], [1038, 276], [1038, 277], [1038, 279], [1038, 281], [1038, 294], [1038, 300], [1038, 302], [1038, 303], [1038, 309], [1038, 311], [1038, 313], [1038, 315], [1038, 347], [1039, 107], [1040, 107], [1041, 107], [1041, 268], [1041, 269], [1041, 270], [1041, 271], [1041, 272], [1041, 273], [1041, 274], [1042, 107], [1042, 268], [1042, 269], [1042, 270], [1042, 271], [1042, 272], [1042, 273], [1042, 274], [1043, 107], [1043, 268], [1043, 269], [1043, 270], [1043, 271], [1043, 272], [1043, 273], [1043, 274], [1045, 107], [1045, 268], [1045, 269], [1045, 270], [1045, 271], [1045, 272], [1045, 273], [1045, 274], [1046, 107], [1046, 268], [1046, 269], [1046, 270], [1046, 271], [1046, 272], [1046, 273], [1046, 274], [1047, 107], [1047, 268], [1047, 269], [1047, 270], [1047, 271], [1047, 272], [1047, 273], [1047, 274], [1048, 4], [1048, 155], [1048, 233], [1054, 160], [1055, 4], [1055, 155], [1059, 121], [1060, 121], [1063, 239], [1065, 220], [1065, 262], [1069, 206], [1070, 206], [1072, 75], [1077, 62], [1080, 150], [1088, 100], [1088, 270], [1102, 3], [1103, 77], [1103, 152], [1105, 124], [1105, 125], [1105, 128], [1105, 138], [1105, 207], [1105, 209], [1105, 213], [1105, 217], [1105, 268], [1105, 270], [1105, 271], [1105, 272], [1105, 273], [1105, 274], [1105, 275], [1105, 276], [1105, 278], [1105, 279], [1105, 340], [1106, 126], [1106, 128], [1106, 138], [1106, 207], [1106, 209], [1106, 213], [1106, 268], [1106, 270], [1106, 272], [1106, 273], [1106, 274], [1106, 275], [1106, 276], [1106, 278], [1106, 279], [1107, 126], [1107, 290], [1107, 294], [1108, 124], [1108, 125], [1108, 126], [1108, 128], [1108, 138], [1108, 207], [1108, 209], [1108, 213], [1108, 217], [1108, 268], [1108, 270], [1108, 272], [1108, 273], [1108, 274], [1108, 275], [1108, 276], [1108, 278], [1108, 279], [1108, 340], [1109, 122], [1109, 127], [1109, 136], [1109, 137], [1109, 165], [1109, 218], [1109, 223], [1109, 283], [1109, 300], [1109, 309], [1111, 126], [1111, 128], [1111, 138], [1111, 207], [1111, 209], [1111, 213], [1111, 268], [1111, 270], [1111, 272], [1111, 273], [1111, 274], [1111, 275], [1111, 276], [1111, 278], [1111, 279], [1112, 126], [1112, 127], [1112, 165], [1112, 181], [1112, 214], [1112, 218], [1112, 225], [1112, 226], [1112, 239], [1112, 241], [1112, 243], [1112, 248], [1112, 290], [1112, 294], [1112, 300], [1112, 307], [1112, 309], [1113, 211], [1113, 224], [1114, 211], [1115, 97], [1115, 151], [1115, 185], [1115, 300], [1115, 305], [1115, 306], [1115, 307], [1115, 344], [1116, 97], [1116, 151], [1116, 185], [1116, 300], [1116, 305], [1116, 306], [1116, 307], [1116, 344], [1117, 224], [1121, 129], [1121, 130], [1121, 182], [1121, 193], [1121, 198], [1121, 304], [1121, 308], [1121, 309], [1121, 311], [1124, 148], [1124, 287], [1126, 148], [1126, 287], [1127, 122], [1128, 16], [1128, 127], [1129, 1], [1135, 18], [1135, 83], [1138, 265], [1140, 220], [1141, 220], [1142, 126], [1142, 138], [1142, 214], [1142, 223], [1142, 268], [1142, 274], [1143, 220], [1144, 220], [1145, 21], [1145, 71], [1146, 21], [1146, 71], [1147, 220], [1148, 252], [1151, 182], [1155, 37], [1158, 104], [1160, 219], [1164, 75], [1166, 34], [1166, 80], [1169, 139], [1169, 140], [1177, 148], [1177, 154], [1177, 196], [1177, 229], [1177, 232], [1177, 285], [1177, 309], [1177, 315], [1177, 322], [1177, 350], [1177, 351], [1190, 117], [1192, 55], [1194, 233], [1195, 233], [1196, 233], [1197, 129], [1197, 130], [1197, 131], [1197, 132], [1198, 129], [1198, 130], [1198, 131], [1198, 196], [1198, 203], [1198, 341], [1199, 129], [1199, 130], [1199, 131], [1200, 129], [1200, 130], [1200, 131], [1200, 192], [1201, 129], [1201, 130], [1201, 131], [1201, 205], [1202, 129], [1202, 130], [1202, 131], [1203, 129], [1203, 130], [1203, 131], [1204, 129], [1204, 130], [1204, 131], [1210, 18], [1210, 83], [1211, 50], [1211, 208], [1211, 212], [1211, 237], [1214, 122], [1214, 188], [1214, 199], [1214, 203], [1215, 141], [1216, 18], [1216, 83], [1218, 148], [1226, 166], [1226, 168], [1226, 268], [1226, 274], [1226, 302], [1226, 331], [1226, 332], [1226, 333], [1229, 148], [1230, 150], [1232, 148], [1234, 148], [1234, 301], [1235, 305], [1236, 122], [1236, 124], [1236, 126], [1236, 154], [1236, 156], [1236, 211], [1236, 222], [1236, 309], [1236, 310], [1236, 323], [1236, 334], [1237, 210], [1237, 214], [1238, 210], [1238, 215], [1238, 217], [1238, 269], [1238, 275], [1238, 276], [1238, 279], [1239, 210], [1239, 215], [1239, 217], [1239, 269], [1239, 275], [1239, 276], [1239, 279], [1240, 144], [1244, 124], [1244, 309], [1244, 319], [1247, 122], [1247, 124], [1247, 125], [1247, 128], [1247, 131], [1247, 176], [1247, 184], [1247, 204], [1247, 209], [1247, 211], [1247, 248], [1247, 260], [1247, 318], [1247, 350], [1248, 122], [1248, 124], [1248, 125], [1248, 128], [1248, 131], [1248, 176], [1248, 180], [1248, 184], [1248, 204], [1248, 209], [1248, 211], [1248, 248], [1248, 260], [1248, 318], [1248, 350], [1252, 150], [1252, 202], [1256, 305], [1259, 100], [1261, 138], [1261, 207], [1262, 100], [1263, 165], [1265, 9], [1265, 24], [1265, 29], [1265, 62], [1265, 63], [1265, 65], [1265, 77], [1265, 263], [1266, 9], [1266, 24], [1266, 29], [1266, 62], [1266, 63], [1266, 65], [1266, 77], [1266, 263], [1268, 153], [1269, 304], [1270, 174], [1270, 175], [1274, 152], [1275, 169], [1276, 129], [1276, 193], [1277, 104], [1277, 271], [1277, 272], [1277, 302], [1277, 303], [1277, 311], [1279, 152], [1282, 150], [1282, 227], [1282, 239], [1282, 241], [1282, 248], [1282, 264], [1282, 267], [1282, 293], [1282, 297], [1282, 350], [1285, 140], [1285, 228], [1287, 219], [1288, 129], [1288, 130], [1288, 150], [1288, 154], [1288, 193], [1288, 194], [1288, 197], [1288, 198], [1288, 299], [1288, 303], [1288, 309], [1289, 129], [1289, 130], [1289, 150], [1289, 154], [1289, 193], [1289, 197], [1289, 198], [1289, 299], [1289, 303], [1289, 309], [1289, 310], [1290, 150], [1291, 126], [1292, 126], [1292, 260], [1293, 129], [1293, 130], [1293, 150], [1293, 154], [1293, 193], [1293, 197], [1293, 198], [1293, 299], [1293, 303], [1293, 309], [1293, 339], [1293, 344], [1295, 149], [1296, 210], [1296, 212], [1296, 213], [1296, 278], [1297, 210], [1297, 212], [1297, 213], [1297, 278], [1312, 182], [1313, 142], [1313, 150], [1313, 203], [1313, 246], [1315, 132], [1316, 109], [1316, 150], [1316, 161], [1317, 150], [1317, 161], [1318, 136], [1318, 141], [1318, 148], [1318, 156], [1318, 157], [1318, 159], [1318, 161], [1318, 211], [1318, 246], [1318, 247], [1318, 269], [1318, 270], [1318, 271], [1318, 273], [1318, 274], [1318, 283], [1318, 284], [1318, 285], [1318, 296], [1318, 297], [1318, 298], [1318, 299], [1318, 300], [1318, 301], [1318, 302], [1318, 303], [1318, 304], [1318, 305], [1318, 306], [1318, 307], [1318, 309], [1318, 310], [1318, 311], [1318, 317], [1318, 319], [1318, 320], [1318, 321], [1318, 323], [1318, 324], [1318, 325], [1318, 327], [1318, 329], [1318, 330], [1318, 331], [1318, 332], [1318, 333], [1318, 350], [1319, 123], [1319, 124], [1319, 127], [1319, 128], [1319, 131], [1319, 147], [1319, 154], [1319, 156], [1319, 171], [1319, 176], [1319, 211], [1319, 224], [1319, 233], [1319, 268], [1319, 270], [1319, 273], [1319, 274], [1319, 293], [1319, 296], [1319, 297], [1319, 298], [1319, 299], [1319, 302], [1319, 305], [1319, 307], [1319, 309], [1319, 311], [1319, 315], [1319, 316], [1319, 317], [1319, 318], [1319, 319], [1319, 320], [1319, 322], [1319, 325], [1319, 327], [1319, 328], [1319, 330], [1319, 332], [1319, 350], [1320, 32], [1320, 82], [1321, 21], [1327, 102], [1328, 272], [1329, 261], [1330, 102], [1337, 310], [1341, 14], [1341, 151], [1341, 153], [1341, 210], [1341, 257], [1341, 281], [1341, 282], [1341, 302], [1341, 341], [1342, 14], [1342, 151], [1342, 153], [1342, 210], [1342, 257], [1342, 281], [1342, 282], [1342, 302], [1342, 341], [1343, 207], [1344, 51], [1344, 150], [1347, 305], [1349, 305], [1350, 305], [1352, 138], [1355, 13], [1362, 138], [1362, 220], [1366, 99], [1366, 308], [1367, 309], [1367, 323], [1370, 99], [1370, 308], [1371, 170], [1374, 283], [1376, 166], [1377, 122], [1377, 126], [1377, 127], [1377, 140], [1377, 162], [1377, 166], [1377, 170], [1377, 171], [1377, 173], [1377, 192], [1377, 195], [1377, 197], [1377, 198], [1377, 199], [1377, 200], [1377, 209], [1377, 213], [1377, 217], [1377, 235], [1377, 236], [1377, 238], [1377, 268], [1377, 270], [1377, 273], [1377, 274], [1377, 276], [1377, 296], [1377, 300], [1377, 303], [1377, 304], [1377, 307], [1377, 336], [1377, 350], [1378, 122], [1378, 126], [1378, 127], [1378, 140], [1378, 162], [1378, 166], [1378, 170], [1378, 171], [1378, 173], [1378, 192], [1378, 195], [1378, 197], [1378, 198], [1378, 199], [1378, 200], [1378, 209], [1378, 213], [1378, 217], [1378, 235], [1378, 236], [1378, 238], [1378, 268], [1378, 270], [1378, 273], [1378, 274], [1378, 276], [1378, 296], [1378, 300], [1378, 303], [1378, 304], [1378, 307], [1378, 336], [1378, 350], [1379, 122], [1379, 126], [1379, 127], [1379, 140], [1379, 162], [1379, 166], [1379, 170], [1379, 171], [1379, 173], [1379, 192], [1379, 195], [1379, 197], [1379, 198], [1379, 199], [1379, 200], [1379, 209], [1379, 213], [1379, 217], [1379, 235], [1379, 236], [1379, 238], [1379, 268], [1379, 270], [1379, 273], [1379, 274], [1379, 276], [1379, 296], [1379, 300], [1379, 303], [1379, 304], [1379, 307], [1379, 336], [1379, 350], [1382, 129], [1382, 182], [1382, 193], [1382, 203], [1395, 59], [1396, 59], [1397, 40], [1398, 48], [1401, 48], [1401, 59], [1402, 40], [1402, 59], [1404, 99], [1404, 308], [1407, 127], [1407, 138], [1408, 127], [1408, 138], [1409, 127], [1409, 138], [1416, 149], [1416, 156], [1419, 170], [1420, 33], [1420, 53], [1420, 335], [1423, 166], [1424, 166], [1425, 151], [1425, 178], [1425, 185], [1425, 194], [1425, 197], [1425, 198], [1425, 205], [1425, 251], [1425, 289], [1425, 293], [1425, 296], [1425, 301], [1425, 303], [1425, 305], [1425, 306], [1425, 337], [1425, 338], [1425, 339], [1425, 340], [1425, 341], [1425, 342], [1425, 343], [1425, 349], [1427, 151], [1427, 178], [1427, 185], [1427, 194], [1427, 197], [1427, 198], [1427, 205], [1427, 251], [1427, 289], [1427, 293], [1427, 296], [1427, 301], [1427, 303], [1427, 305], [1427, 306], [1427, 337], [1427, 338], [1427, 339], [1427, 340], [1427, 341], [1427, 342], [1427, 343], [1427, 349], [1441, 170], [1441, 178], [1442, 178], [1446, 210], [1453, 132], [1453, 137], [1453, 154], [1453, 173], [1453, 184], [1453, 186], [1453, 192], [1453, 195], [1453, 200], [1453, 201], [1453, 202], [1453, 296], [1453, 304], [1453, 305], [1453, 306], [1453, 308], [1453, 311], [1454, 221], [1456, 262], [1459, 168], [1459, 313], [1460, 129], [1460, 193], [1470, 306], [1471, 169], [1473, 125], [1473, 127], [1473, 128], [1473, 131], [1473, 136], [1473, 164], [1473, 170], [1473, 172], [1473, 181], [1473, 184], [1473, 204], [1473, 207], [1473, 212], [1473, 213], [1473, 214], [1473, 215], [1473, 216], [1473, 217], [1473, 218], [1473, 228], [1473, 230], [1473, 235], [1473, 237], [1473, 238], [1473, 240], [1473, 248], [1473, 259], [1473, 269], [1473, 275], [1473, 277], [1473, 279], [1473, 286], [1473, 290], [1473, 293], [1473, 300], [1473, 307], [1473, 309], [1473, 315], [1477, 122], [1477, 124], [1477, 125], [1477, 133], [1477, 154], [1477, 304], [1478, 122], [1478, 124], [1478, 125], [1478, 133], [1478, 154], [1478, 341], [1480, 206], [1480, 207], [1483, 128], [1483, 138], [1483, 235], [1488, 219], [1494, 77], [1496, 131], [1496, 161], [1496, 173], [1496, 188], [1496, 189], [1496, 192], [1496, 193], [1496, 197], [1496, 198], [1496, 231], [1496, 233], [1496, 247], [1496, 289], [1496, 293], [1496, 296], [1496, 297], [1496, 298], [1496, 299], [1496, 301], [1496, 302], [1496, 304], [1496, 305], [1496, 306], [1496, 308], [1496, 309], [1496, 319], [1496, 336], [1496, 339], [1498, 98], [1499, 178], [1500, 14], [1500, 149], [1500, 151], [1500, 210], [1500, 257], [1500, 281], [1500, 282], [1500, 296], [1500, 302], [1500, 341], [1502, 14], [1502, 149], [1502, 151], [1502, 210], [1502, 257], [1502, 281], [1502, 282], [1502, 296], [1502, 302], [1502, 341], [1503, 14], [1503, 149], [1503, 151], [1503, 210], [1503, 257], [1503, 281], [1503, 282], [1503, 296], [1503, 302], [1503, 341], [1505, 221], [1506, 221], [1507, 221], [1516, 119], [1516, 132], [1516, 134], [1516, 139], [1516, 141], [1516, 156], [1516, 162], [1516, 284], [1516, 302], [1516, 303], [1516, 307], [1516, 310], [1516, 314], [1521, 58], [1522, 58], [1522, 136], [1522, 149], [1522, 161], [1523, 29], [1525, 58], [1525, 136], [1526, 119], [1526, 121], [1527, 16], [1527, 248], [1527, 277], [1528, 153], [1530, 269], [1530, 274], [1541, 102], [1544, 106], [1545, 129], [1545, 130], [1545, 133], [1545, 154], [1545, 193], [1545, 194], [1545, 198], [1545, 246], [1545, 300], [1545, 308], [1545, 309], [1546, 122], [1546, 124], [1546, 125], [1546, 129], [1546, 130], [1546, 154], [1546, 173], [1546, 194], [1546, 203], [1546, 268], [1546, 274], [1546, 341], [1547, 0], [1547, 102], [1547, 133], [1548, 138], [1549, 0], [1549, 102], [1549, 133], [1550, 0], [1550, 102], [1550, 133], [1552, 122], [1553, 122], [1554, 122], [1556, 102], [1560, 174], [1560, 180], [1560, 302], [1561, 11], [1561, 115], [1561, 152], [1562, 9], [1562, 31], [1562, 57], [1562, 64], [1562, 84], [1562, 115], [1562, 128], [1562, 152], [1562, 250], [1564, 183], [1569, 128], [1573, 212], [1573, 239], [1574, 123], [1574, 131], [1574, 154], [1574, 170], [1574, 171], [1574, 176], [1574, 204], [1574, 223], [1574, 280], [1574, 284], [1574, 288], [1574, 294], [1574, 300], [1574, 302], [1574, 307], [1574, 309], [1574, 310], [1574, 313], [1574, 316], [1574, 329], [1574, 350], [1574, 351], [1578, 134], [1578, 147], [1578, 153], [1578, 154], [1578, 155], [1578, 157], [1578, 158], [1578, 172], [1578, 180], [1578, 206], [1578, 208], [1578, 224], [1578, 234], [1578, 235], [1578, 236], [1578, 245], [1578, 246], [1578, 250], [1578, 345], [1578, 351], [1579, 134], [1579, 147], [1579, 153], [1579, 154], [1579, 155], [1579, 157], [1579, 158], [1579, 172], [1579, 180], [1579, 206], [1579, 208], [1579, 224], [1579, 234], [1579, 235], [1579, 236], [1579, 245], [1579, 246], [1579, 250], [1579, 345], [1579, 351], [1581, 212], [1581, 239], [1583, 154], [1583, 156], [1583, 193], [1583, 314], [1584, 115], [1584, 179], [1584, 224], [1585, 107], [1588, 25], [1588, 36], [1590, 129], [1590, 130], [1590, 339], [1592, 145], [1592, 147], [1592, 189], [1592, 284], [1593, 147], [1596, 211], [1596, 255], [1599, 66], [1600, 44], [1601, 44], [1618, 128], [1619, 115], [1619, 172], [1619, 208], [1619, 271], [1621, 291], [1621, 292], [1625, 65], [1626, 106], [1630, 305], [1631, 305], [1632, 305], [1634, 151], [1634, 178], [1634, 185], [1634, 194], [1634, 197], [1634, 198], [1634, 205], [1634, 251], [1634, 289], [1634, 293], [1634, 296], [1634, 301], [1634, 303], [1634, 305], [1634, 306], [1634, 337], [1634, 338], [1634, 339], [1634, 340], [1634, 341], [1634, 342], [1634, 343], [1634, 349], [1637, 305], [1638, 305], [1639, 305], [1640, 305], [1641, 305], [1642, 305], [1647, 195], [1648, 142], [1648, 148], [1648, 269], [1648, 274], [1651, 197], [1651, 198], [1651, 339], [1652, 60], [1659, 77], [1662, 258], [1663, 126], [1667, 125], [1667, 150], [1667, 170], [1667, 174], [1667, 180], [1667, 302], [1669, 128], [1672, 125], [1672, 150], [1672, 170], [1672, 174], [1672, 180], [1672, 302], [1674, 53], [1674, 54], [1674, 55], [1674, 56], [1674, 57], [1674, 124], [1674, 165], [1674, 202], [1674, 222], [1675, 54], [1676, 53], [1676, 54], [1676, 55], [1676, 56], [1676, 57], [1676, 124], [1676, 165], [1676, 260], [1676, 263], [1677, 53], [1677, 54], [1677, 55], [1677, 56], [1677, 57], [1677, 124], [1677, 165], [1677, 260], [1677, 263], [1683, 152], [1685, 219], [1686, 219], [1687, 138], [1687, 186], [1688, 138], [1688, 186], [1689, 219], [1707, 126], [1707, 138], [1717, 180], [1723, 122], [1723, 156], [1723, 269], [1723, 270], [1723, 274], [1723, 305], [1724, 16], [1724, 18], [1724, 70], [1725, 122], [1725, 124], [1725, 125], [1725, 126], [1725, 154], [1725, 170], [1725, 176], [1725, 179], [1725, 280], [1725, 282], [1725, 292], [1725, 309], [1725, 310], [1725, 313], [1725, 314], [1725, 316], [1725, 318], [1725, 325], [1725, 330], [1725, 332], [1725, 333], [1725, 334], [1726, 16], [1726, 18], [1726, 70], [1728, 16], [1728, 18], [1728, 70], [1729, 138], [1729, 151], [1729, 183], [1729, 186], [1729, 250], [1729, 284], [1729, 286], [1729, 287], [1729, 289], [1729, 290], [1729, 296], [1729, 304], [1729, 305], [1729, 308], [1729, 311], [1729, 340], [1739, 109], [1740, 109], [1745, 170], [1746, 170], [1747, 138], [1749, 170], [1752, 109], [1754, 305], [1756, 108], [1758, 174], [1758, 175], [1761, 174], [1761, 175], [1764, 106], [1765, 125], [1765, 126], [1765, 127], [1765, 131], [1765, 136], [1765, 164], [1765, 165], [1765, 172], [1765, 181], [1765, 184], [1765, 207], [1765, 209], [1765, 212], [1765, 213], [1765, 214], [1765, 215], [1765, 217], [1765, 218], [1765, 222], [1765, 225], [1765, 226], [1765, 230], [1765, 232], [1765, 235], [1765, 236], [1765, 238], [1765, 239], [1765, 241], [1765, 243], [1765, 248], [1765, 254], [1765, 258], [1765, 259], [1765, 260], [1765, 268], [1765, 271], [1765, 272], [1765, 274], [1765, 288], [1765, 290], [1765, 291], [1765, 294], [1765, 300], [1765, 307], [1765, 309], [1766, 125], [1766, 126], [1766, 128], [1766, 137], [1766, 164], [1766, 165], [1766, 181], [1766, 184], [1766, 207], [1766, 208], [1766, 213], [1766, 215], [1766, 217], [1766, 218], [1766, 222], [1766, 225], [1766, 226], [1766, 227], [1766, 230], [1766, 232], [1766, 235], [1766, 236], [1766, 237], [1766, 238], [1766, 239], [1766, 240], [1766, 241], [1766, 248], [1766, 254], [1766, 255], [1766, 258], [1766, 259], [1766, 260], [1766, 264], [1766, 269], [1766, 275], [1766, 276], [1766, 277], [1766, 279], [1766, 281], [1766, 290], [1766, 294], [1766, 300], [1766, 302], [1766, 309], [1766, 315], [1766, 347], [1767, 233], [1770, 218], [1772, 126], [1772, 217], [1772, 219], [1772, 269], [1772, 290], [1772, 294], [1777, 208], [1777, 332], [1778, 208], [1778, 332], [1781, 99], [1781, 308], [1796, 150], [1798, 285], [1805, 220], [1806, 220], [1807, 70], [1808, 70], [1809, 70], [1810, 55], [1810, 215], [1811, 305], [1812, 220], [1813, 220], [1815, 71], [1819, 64], [1820, 0], [1820, 62], [1820, 63], [1820, 64], [1821, 0], [1821, 62], [1821, 63], [1821, 64], [1823, 285], [1824, 285], [1826, 109], [1826, 150], [1826, 161], [1827, 109], [1827, 150], [1827, 161], [1834, 178], [1838, 153], [1838, 166], [1838, 174], [1838, 182], [1838, 230], [1838, 248], [1838, 268], [1838, 274], [1838, 302], [1838, 309], [1838, 313], [1838, 314], [1838, 324], [1838, 331], [1838, 332], [1838, 333], [1839, 153], [1839, 166], [1839, 174], [1839, 182], [1839, 230], [1839, 248], [1839, 268], [1839, 274], [1839, 302], [1839, 309], [1839, 313], [1839, 324], [1839, 331], [1839, 332], [1839, 333], [1840, 153], [1840, 166], [1840, 174], [1840, 182], [1840, 230], [1840, 248], [1840, 268], [1840, 274], [1840, 302], [1840, 309], [1840, 313], [1840, 315], [1840, 324], [1840, 331], [1840, 332], [1840, 333], [1842, 63], [1842, 152], [1843, 153], [1843, 166], [1843, 174], [1843, 182], [1843, 230], [1843, 248], [1843, 268], [1843, 274], [1843, 302], [1843, 309], [1843, 313], [1843, 324], [1843, 331], [1843, 332], [1843, 333], [1845, 153], [1845, 166], [1845, 170], [1845, 174], [1845, 182], [1845, 230], [1845, 233], [1845, 248], [1845, 268], [1845, 274], [1845, 302], [1845, 309], [1845, 313], [1845, 324], [1845, 331], [1845, 332], [1845, 333], [1848, 52], [1852, 119], [1852, 121], [1854, 314], [1861, 99], [1862, 140], [1862, 228], [1863, 140], [1863, 228], [1864, 109], [1864, 167], [1864, 233], [1864, 303], [1864, 311], [1865, 122], [1865, 124], [1865, 125], [1865, 127], [1865, 133], [1865, 134], [1865, 137], [1865, 153], [1865, 154], [1865, 155], [1865, 157], [1865, 158], [1865, 179], [1865, 224], [1865, 227], [1865, 237], [1865, 244], [1865, 245], [1865, 246], [1865, 253], [1865, 268], [1865, 348], [1866, 309], [1866, 310], [1866, 328], [1867, 305], [1870, 272], [1870, 274], [1872, 305], [1876, 229], [1889, 305], [1890, 37], [1892, 219], [1893, 3], [1894, 105], [1894, 116], [1894, 117], [1894, 118], [1894, 139], [1894, 180], [1894, 298], [1895, 335], [1896, 335], [1897, 335], [1898, 335], [1899, 335], [1902, 101], [1903, 101], [1907, 39], [1908, 125], [1908, 141], [1908, 151], [1908, 154], [1908, 169], [1908, 176], [1908, 177], [1908, 292], [1908, 302], [1908, 313], [1908, 314], [1908, 326], [1911, 187], [1911, 254], [1912, 105], [1912, 117], [1912, 118], [1912, 119], [1912, 121], [1916, 105], [1916, 117], [1916, 118], [1916, 119], [1916, 121], [1917, 102], [1918, 14], [1918, 208], [1918, 212], [1918, 246], [1918, 268], [1918, 269], [1918, 270], [1918, 271], [1918, 273], [1918, 274], [1918, 316], [1918, 348], [1922, 14], [1922, 208], [1922, 212], [1922, 246], [1922, 268], [1922, 269], [1922, 270], [1922, 271], [1922, 273], [1922, 274], [1922, 316], [1922, 348], [1923, 14], [1923, 208], [1923, 212], [1923, 246], [1923, 268], [1923, 269], [1923, 270], [1923, 271], [1923, 273], [1923, 274], [1923, 316], [1923, 348], [1924, 14], [1924, 208], [1924, 212], [1924, 246], [1924, 268], [1924, 269], [1924, 270], [1924, 271], [1924, 273], [1924, 274], [1924, 316], [1924, 348], [1925, 183], [1925, 286], [1925, 308], [1925, 340], [1926, 151], [1926, 183], [1926, 286], [1926, 308], [1926, 340], [1927, 12], [1928, 12], [1929, 12], [1930, 12], [1938, 291], [1938, 292], [1940, 100], [1940, 106], [1942, 159], [1946, 168], [1946, 170], [1947, 68], [1955, 8], [1955, 149], [1956, 8], [1956, 149], [1957, 51], [1957, 135], [1958, 51], [1958, 135], [1961, 141], [1961, 156], [1972, 220], [1972, 253], [1977, 156], [1977, 195], [1977, 251], [1977, 338], [1977, 342], [1977, 343], [1977, 349], [1982, 106], [1983, 149], [1983, 307], [1988, 142], [1988, 307], [1990, 148], [1992, 137], [1992, 138], [1992, 255], [1997, 149], [1997, 150], [1997, 210], [1997, 254], [1997, 271], [1997, 280], [1999, 149], [1999, 150], [1999, 210], [1999, 254], [1999, 271], [1999, 280], [2000, 149], [2000, 150], [2000, 210], [2000, 254], [2000, 271], [2000, 280], [2002, 147], [2002, 153], [2002, 284], [2004, 148], [2008, 7], [2008, 9], [2008, 115], [2008, 152], [2008, 160], [2008, 208], [2008, 234], [2010, 76], [2010, 266], [2013, 147], [2013, 153], [2013, 284], [2014, 305], [2016, 305], [2029, 219], [2032, 108], [2036, 32], [2036, 36], [2036, 55], [2038, 310], [2042, 150], [2042, 180], [2042, 202], [2042, 223], [2042, 280], [2042, 283], [2042, 284], [2042, 285], [2042, 288], [2043, 150], [2043, 180], [2043, 202], [2043, 223], [2043, 280], [2043, 283], [2043, 284], [2043, 285], [2043, 288], [2052, 12], [2053, 138], [2053, 226], [2058, 125], [2058, 138], [2058, 208], [2058, 212], [2061, 138], [2062, 98], [2065, 177], [2065, 184], [2065, 186], [2065, 194], [2067, 177], [2067, 184], [2067, 194], [2070, 25], [2073, 178], [2073, 199], [2073, 205], [2073, 344], [2074, 252], [2074, 310], [2075, 346], [2077, 265], [2085, 46], [2085, 149], [2086, 219], [2087, 160], [2087, 266], [2090, 76], [2092, 5], [2092, 39], [2092, 46], [2092, 58], [2092, 61], [2092, 149], [2094, 101], [2095, 138], [2095, 226], [2095, 243], [2098, 138], [2098, 226], [2098, 243], [2102, 42], [2105, 268], [2105, 282], [2109, 167], [2109, 268], [2109, 282], [2109, 308], [2113, 150], [2118, 178], [2118, 179], [2118, 224], [2118, 245], [2119, 62], [2127, 153], [2127, 166], [2127, 174], [2127, 182], [2127, 230], [2127, 248], [2127, 268], [2127, 274], [2127, 302], [2127, 309], [2127, 313], [2127, 324], [2127, 331], [2127, 332], [2127, 333], [2128, 153], [2128, 166], [2128, 174], [2128, 182], [2128, 230], [2128, 248], [2128, 268], [2128, 274], 