{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 55833], "name": "inputs", "sparse": false}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Diagonal", "config": {"name": "h0", "dtype": "float32", "activation": "tanh", "trainable": true, "units": 18611, "batch_input_shape": [null, 55833], "use_bias": true}, "inbound_nodes": [[["inputs", 0, 0, {}]]], "name": "h0"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_0"}, "inbound_nodes": [[["h0", 0, 0, {"training": false}]]], "name": "dropout_0"}, {"class_name": "SparseTF", "config": {"W_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "h1", "bias_regularizer": null, "activation": "tanh", "trainable": true, "nonzero_ind": [[0, 142], [1, 142], [4, 2], [4, 3], [5, 150], [7, 15], [7, 351], [8, 305], [9, 305], [10, 74], [12, 178], [14, 98], [16, 146], [16, 169], [16, 241], [16, 248], [16, 271], [16, 272], [16, 300], [16, 309], [16, 310], [16, 331], [16, 335], [16, 348], [26, 272], [33, 154], [33, 176], [33, 177], [33, 178], [33, 223], [33, 302], [33, 345], [33, 346], [33, 347], [34, 154], [34, 176], [34, 177], [34, 178], [34, 223], [34, 302], [34, 345], [34, 346], [34, 347], [35, 58], [36, 126], [36, 127], [36, 128], [36, 163], [36, 164], [36, 233], [36, 260], [36, 268], [36, 272], [36, 274], [36, 345], [36, 346], [36, 347], [36, 348], [37, 126], [37, 127], [37, 128], [37, 163], [37, 164], [37, 233], [37, 260], [37, 268], [37, 272], [37, 274], [37, 345], [37, 346], [37, 347], [37, 348], [38, 126], [38, 127], [38, 128], [38, 163], [38, 164], [38, 233], [38, 260], [38, 268], [38, 272], [38, 274], [38, 345], [38, 346], [38, 347], [38, 348], [39, 154], [39, 176], [39, 177], [39, 194], [39, 223], [39, 302], [39, 345], [39, 346], [39, 347], [40, 151], [40, 154], [40, 176], [40, 177], [40, 184], [40, 194], [40, 223], [40, 302], [40, 309], [40, 313], [40, 329], [40, 345], [40, 346], [40, 347], [41, 154], [41, 176], [41, 177], [41, 194], [41, 223], [41, 302], [41, 309], [41, 329], [41, 345], [41, 346], [41, 347], [42, 154], [42, 176], [42, 177], [42, 178], [42, 194], [42, 204], [42, 205], [42, 223], [42, 288], [42, 289], [42, 302], [42, 345], [42, 346], [42, 347], [43, 113], [43, 151], [43, 154], [43, 176], [43, 177], [43, 194], [43, 223], [43, 280], [43, 284], [43, 286], [43, 288], [43, 302], [43, 305], [43, 313], [43, 314], [43, 345], [43, 346], [43, 347], [44, 154], [44, 176], [44, 177], [44, 178], [44, 194], [44, 223], [44, 293], [44, 302], [44, 309], [44, 329], [44, 345], [44, 346], [44, 347], [45, 154], [45, 176], [45, 177], [45, 223], [45, 302], [45, 345], [45, 346], [45, 347], [46, 126], [46, 138], [60, 138], [61, 169], [63, 41], [64, 41], [66, 48], [67, 47], [68, 48], [70, 48], [71, 47], [72, 48], [73, 183], [73, 223], [73, 296], [74, 132], [74, 156], [74, 310], [74, 328], [75, 151], [75, 154], [75, 176], [75, 177], [75, 178], [75, 223], [75, 233], [75, 300], [75, 302], [75, 309], [75, 313], [75, 329], [75, 345], [75, 346], [75, 347], [75, 351], [76, 126], [76, 235], [76, 239], [76, 321], [77, 125], [77, 178], [77, 186], [77, 195], [77, 204], [77, 223], [77, 292], [77, 303], [77, 306], [77, 341], [77, 349], [78, 125], [78, 151], [78, 178], [78, 183], [78, 186], [78, 194], [78, 204], [78, 223], [78, 286], [78, 287], [78, 289], [78, 294], [78, 296], [78, 310], [78, 328], [79, 223], [82, 126], [82, 128], [82, 157], [82, 172], [82, 173], [82, 209], [82, 211], [82, 214], [82, 235], [82, 239], [82, 276], [82, 279], [82, 321], [83, 113], [83, 149], [83, 150], [84, 262], [85, 262], [86, 262], [87, 262], [94, 65], [94, 152], [98, 24], [98, 152], [101, 127], [101, 128], [101, 163], [101, 164], [101, 225], [101, 232], [101, 233], [101, 239], [101, 253], [101, 254], [101, 256], [101, 258], [101, 259], [101, 260], [101, 261], [101, 262], [101, 264], [101, 266], [102, 127], [102, 128], [102, 163], [102, 164], [102, 225], [102, 232], [102, 233], [102, 239], [102, 253], [102, 254], [102, 256], [102, 258], [102, 259], [102, 260], [102, 261], [102, 262], [102, 264], [102, 266], [103, 127], [103, 128], [103, 163], [103, 164], [103, 225], [103, 232], [103, 233], [103, 239], [103, 253], [103, 254], [103, 256], [103, 258], [103, 259], [103, 260], [103, 261], [103, 262], [103, 264], [103, 266], [104, 127], [104, 128], [104, 163], [104, 164], [104, 225], [104, 232], [104, 233], [104, 239], [104, 253], [104, 254], [104, 256], [104, 258], [104, 259], [104, 260], [104, 261], [104, 262], [104, 264], [104, 266], [106, 58], [106, 126], [106, 136], [106, 137], [106, 171], [106, 172], [106, 202], [106, 296], [107, 58], [107, 126], [107, 136], [107, 137], [107, 171], [107, 172], [107, 202], [107, 296], [108, 0], [109, 140], [109, 228], [110, 140], [110, 228], [111, 140], [111, 228], [112, 140], [112, 228], [115, 31], [115, 64], [115, 65], [115, 216], [116, 128], [121, 182], [122, 117], [123, 138], [123, 243], [124, 145], [124, 147], [125, 145], [125, 147], [126, 145], [126, 147], [127, 145], [127, 147], [131, 183], [132, 15], [133, 183], [133, 308], [134, 183], [134, 308], [135, 305], [136, 100], [146, 127], [146, 128], [146, 154], [146, 155], [146, 157], [146, 164], [146, 173], [146, 185], [146, 203], [146, 206], [146, 207], [146, 208], [146, 214], [146, 217], [146, 225], [146, 230], [146, 232], [146, 236], [146, 238], [146, 239], [146, 240], [146, 241], [146, 245], [146, 248], [146, 255], [146, 271], [146, 273], [146, 275], [146, 276], [146, 279], [146, 296], [146, 298], [146, 300], [146, 302], [146, 303], [146, 304], [146, 311], [146, 315], [146, 322], [147, 305], [150, 178], [151, 178], [152, 178], [156, 170], [157, 170], [159, 219], [161, 305], [162, 305], [168, 21], [173, 224], [174, 224], [176, 134], [176, 136], [176, 138], [177, 310], [179, 121], [182, 33], [182, 53], [182, 54], [184, 178], [185, 219], [187, 100], [187, 270], [190, 232], [191, 232], [193, 142], [193, 284], [194, 121], [195, 151], [195, 178], [195, 185], [195, 194], [195, 197], [195, 198], [195, 205], [195, 251], [195, 289], [195, 293], [195, 296], [195, 301], [195, 303], [195, 305], [195, 306], [195, 337], [195, 338], [195, 339], [195, 340], [195, 341], [195, 342], [195, 343], [195, 349], [198, 147], [202, 206], [203, 206], [204, 126], [204, 128], [204, 138], [204, 181], [204, 217], [204, 269], [204, 275], [204, 276], [204, 277], [204, 279], [207, 124], [207, 132], [207, 195], [207, 197], [207, 198], [207, 199], [207, 288], [207, 336], [207, 344], [211, 122], [211, 124], [211, 125], [211, 128], [211, 131], [211, 136], [211, 166], [211, 170], [211, 171], [211, 176], [211, 179], [211, 186], [211, 195], [211, 200], [211, 201], [211, 202], [211, 204], [211, 223], [211, 273], [211, 288], [211, 300], [211, 307], [211, 309], [211, 317], [211, 319], [211, 335], [211, 348], [211, 349], [211, 351], [212, 122], [212, 124], [212, 125], [212, 128], [212, 131], [212, 136], [212, 166], [212, 170], [212, 171], [212, 176], [212, 179], [212, 195], [212, 200], [212, 201], [212, 223], [212, 288], [212, 300], [212, 307], [212, 309], [212, 317], [212, 319], [212, 335], [212, 349], [212, 351], [213, 122], [213, 124], [213, 125], [213, 128], [213, 131], [213, 136], [213, 151], [213, 154], [213, 166], [213, 170], [213, 171], [213, 173], [213, 176], [213, 179], [213, 180], [213, 186], [213, 188], [213, 195], [213, 200], [213, 201], [213, 202], [213, 204], [213, 211], [213, 223], [213, 246], [213, 247], [213, 260], [213, 270], [213, 273], [213, 274], [213, 280], [213, 282], [213, 283], [213, 284], [213, 285], [213, 288], [213, 300], [213, 304], [213, 306], [213, 307], [213, 309], [213, 311], [213, 313], [213, 316], [213, 317], [213, 318], [213, 319], [213, 335], [213, 348], [213, 349], [213, 350], [213, 351], [214, 176], [214, 179], [214, 204], [214, 223], [214, 280], [214, 284], [214, 294], [215, 210], [216, 210], [217, 210], [218, 210], [222, 310], [223, 241], [223, 248], [223, 310], [224, 142], [224, 344], [225, 302], [228, 302], [232, 168], [232, 309], [232, 324], [233, 128], [233, 168], [233, 170], [233, 309], [233, 313], [233, 324], [236, 162], [237, 162], [242, 47], [242, 49], [243, 43], [244, 43], [246, 124], [246, 125], [246, 126], [246, 127], [246, 128], [246, 135], [246, 140], [246, 162], [246, 164], [246, 165], [246, 172], [246, 192], [246, 207], [246, 209], [246, 211], [246, 217], [246, 219], [246, 221], [246, 222], [246, 224], [246, 226], [246, 230], [246, 235], [246, 236], [246, 238], [246, 239], [246, 258], [246, 259], [246, 268], [246, 269], [246, 274], [246, 276], [246, 279], [246, 286], [246, 296], [246, 300], [246, 304], [246, 307], [246, 309], [246, 321], [246, 350], [246, 351], [247, 124], [247, 125], [247, 126], [247, 127], [247, 128], [247, 135], [247, 140], [247, 162], [247, 164], [247, 165], [247, 172], [247, 192], [247, 207], [247, 209], [247, 211], [247, 217], [247, 219], [247, 221], [247, 222], [247, 224], [247, 226], [247, 230], [247, 235], [247, 236], [247, 238], [247, 239], [247, 258], [247, 259], [247, 268], [247, 269], [247, 274], [247, 276], [247, 279], [247, 286], [247, 296], [247, 300], [247, 304], [247, 307], [247, 309], [247, 321], [247, 350], [247, 351], [248, 150], [249, 124], [249, 125], [249, 126], [249, 127], [249, 128], [249, 135], [249, 140], [249, 162], [249, 164], [249, 165], [249, 172], [249, 192], [249, 207], [249, 209], [249, 211], [249, 217], [249, 219], [249, 221], [249, 222], [249, 224], [249, 226], [249, 230], [249, 235], [249, 236], [249, 238], [249, 239], [249, 258], [249, 259], [249, 268], [249, 269], [249, 274], [249, 276], [249, 279], [249, 286], [249, 296], [249, 300], [249, 304], [249, 307], [249, 309], [249, 321], [249, 350], [249, 351], [253, 186], [253, 189], [253, 191], [253, 285], [258, 213], [261, 126], [261, 138], [261, 259], [262, 10], [262, 296], [264, 186], [265, 266], [269, 186], [270, 186], [273, 148], [274, 311], [275, 148], [277, 178], [278, 156], [280, 124], [280, 137], [280, 170], [280, 192], [280, 193], [280, 195], [280, 204], [280, 211], [280, 234], [280, 245], [280, 282], [280, 283], [280, 305], [280, 313], [280, 316], [280, 318], [280, 327], [280, 336], [282, 138], [283, 138], [284, 138], [287, 99], [288, 99], [289, 99], [290, 99], [291, 99], [292, 99], [293, 99], [302, 134], [302, 139], [302, 140], [302, 141], [302, 154], [302, 162], [302, 228], [302, 248], [302, 297], [302, 298], [302, 299], [302, 302], [302, 303], [302, 306], [302, 309], [302, 311], [302, 322], [302, 329], [302, 333], [306, 151], [306, 178], [306, 185], [306, 194], [306, 197], [306, 198], [306, 205], [306, 251], [306, 289], [306, 293], [306, 296], [306, 301], [306, 303], [306, 305], [306, 306], [306, 337], [306, 338], [306, 339], [306, 340], [306, 341], [306, 342], [306, 343], [306, 349], [312, 151], [312, 296], [319, 125], [319, 137], [319, 138], [319, 154], [319, 223], [319, 283], [319, 309], [324, 137], [324, 138], [324, 154], [324, 309], [325, 147], [325, 155], [325, 157], [325, 234], [325, 235], [325, 250], [325, 279], [326, 279], [329, 125], [329, 137], [329, 154], [329, 223], [329, 283], [329, 309], [330, 283], [331, 283], [332, 283], [333, 283], [334, 283], [335, 283], [336, 283], [337, 283], [339, 125], [339, 150], [339, 170], [339, 174], [339, 180], [339, 302], [340, 150], [340, 161], [341, 99], [341, 308], [342, 150], [342, 161], [343, 109], [343, 150], [343, 161], [344, 150], [344, 161], [346, 219], [347, 219], [348, 219], [349, 18], [350, 18], [351, 219], [356, 310], [357, 310], [358, 104], [358, 127], [359, 40], [359, 42], [361, 40], [361, 42], [370, 138], [371, 138], [373, 116], [374, 138], [376, 262], [379, 202], [379, 283], [381, 229], [381, 295], [390, 53], [393, 40], [394, 40], [395, 40], [396, 59], [397, 53], [397, 54], [398, 53], [398, 54], [399, 53], [399, 160], [400, 53], [400, 54], [404, 229], [404, 295], [406, 146], [408, 67], [408, 74], [416, 133], [416, 334], [417, 348], [418, 348], [419, 10], [420, 348], [421, 187], [422, 67], [422, 74], [423, 108], [423, 148], [423, 151], [423, 281], [424, 108], [424, 148], [424, 151], [424, 281], [425, 67], [425, 74], [426, 55], [426, 132], [426, 171], [426, 192], [426, 196], [426, 203], [426, 212], [426, 215], [426, 227], [426, 235], [426, 237], [426, 268], [426, 274], [426, 289], [426, 300], [426, 302], [426, 304], [426, 309], [426, 312], [426, 314], [426, 329], [427, 55], [427, 184], [427, 215], [427, 237], [428, 314], [434, 283], [435, 310], [436, 268], [436, 269], [437, 268], [437, 269], [438, 268], [438, 269], [439, 268], [439, 269], [441, 160], [441, 268], [441, 269], [448, 134], [448, 139], [448, 166], [448, 169], [448, 172], [448, 174], [448, 179], [448, 182], [448, 198], [448, 247], [448, 298], [448, 303], [448, 309], [448, 317], [448, 319], [448, 327], [448, 332], [448, 333], [450, 122], [450, 148], [450, 156], [450, 246], [450, 268], [450, 269], [450, 270], [450, 273], [450, 274], [450, 310], [450, 350], [451, 147], [451, 153], [451, 154], [451, 314], [454, 129], [454, 169], [454, 170], [454, 174], [455, 129], [455, 169], [455, 174], [455, 227], [456, 129], [456, 169], [456, 174], [457, 129], [457, 169], [457, 174], [457, 182], [457, 233], [457, 309], [457, 324], [457, 351], [458, 129], [459, 129], [459, 169], [459, 174], [459, 309], [459, 324], [472, 124], [472, 174], [472, 175], [472, 309], [472, 314], [472, 326], [472, 330], [474, 175], [475, 124], [475, 125], [475, 162], [475, 204], [475, 309], [475, 330], [476, 175], [478, 174], [478, 175], [484, 302], [484, 311], [488, 166], [491, 149], [491, 267], [492, 149], [492, 267], [500, 252], [501, 51], [501, 135], [501, 151], [501, 223], [505, 177], [505, 345], [505, 346], [505, 347], [505, 349], [508, 79], [509, 24], [509, 208], [510, 116], [517, 83], [517, 151], [517, 186], [517, 310], [517, 328], [518, 129], [518, 193], [519, 137], [519, 138], [519, 165], [519, 255], [520, 4], [520, 44], [524, 178], [526, 208], [528, 309], [528, 329], [529, 219], [530, 219], [532, 80], [533, 136], [533, 137], [533, 184], [533, 192], [533, 195], [533, 201], [533, 296], [533, 337], [534, 102], [535, 102], [536, 102], [537, 102], [538, 13], [538, 38], [539, 13], [539, 322], [540, 13], [544, 162], [545, 162], [546, 149], [548, 149], [549, 149], [553, 285], [555, 0], [555, 9], [555, 27], [555, 62], [555, 75], [555, 81], [555, 82], [555, 250], [556, 0], [556, 9], [556, 27], [556, 62], [556, 75], [556, 81], [556, 82], [556, 250], [557, 0], [557, 9], [557, 27], [557, 62], [557, 75], [557, 81], [557, 82], [557, 250], [558, 0], [558, 9], [558, 27], [558, 62], [558, 75], [558, 81], [558, 82], [558, 250], [562, 107], [563, 107], [564, 107], [564, 268], [564, 269], [564, 270], [564, 271], [564, 272], [564, 273], [564, 274], [565, 107], [565, 268], [565, 269], [565, 270], [565, 271], [565, 272], [565, 273], [565, 274], [566, 107], [566, 268], [566, 269], [566, 270], [566, 271], [566, 272], [566, 273], [566, 274], [567, 107], [567, 268], [567, 269], [567, 270], [567, 271], [567, 272], [567, 273], [567, 274], [568, 107], [568, 268], [568, 269], [568, 270], [568, 271], [568, 272], [568, 273], [568, 274], [569, 107], [569, 268], [569, 269], [569, 270], [569, 271], [569, 272], [569, 273], [569, 274], [570, 107], [570, 268], [570, 269], [570, 270], [570, 271], [570, 272], [570, 273], [570, 274], [575, 121], [576, 121], [581, 150], [586, 62], [589, 150], [607, 314], [608, 77], [608, 152], [609, 124], [609, 125], [609, 128], [609, 138], [609, 207], [609, 209], [609, 213], [609, 217], [609, 268], [609, 270], [609, 271], [609, 272], [609, 273], [609, 274], [609, 275], [609, 276], [609, 278], [609, 279], [609, 340], [610, 126], [610, 128], [610, 138], [610, 207], [610, 209], [610, 213], [610, 268], [610, 270], [610, 272], [610, 273], [610, 274], [610, 275], [610, 276], [610, 278], [610, 279], [611, 124], [611, 125], [611, 126], [611, 128], [611, 138], [611, 207], [611, 209], [611, 213], [611, 217], [611, 268], [611, 270], [611, 272], [611, 273], [611, 274], [611, 275], [611, 276], [611, 278], [611, 279], [611, 340], [613, 126], [613, 128], [613, 138], [613, 207], [613, 209], [613, 213], [613, 268], [613, 270], [613, 272], [613, 273], [613, 274], [613, 275], [613, 276], [613, 278], [613, 279], [615, 97], [615, 151], [615, 185], [615, 300], [615, 305], [615, 306], [615, 307], [615, 344], [616, 129], [616, 130], [616, 182], [616, 193], [616, 198], [616, 304], [616, 308], [616, 309], [616, 311], [622, 265], [623, 220], [624, 220], [625, 220], [626, 220], [627, 21], [627, 71], [628, 21], [628, 71], [629, 220], [633, 106], [634, 75], [635, 34], [635, 80], [642, 148], [642, 154], [642, 196], [642, 229], [642, 232], [642, 285], [642, 309], [642, 315], [642, 322], [642, 350], [642, 351], [645, 183], [647, 233], [648, 233], [649, 233], [653, 141], [661, 210], [661, 214], [662, 210], [662, 215], [662, 217], [662, 269], [662, 275], [662, 276], [662, 279], [663, 210], [663, 215], [663, 217], [663, 269], [663, 275], [663, 276], [663, 279], [665, 124], [665, 309], [665, 319], [669, 305], [674, 100], [676, 9], [676, 24], [676, 29], [676, 62], [676, 63], [676, 65], [676, 77], [676, 263], [677, 9], [677, 24], [677, 29], [677, 62], [677, 63], [677, 65], [677, 77], [677, 263], [680, 304], [681, 174], [681, 175], [689, 219], [690, 129], [690, 130], [690, 150], [690, 154], [690, 193], [690, 194], [690, 197], [690, 198], [690, 299], [690, 303], [690, 309], [691, 129], [691, 130], [691, 150], [691, 154], [691, 193], [691, 197], [691, 198], [691, 299], [691, 303], [691, 309], [691, 310], [692, 150], [693, 126], [694, 126], [694, 260], [695, 129], [695, 130], [695, 150], [695, 154], [695, 193], [695, 197], [695, 198], [695, 299], [695, 303], [695, 309], [695, 339], [695, 344], [697, 149], [698, 210], [698, 212], [698, 213], [698, 278], [699, 210], [699, 212], [699, 213], [699, 278], [709, 142], [709, 150], [709, 203], [709, 246], [710, 109], [710, 150], [710, 161], [711, 109], [711, 150], [711, 161], [712, 150], [712, 161], [713, 21], [719, 261], [725, 310], [728, 134], [728, 139], [728, 154], [728, 162], [728, 302], [728, 311], [729, 305], [731, 305], [732, 305], [736, 13], [745, 122], [745, 126], [745, 127], [745, 140], [745, 162], [745, 166], [745, 170], [745, 171], [745, 173], [745, 192], [745, 195], [745, 197], [745, 198], [745, 199], [745, 200], [745, 209], [745, 213], [745, 217], [745, 235], [745, 236], [745, 238], [745, 268], [745, 270], [745, 273], [745, 274], [745, 276], [745, 296], [745, 300], [745, 303], [745, 304], [745, 307], [745, 336], [745, 350], [746, 122], [746, 126], [746, 127], [746, 140], [746, 162], [746, 166], [746, 170], [746, 171], [746, 173], [746, 192], [746, 195], [746, 197], [746, 198], [746, 199], [746, 200], [746, 209], [746, 213], [746, 217], [746, 235], [746, 236], [746, 238], [746, 268], [746, 270], [746, 273], [746, 274], [746, 276], [746, 296], [746, 300], [746, 303], [746, 304], [746, 307], [746, 336], [746, 350], [747, 122], [747, 126], [747, 127], [747, 140], [747, 162], [747, 166], [747, 170], [747, 171], [747, 173], [747, 192], [747, 195], [747, 197], [747, 198], [747, 199], [747, 200], [747, 209], [747, 213], [747, 217], [747, 235], [747, 236], [747, 238], [747, 268], [747, 270], [747, 273], [747, 274], [747, 276], [747, 296], [747, 300], [747, 303], [747, 304], [747, 307], [747, 336], [747, 350], [749, 129], [749, 182], [749, 193], [749, 203], [753, 59], [754, 59], [755, 40], [756, 48], [757, 48], [757, 59], [758, 40], [758, 59], [760, 99], [760, 308], [762, 127], [762, 138], [763, 127], [763, 138], [764, 127], [764, 138], [767, 149], [767, 156], [771, 166], [772, 166], [773, 151], [773, 178], [773, 185], [773, 194], [773, 197], [773, 198], [773, 205], [773, 251], [773, 289], [773, 293], [773, 296], [773, 301], [773, 303], [773, 305], [773, 306], [773, 337], [773, 338], [773, 339], [773, 340], [773, 341], [773, 342], [773, 343], [773, 349], [775, 151], [775, 178], [775, 185], [775, 194], [775, 197], [775, 198], [775, 205], [775, 251], [775, 289], [775, 293], [775, 296], [775, 301], [775, 303], [775, 305], [775, 306], [775, 337], [775, 338], [775, 339], [775, 340], [775, 341], [775, 342], [775, 343], [775, 349], [786, 210], [793, 221], [803, 306], [804, 169], [808, 128], [808, 138], [808, 235], [814, 155], [826, 58], [827, 58], [827, 136], [827, 149], [827, 161], [828, 58], [829, 58], [829, 136], [830, 119], [830, 121], [831, 16], [831, 248], [831, 277], [840, 102], [841, 106], [842, 129], [842, 130], [842, 133], [842, 154], [842, 193], [842, 194], [842, 198], [842, 246], [842, 300], [842, 308], [842, 309], [843, 0], [843, 102], [843, 133], [844, 0], [844, 102], [844, 133], [845, 0], [845, 102], [845, 133], [846, 0], [846, 102], [846, 133], [847, 102], [849, 183], [853, 123], [853, 131], [853, 154], [853, 170], [853, 171], [853, 176], [853, 204], [853, 223], [853, 280], [853, 284], [853, 288], [853, 294], [853, 300], [853, 302], [853, 307], [853, 309], [853, 310], [853, 313], [853, 316], [853, 329], [853, 350], [853, 351], [856, 134], [856, 147], [856, 153], [856, 154], [856, 155], [856, 157], [856, 158], [856, 172], [856, 180], [856, 206], [856, 208], [856, 224], [856, 234], [856, 235], [856, 236], [856, 245], [856, 246], [856, 250], [856, 345], [856, 351], [857, 134], [857, 147], [857, 153], [857, 154], [857, 155], [857, 157], [857, 158], [857, 172], [857, 180], [857, 206], [857, 208], [857, 224], [857, 234], [857, 235], [857, 236], [857, 245], [857, 246], [857, 250], [857, 345], [857, 351], [859, 154], [859, 156], [859, 193], [859, 314], [860, 115], [860, 179], [860, 224], [863, 25], [863, 36], [864, 129], [864, 130], [864, 339], [865, 145], [865, 147], [865, 189], [865, 284], [866, 147], [869, 129], [869, 196], [869, 250], [870, 77], [873, 77], [874, 106], [878, 305], [879, 305], [880, 305], [884, 142], [884, 148], [884, 269], [884, 274], [895, 314], [895, 315], [898, 127], [898, 128], [898, 219], [898, 221], [900, 128], [901, 125], [901, 150], [901, 170], [901, 174], [901, 180], [901, 302], [902, 125], [902, 150], [902, 170], [902, 174], [902, 180], [902, 302], [903, 53], [903, 54], [903, 55], [903, 56], [903, 57], [903, 124], [903, 165], [903, 202], [903, 222], [904, 54], [905, 53], [905, 54], [905, 55], [905, 56], [905, 57], [905, 124], [905, 165], [905, 260], [905, 263], [906, 53], [906, 54], [906, 55], [906, 56], [906, 57], [906, 124], [906, 165], [906, 260], [906, 263], [912, 152], [914, 219], [915, 219], [916, 219], [920, 109], [933, 122], [933, 156], [933, 269], [933, 270], [933, 274], [933, 305], [934, 16], [934, 18], [934, 70], [935, 16], [935, 18], [935, 70], [937, 16], [937, 18], [937, 70], [946, 109], [947, 109], [950, 170], [951, 138], [952, 170], [953, 170], [954, 109], [957, 125], [957, 126], [957, 127], [957, 131], [957, 136], [957, 164], [957, 165], [957, 172], [957, 181], [957, 184], [957, 207], [957, 209], [957, 212], [957, 213], [957, 214], [957, 215], [957, 217], [957, 218], [957, 222], [957, 225], [957, 226], [957, 230], [957, 232], [957, 235], [957, 236], [957, 238], [957, 239], [957, 241], [957, 243], [957, 248], [957, 254], [957, 258], [957, 259], [957, 260], [957, 268], [957, 271], [957, 272], [957, 274], [957, 288], [957, 290], [957, 291], [957, 294], [957, 300], [957, 307], [957, 309], [958, 125], [958, 126], [958, 128], [958, 137], [958, 164], [958, 165], [958, 181], [958, 184], [958, 207], [958, 208], [958, 213], [958, 215], [958, 217], [958, 218], [958, 222], [958, 225], [958, 226], [958, 227], [958, 230], [958, 232], [958, 235], [958, 236], [958, 237], [958, 238], [958, 239], [958, 240], [958, 241], [958, 248], [958, 254], [958, 255], [958, 258], [958, 259], [958, 260], [958, 264], [958, 269], [958, 275], [958, 276], [958, 277], [958, 279], [958, 281], [958, 290], [958, 294], [958, 300], [958, 302], [958, 309], [958, 315], [958, 347], [963, 218], [965, 126], [965, 217], [965, 219], [965, 269], [965, 290], [965, 294], [969, 99], [969, 308], [970, 310], [971, 169], [982, 70], [983, 70], [984, 70], [985, 55], [985, 215], [988, 71], [992, 64], [993, 0], [993, 62], [993, 63], [993, 64], [994, 0], [994, 62], [994, 63], [994, 64], [995, 211], [996, 285], [997, 285], [999, 305], [1000, 142], [1006, 36], [1006, 81], [1006, 82], [1006, 83], [1006, 309], [1006, 312], [1006, 315], [1006, 316], [1006, 332], [1006, 351], [1008, 153], [1008, 166], [1008, 174], [1008, 182], [1008, 230], [1008, 248], [1008, 268], [1008, 274], [1008, 302], [1008, 309], [1008, 313], [1008, 314], [1008, 324], [1008, 331], [1008, 332], [1008, 333], [1009, 153], [1009, 166], [1009, 174], [1009, 182], [1009, 230], [1009, 248], [1009, 268], [1009, 274], [1009, 302], [1009, 309], [1009, 313], [1009, 324], [1009, 331], [1009, 332], [1009, 333], [1010, 153], [1010, 166], [1010, 174], [1010, 182], [1010, 230], [1010, 248], [1010, 268], [1010, 274], [1010, 302], [1010, 309], [1010, 313], [1010, 315], [1010, 324], [1010, 331], [1010, 332], [1010, 333], [1012, 63], [1012, 152], [1013, 153], [1013, 166], [1013, 174], [1013, 182], [1013, 230], [1013, 248], [1013, 268], [1013, 274], [1013, 302], [1013, 309], [1013, 313], [1013, 324], [1013, 331], [1013, 332], [1013, 333], [1015, 153], [1015, 166], [1015, 170], [1015, 174], [1015, 182], [1015, 230], [1015, 233], [1015, 248], [1015, 268], [1015, 274], [1015, 302], [1015, 309], [1015, 313], [1015, 324], [1015, 331], [1015, 332], [1015, 333], [1018, 52], [1024, 305], [1031, 219], [1032, 105], [1032, 116], [1032, 117], [1032, 118], [1032, 139], [1032, 180], [1032, 298], [1033, 335], [1034, 335], [1035, 335], [1036, 335], [1037, 335], [1040, 101], [1041, 101], [1045, 39], [1049, 102], [1052, 106], [1053, 183], [1053, 286], [1053, 308], [1053, 340], [1054, 151], [1054, 183], [1054, 286], [1054, 308], [1054, 340], [1055, 12], [1056, 12], [1057, 12], [1058, 12], [1060, 80], [1061, 291], [1061, 292], [1064, 159], [1066, 168], [1066, 170], [1071, 314], [1072, 314], [1074, 8], [1074, 149], [1075, 8], [1075, 149], [1076, 51], [1076, 135], [1077, 51], [1077, 135], [1090, 142], [1090, 307], [1092, 148], [1094, 252], [1101, 148], [1104, 76], [1104, 266], [1105, 138], [1112, 219], [1119, 14], [1119, 163], [1119, 208], [1119, 246], [1119, 268], [1119, 269], [1119, 270], [1119, 271], [1119, 273], [1119, 274], [1119, 316], [1119, 348], [1120, 150], [1120, 180], [1120, 202], [1120, 223], [1120, 280], [1120, 283], [1120, 284], [1120, 285], [1120, 288], [1121, 150], [1121, 180], [1121, 202], [1121, 223], [1121, 280], [1121, 283], [1121, 284], [1121, 285], [1121, 288], [1123, 138], [1123, 226], [1127, 125], [1127, 138], [1127, 208], [1127, 212], [1129, 138], [1130, 98], [1134, 178], [1134, 199], [1134, 205], [1134, 344], [1140, 46], [1140, 149], [1141, 219], [1142, 138], [1142, 226], [1142, 243], [1143, 138], [1143, 226], [1143, 243], [1144, 99], [1144, 308], [1145, 268], [1145, 282], [1149, 167], [1149, 268], [1149, 282], [1149, 308], [1153, 62], [1155, 153], [1155, 166], [1155, 174], [1155, 182], [1155, 230], [1155, 248], [1155, 268], [1155, 274], [1155, 302], [1155, 309], [1155, 313], [1155, 324], [1155, 331], [1155, 332], [1155, 333], [1156, 153], [1156, 166], [1156, 174], [1156, 182], [1156, 230], [1156, 248], [1156, 268], [1156, 274], [1156, 302], [1156, 309], [1156, 313], [1156, 324], [1156, 331], [1156, 332], [1156, 333], [1159, 106], [1159, 284], [1161, 213], [1162, 213], [1163, 213], [1167, 267], [1174, 162], [1175, 162], [1176, 162], [1177, 162], [1184, 210], [1191, 262], [1194, 115], [1194, 267], [1196, 166], [1197, 166], [1198, 166], [1199, 139], [1200, 123], [1200, 133], [1200, 134], [1200, 139], [1200, 154], [1200, 247], [1200, 248], [1200, 299], [1200, 302], [1200, 306], [1200, 309], [1200, 310], [1200, 311], [1200, 314], [1200, 322], [1200, 327], [1200, 329], [1200, 333], [1201, 123], [1201, 133], [1201, 134], [1201, 139], [1201, 141], [1201, 154], [1201, 162], [1201, 193], [1201, 235], [1201, 248], [1201, 297], [1201, 298], [1201, 300], [1201, 302], [1201, 303], [1201, 304], [1201, 306], [1201, 309], [1201, 310], [1201, 311], [1201, 313], [1201, 314], [1201, 317], [1201, 318], [1201, 319], [1201, 320], [1201, 321], [1201, 322], [1201, 323], [1201, 324], [1201, 325], [1201, 326], [1201, 327], [1201, 329], [1201, 330], [1201, 331], [1201, 332], [1201, 333], [1208, 129], [1208, 130], [1208, 154], [1208, 192], [1208, 193], [1208, 197], [1208, 198], [1208, 199], [1208, 205], [1208, 251], [1208, 288], [1208, 290], [1208, 299], [1208, 303], [1208, 308], [1208, 309], [1208, 338], [1208, 339], [1208, 342], [1208, 343], [1226, 144], [1229, 167], [1233, 167], [1234, 142], [1235, 98], [1236, 154], [1237, 196], [1238, 196], [1242, 219], [1243, 219], [1245, 219], [1252, 132], [1252, 142], [1252, 156], [1252, 159], [1252, 161], [1252, 174], [1252, 176], [1252, 189], [1252, 203], [1252, 285], [1252, 293], [1252, 305], [1252, 309], [1252, 310], [1252, 329], [1253, 248], [1253, 315], [1254, 138], [1254, 172], [1257, 2], [1258, 11], [1258, 115], [1260, 149], [1262, 139], [1262, 155], [1262, 162], [1262, 228], [1262, 298], [1262, 302], [1262, 303], [1262, 306], [1262, 309], [1262, 310], [1262, 311], [1262, 328], [1263, 223], [1264, 139], [1264, 155], [1264, 162], [1264, 228], [1264, 298], [1264, 302], [1264, 303], [1264, 306], [1264, 309], [1264, 310], [1264, 311], [1264, 328], [1265, 151], [1265, 255], [1265, 285], [1266, 150], [1267, 151], [1267, 255], [1267, 285], [1268, 220], [1284, 38], [1284, 41], [1284, 148], [1286, 153], [1286, 166], [1286, 174], [1286, 182], [1286, 230], [1286, 248], [1286, 268], [1286, 274], [1286, 302], [1286, 309], [1286, 313], [1286, 324], [1286, 331], [1286, 332], [1286, 333], [1287, 153], [1287, 166], [1287, 174], [1287, 182], [1287, 230], [1287, 248], [1287, 268], [1287, 274], [1287, 302], [1287, 309], [1287, 313], [1287, 324], [1287, 331], [1287, 332], [1287, 333], [1288, 124], [1288, 131], [1288, 154], [1288, 172], [1288, 207], [1288, 212], [1288, 213], [1288, 214], [1288, 215], [1288, 216], [1288, 217], [1288, 240], [1288, 277], [1288, 279], [1288, 300], [1288, 304], [1288, 307], [1288, 309], [1289, 124], [1289, 131], [1289, 154], [1289, 172], [1289, 207], [1289, 212], [1289, 213], [1289, 214], [1289, 215], [1289, 216], [1289, 217], [1289, 240], [1289, 277], [1289, 279], [1289, 300], [1289, 304], [1289, 307], [1289, 309], [1290, 122], [1290, 124], [1290, 131], [1290, 154], [1290, 172], [1290, 207], [1290, 212], [1290, 213], [1290, 214], [1290, 215], [1290, 216], [1290, 217], [1290, 223], [1290, 240], [1290, 277], [1290, 279], [1290, 300], [1290, 304], [1290, 307], [1290, 309], [1291, 124], [1291, 131], [1291, 154], [1291, 172], [1291, 207], [1291, 212], [1291, 213], [1291, 214], [1291, 215], [1291, 216], [1291, 217], [1291, 219], [1291, 220], [1291, 240], [1291, 277], [1291, 279], [1291, 300], [1291, 304], [1291, 307], [1291, 309], [1296, 148], [1296, 283], [1297, 148], [1297, 283], [1298, 148], [1298, 283], [1299, 148], [1299, 283], [1300, 219], [1301, 138], [1307, 305], [1312, 154], [1312, 176], [1312, 177], [1312, 293], [1312, 294], [1312, 302], [1312, 309], [1312, 329], [1313, 154], [1313, 176], [1313, 177], [1313, 293], [1313, 294], [1313, 302], [1313, 309], [1313, 329], [1314, 154], [1314, 176], [1314, 177], [1314, 293], [1314, 294], [1314, 302], [1314, 309], [1314, 329], [1315, 126], [1315, 138], [1316, 154], [1316, 176], [1316, 177], [1316, 293], [1316, 294], [1316, 302], [1316, 309], [1316, 329], [1317, 126], [1317, 138], [1321, 166], [1323, 102], [1330, 168], [1330, 170], [1330, 309], [1330, 313], [1330, 324], [1330, 333], [1333, 151], [1333, 255], [1333, 285], [1336, 125], [1336, 154], [1336, 176], [1336, 177], [1336, 184], [1336, 186], [1336, 194], [1336, 223], [1336, 302], [1336, 309], [1336, 329], [1336, 345], [1336, 346], [1336, 347], [1336, 351], [1340, 219], [1341, 219], [1343, 219], [1345, 16], [1353, 36], [1353, 55], [1353, 81], [1353, 82], [1353, 312], [1354, 305], [1356, 305], [1361, 70], [1361, 152], [1362, 167], [1362, 197], [1362, 309], [1362, 315], [1362, 331], [1364, 167], [1364, 197], [1364, 309], [1364, 315], [1364, 331], [1365, 16], [1365, 102], [1370, 152], [1371, 144], [1373, 144], [1373, 210], [1374, 144], [1374, 210], [1375, 144], [1376, 144], [1376, 255], [1377, 144], [1377, 151], [1378, 144], [1379, 99], [1379, 308], [1382, 183], [1385, 183], [1391, 178], [1394, 126], [1395, 183], [1396, 126], [1396, 163], [1397, 178], [1401, 24], [1402, 149], [1411, 189], [1412, 190], [1413, 223], [1415, 283], [1415, 285], [1423, 229], [1423, 295], [1425, 229], [1425, 295], [1426, 229], [1426, 295], [1427, 229], [1427, 295], [1428, 229], [1428, 295], [1429, 229], [1429, 295], [1430, 229], [1430, 295], [1431, 129], [1431, 193], [1431, 198], [1431, 339], [1432, 129], [1432, 130], [1432, 193], [1433, 129], [1433, 193], [1433, 198], [1433, 339], [1434, 129], [1434, 196], [1435, 129], [1435, 130], [1435, 193], [1436, 129], [1436, 193], [1436, 198], [1437, 129], [1437, 193], [1441, 337], [1442, 109], [1442, 208], [1442, 332], [1445, 119], [1445, 121], [1445, 142], [1445, 154], [1445, 314], [1445, 331], [1446, 119], [1446, 121], [1446, 309], [1446, 319], [1446, 331], [1447, 183], [1447, 250], [1447, 286], [1447, 308], [1447, 340], [1448, 264], [1450, 16], [1450, 125], [1450, 126], [1450, 127], [1450, 128], [1450, 131], [1450, 137], [1450, 140], [1450, 157], [1450, 158], [1450, 164], [1450, 165], [1450, 172], [1450, 181], [1450, 184], [1450, 207], [1450, 208], [1450, 212], [1450, 213], [1450, 214], [1450, 216], [1450, 220], [1450, 222], [1450, 225], [1450, 226], [1450, 227], [1450, 228], [1450, 230], [1450, 232], [1450, 235], [1450, 237], [1450, 239], [1450, 240], [1450, 241], [1450, 248], [1450, 258], [1450, 259], [1450, 260], [1450, 264], [1450, 277], [1450, 300], [1450, 303], [1450, 309], [1450, 315], [1450, 347], [1451, 16], [1451, 125], [1451, 127], [1451, 128], [1451, 131], [1451, 137], [1451, 140], [1451, 157], [1451, 158], [1451, 164], [1451, 165], [1451, 172], [1451, 181], [1451, 184], [1451, 207], [1451, 208], [1451, 212], [1451, 213], [1451, 214], [1451, 215], [1451, 216], [1451, 217], [1451, 222], [1451, 225], [1451, 226], [1451, 227], [1451, 228], [1451, 230], [1451, 232], [1451, 235], [1451, 237], [1451, 238], [1451, 239], [1451, 240], [1451, 241], [1451, 248], [1451, 258], [1451, 259], [1451, 260], [1451, 264], [1451, 269], [1451, 275], [1451, 276], [1451, 277], [1451, 279], [1451, 300], [1451, 303], [1451, 309], [1451, 315], [1451, 347], [1452, 16], [1452, 125], [1452, 127], [1452, 128], [1452, 131], [1452, 137], [1452, 140], [1452, 157], [1452, 158], [1452, 164], [1452, 165], [1452, 172], [1452, 181], [1452, 184], [1452, 207], [1452, 208], [1452, 212], [1452, 213], [1452, 214], [1452, 216], [1452, 220], [1452, 222], [1452, 225], [1452, 226], [1452, 227], [1452, 228], [1452, 230], [1452, 232], [1452, 235], [1452, 237], [1452, 238], [1452, 239], [1452, 240], [1452, 241], [1452, 248], [1452, 254], [1452, 255], [1452, 258], [1452, 259], [1452, 260], [1452, 264], [1452, 277], [1452, 300], [1452, 303], [1452, 309], [1452, 315], [1452, 347], [1453, 16], [1453, 125], [1453, 126], [1453, 127], [1453, 128], [1453, 131], [1453, 137], [1453, 140], [1453, 157], [1453, 158], [1453, 164], [1453, 165], [1453, 172], [1453, 181], [1453, 184], [1453, 207], [1453, 208], [1453, 212], [1453, 213], [1453, 214], [1453, 216], [1453, 222], [1453, 225], [1453, 226], [1453, 227], [1453, 228], [1453, 230], [1453, 232], [1453, 235], [1453, 237], [1453, 239], [1453, 240], [1453, 241], [1453, 248], [1453, 258], [1453, 259], [1453, 260], [1453, 264], [1453, 277], [1453, 300], [1453, 303], [1453, 309], [1453, 315], [1453, 347], [1454, 16], [1454, 125], [1454, 126], [1454, 127], [1454, 128], [1454, 131], [1454, 137], [1454, 140], [1454, 157], [1454, 158], [1454, 164], [1454, 165], [1454, 172], [1454, 181], [1454, 184], [1454, 207], [1454, 208], [1454, 209], [1454, 212], [1454, 213], [1454, 214], [1454, 216], [1454, 222], [1454, 225], [1454, 226], [1454, 227], [1454, 228], [1454, 230], [1454, 232], [1454, 235], [1454, 237], [1454, 239], [1454, 240], [1454, 241], [1454, 248], [1454, 258], [1454, 259], [1454, 260], [1454, 264], [1454, 277], [1454, 290], [1454, 294], [1454, 300], [1454, 303], [1454, 309], [1454, 315], [1454, 347], [1455, 16], [1455, 125], [1455, 126], [1455, 127], [1455, 128], [1455, 131], [1455, 137], [1455, 140], [1455, 157], [1455, 158], [1455, 164], [1455, 165], [1455, 172], [1455, 181], [1455, 184], [1455, 207], [1455, 208], [1455, 212], [1455, 213], [1455, 214], [1455, 216], [1455, 222], [1455, 225], [1455, 226], [1455, 227], [1455, 228], [1455, 230], [1455, 232], [1455, 235], [1455, 236], [1455, 237], [1455, 239], [1455, 240], [1455, 241], [1455, 248], [1455, 258], [1455, 259], [1455, 260], [1455, 264], [1455, 277], [1455, 300], [1455, 303], [1455, 309], [1455, 315], [1455, 347], [1456, 16], [1456, 125], [1456, 126], [1456, 127], [1456, 128], [1456, 131], [1456, 137], [1456, 140], [1456, 157], [1456, 158], [1456, 164], [1456, 165], [1456, 172], [1456, 181], [1456, 184], [1456, 207], [1456, 208], [1456, 212], [1456, 213], [1456, 214], [1456, 216], [1456, 219], [1456, 222], [1456, 225], [1456, 226], [1456, 227], [1456, 228], [1456, 230], [1456, 232], [1456, 235], [1456, 237], [1456, 239], [1456, 240], [1456, 241], [1456, 248], [1456, 255], [1456, 258], [1456, 259], [1456, 260], [1456, 264], [1456, 277], [1456, 281], [1456, 300], [1456, 303], [1456, 309], [1456, 315], [1456, 347], [1461, 16], [1461, 125], [1461, 126], [1461, 127], [1461, 128], [1461, 131], [1461, 137], [1461, 140], [1461, 157], [1461, 158], [1461, 164], [1461, 165], [1461, 172], [1461, 181], [1461, 184], [1461, 207], [1461, 208], [1461, 209], [1461, 212], [1461, 213], [1461, 214], [1461, 216], [1461, 220], [1461, 222], [1461, 225], [1461, 226], [1461, 227], [1461, 228], [1461, 230], [1461, 232], [1461, 235], [1461, 237], [1461, 239], [1461, 240], [1461, 241], [1461, 248], [1461, 258], [1461, 259], [1461, 260], [1461, 264], [1461, 277], [1461, 300], [1461, 303], [1461, 309], [1461, 315], [1461, 347], [1462, 16], [1462, 125], [1462, 126], [1462, 127], [1462, 128], [1462, 131], [1462, 137], [1462, 140], [1462, 157], [1462, 158], [1462, 164], [1462, 165], [1462, 172], [1462, 181], [1462, 184], [1462, 207], [1462, 208], [1462, 212], [1462, 213], [1462, 214], [1462, 216], [1462, 222], [1462, 225], [1462, 226], [1462, 227], [1462, 228], [1462, 230], [1462, 232], [1462, 235], [1462, 237], [1462, 239], [1462, 240], [1462, 241], [1462, 248], [1462, 254], [1462, 255], [1462, 258], [1462, 259], [1462, 260], [1462, 264], [1462, 277], [1462, 281], [1462, 300], [1462, 303], [1462, 309], [1462, 315], [1462, 347], [1463, 314], [1464, 228], [1467, 264], [1467, 335], [1472, 116], [1474, 119], [1475, 119], [1476, 120], [1477, 120], [1478, 120], [1479, 142], [1479, 150], [1479, 168], [1479, 169], [1480, 335], [1481, 142], [1481, 150], [1481, 168], [1481, 169], [1484, 182], [1484, 310], [1486, 133], [1486, 150], [1486, 151], [1486, 160], [1486, 194], [1487, 335], [1488, 178], [1488, 199], [1488, 338], [1488, 341], [1492, 219], [1501, 16], [1501, 128], [1501, 172], [1501, 207], [1501, 208], [1504, 241], [1504, 248], [1511, 146], [1511, 270], [1511, 274], [1512, 21], [1519, 7], [1519, 62], [1519, 64], [1519, 155], [1519, 224], [1519, 236], [1519, 250], [1520, 7], [1520, 62], [1520, 64], [1520, 155], [1520, 224], [1520, 234], [1520, 236], [1520, 245], [1520, 250], [1525, 53], [1525, 54], [1525, 55], [1525, 56], [1525, 57], [1525, 124], [1525, 165], [1525, 260], [1525, 263], [1526, 53], [1526, 54], [1526, 55], [1526, 56], [1526, 57], [1526, 124], [1526, 165], [1526, 260], [1526, 263], [1527, 53], [1527, 54], [1527, 55], [1527, 56], [1527, 57], [1527, 124], [1527, 165], [1527, 260], [1527, 263], [1528, 53], [1528, 54], [1528, 55], [1528, 56], [1528, 57], [1528, 124], [1528, 165], [1528, 260], [1528, 263], [1529, 53], [1529, 54], [1529, 55], [1529, 56], [1529, 57], [1529, 124], [1529, 165], [1529, 260], [1529, 263], [1530, 131], [1530, 132], [1530, 184], [1530, 200], [1530, 201], [1530, 202], [1530, 218], [1530, 282], [1530, 304], [1530, 306], [1530, 311], [1530, 350], [1531, 219], [1532, 138], [1533, 80], [1534, 223], [1534, 283], [1534, 285], [1541, 29], [1542, 14], [1543, 147], [1544, 100], [1544, 270], [1549, 219], [1550, 219], [1552, 219], [1555, 187], [1559, 98], [1565, 79], [1566, 15], [1568, 167], [1568, 302], [1568, 309], [1568, 331], [1570, 134], [1570, 310], [1570, 315], [1571, 192], [1571, 203], [1572, 132], [1572, 133], [1572, 136], [1572, 141], [1572, 147], [1572, 148], [1572, 154], [1572, 156], [1572, 159], [1572, 161], [1572, 164], [1572, 168], [1572, 176], [1572, 189], [1572, 193], [1572, 211], [1572, 214], [1572, 229], [1572, 247], [1572, 270], [1572, 274], [1572, 284], [1572, 285], [1572, 293], [1572, 296], [1572, 298], [1572, 299], [1572, 305], [1572, 306], [1572, 307], [1572, 309], [1572, 314], [1572, 315], [1572, 317], [1572, 322], [1572, 329], [1572, 333], [1572, 350], [1572, 351], [1575, 134], [1575, 139], [1575, 140], [1575, 228], [1577, 134], [1579, 134], [1582, 135], [1583, 135], [1584, 51], [1584, 135], [1586, 168], [1587, 168], [1588, 168], [1591, 294], [1592, 183], [1593, 141], [1593, 314], [1594, 294], [1596, 294], [1597, 182], [1599, 182], [1600, 182], [1601, 182], [1602, 129], [1602, 130], [1602, 131], [1603, 182], [1604, 211], [1607, 104], [1620, 223], [1620, 283], [1620, 285], [1633, 151], [1633, 154], [1633, 186], [1633, 188], [1633, 285], [1633, 287], [1633, 289], [1633, 290], [1633, 292], [1633, 293], [1633, 294], [1633, 296], [1633, 298], [1633, 299], [1633, 305], [1633, 306], [1633, 307], [1633, 308], [1633, 313], [1633, 336], [1633, 339], [1633, 341], [1633, 350], [1634, 161], [1634, 188], [1634, 297], [1634, 298], [1634, 301], [1634, 302], [1634, 304], [1634, 305], [1634, 308], [1639, 16], [1639, 18], [1640, 16], [1650, 186], [1650, 188], [1650, 299], [1650, 301], [1650, 308], [1651, 223], [1653, 139], [1653, 140], [1656, 14], [1656, 208], [1656, 212], [1656, 246], [1656, 268], [1656, 269], [1656, 270], [1656, 271], [1656, 273], [1656, 274], [1656, 316], [1656, 348], [1672, 148], [1672, 270], [1672, 274], [1672, 287], [1674, 100], [1674, 270], [1676, 305], [1679, 43], [1688, 29], [1688, 63], [1690, 131], [1690, 189], [1690, 190], [1690, 191], [1690, 197], [1690, 198], [1690, 199], [1690, 200], [1690, 211], [1690, 234], [1690, 283], [1690, 284], [1690, 289], [1690, 293], [1690, 299], [1690, 301], [1690, 306], [1690, 308], [1690, 336], [1692, 146], [1701, 66], [1702, 66], [1703, 150], [1703, 151], [1703, 162], [1703, 178], [1703, 185], [1703, 251], [1703, 300], [1703, 302], [1703, 303], [1703, 304], [1703, 305], [1703, 306], [1703, 307], [1703, 311], [1703, 338], [1703, 342], [1703, 343], [1703, 349], [1708, 314], [1709, 166], [1709, 168], [1709, 268], [1709, 274], [1709, 302], [1709, 331], [1709, 332], [1709, 333], [1711, 124], [1716, 129], [1716, 196], [1716, 198], [1716, 339], [1717, 132], [1717, 156], [1717, 161], [1717, 188], [1717, 189], [1717, 190], [1717, 191], [1717, 203], [1717, 250], [1717, 283], [1717, 284], [1717, 285], [1717, 297], [1717, 300], [1717, 306], [1717, 307], [1718, 174], [1718, 175], [1719, 174], [1719, 175], [1720, 38], [1720, 41], [1720, 148], [1724, 129], [1724, 196], [1724, 198], [1724, 250], [1724, 339], [1724, 341], [1731, 305], [1732, 305], [1733, 305], [1734, 305], [1735, 305], [1743, 126], [1743, 149], [1744, 126], [1745, 126], [1746, 124], [1748, 122], [1748, 124], [1748, 311], [1749, 124], [1750, 346], [1752, 176], [1752, 179], [1752, 180], [1752, 204], [1752, 223], [1752, 284], [1752, 294], [1752, 311], [1752, 340], [1753, 176], [1753, 179], [1753, 180], [1753, 204], [1753, 223], [1753, 284], [1753, 294], [1753, 311], [1753, 340], [1754, 180], [1754, 204], [1754, 223], [1754, 259], [1754, 283], [1754, 313], [1754, 314], [1762, 219], [1768, 170], [1769, 170], [1773, 40], [1773, 42], [1776, 183], [1777, 117], [1783, 27], [1784, 109], [1784, 297], [1784, 299], [1784, 301], [1784, 302], [1784, 308], [1787, 109], [1787, 297], [1787, 299], [1787, 301], [1787, 302], [1787, 308], [1791, 106], [1793, 309], [1793, 328], [1797, 229], [1797, 295], [1800, 166], [1809, 212], [1810, 156], [1811, 46], [1811, 149], [1812, 313], [1820, 219], [1821, 310], [1823, 49], [1826, 36], [1828, 17], [1828, 83], [1828, 312], [1829, 17], [1829, 83], [1829, 312], [1838, 129], [1841, 125], [1841, 128], [1841, 131], [1841, 176], [1841, 195], [1841, 199], [1841, 200], [1841, 201], [1841, 202], [1841, 204], [1841, 223], [1841, 288], [1841, 313], [1841, 350], [1843, 14], [1843, 163], [1843, 208], [1843, 246], [1843, 268], [1843, 269], [1843, 270], [1843, 271], [1843, 273], [1843, 274], [1843, 316], [1843, 348], [1851, 101], [1851, 109], [1852, 101], [1852, 109], [1853, 101], [1853, 301], [1854, 101], [1855, 101], [1856, 101], [1857, 139], [1857, 140], [1857, 228], [1857, 303], [1857, 311], [1859, 125], [1860, 125], [1861, 125], [1878, 148], [1883, 348], [1884, 348], [1900, 167], [1900, 197], [1900, 272], [1900, 302], [1900, 306], [1900, 311], [1905, 13], [1905, 227], [1907, 139], [1910, 76], [1911, 27], [1911, 230], [1913, 38], [1914, 69], [1915, 38], [1915, 41], [1916, 38], [1916, 41], [1917, 38], [1917, 41], [1918, 38], [1919, 38], [1920, 166], [1921, 69], [1922, 101], [1925, 138], [1925, 240], [1930, 138], [1930, 240], [1931, 285], [1937, 219], [1941, 225], [1941, 244], [1941, 252], [1942, 129], [1942, 156], [1942, 193], [1942, 309], [1943, 29], [1943, 34], [1945, 116], [1945, 156], [1946, 76], [1949, 100], [1949, 153], [1949, 270], [1950, 314], [1951, 314], [1957, 142], [1962, 124], [1962, 136], [1962, 137], [1962, 173], [1962, 201], [1962, 202], [1962, 327], [1963, 156], [1963, 203], [1964, 268], [1965, 219], [1968, 305], [1969, 138], [1973, 126], [1973, 163], [1978, 313], [1979, 183], [1983, 140], [1985, 152], [1987, 167], [1987, 233], [1987, 302], [1987, 309], [1987, 314], [1987, 331], [1991, 167], [1991, 197], [1991, 233], [1991, 273], [1991, 302], [1991, 309], [1991, 314], [1991, 331], [1992, 167], [1992, 197], [1992, 233], [1992, 302], [1992, 309], [1992, 314], [1992, 315], [1992, 331], [1993, 167], [1993, 172], [1993, 197], [1993, 233], [1993, 302], [1993, 309], [1993, 314], [1993, 331], [1994, 305], [1997, 126], [1997, 162], [1997, 189], [1997, 268], [1997, 269], [1997, 270], [1997, 272], [1997, 273], [1997, 274], [2001, 125], [2001, 128], [2001, 137], [2001, 164], [2001, 204], [2001, 225], [2002, 124], [2002, 125], [2003, 125], [2003, 180], [2005, 138], [2005, 240], [2006, 122], [2006, 125], [2006, 180], [2007, 125], [2007, 128], [2007, 137], [2007, 164], [2007, 204], [2007, 209], [2007, 215], [2009, 305], [2010, 305], [2011, 305], [2012, 305], [2013, 148], [2019, 134], [2019, 139], [2019, 141], [2019, 142], [2019, 150], [2019, 154], [2019, 162], [2019, 192], [2019, 233], [2019, 284], [2019, 300], [2019, 302], [2019, 306], [2019, 309], [2019, 310], [2019, 311], [2019, 313], [2019, 314], [2019, 321], [2019, 322], [2019, 325], [2019, 326], [2019, 327], [2020, 141], [2020, 314], [2021, 106], [2021, 340], [2022, 106], [2023, 106], [2023, 340], [2024, 183], [2024, 260], [2024, 262], [2025, 260], [2025, 262], [2027, 138], [2036, 122], [2036, 123], [2036, 125], [2036, 131], [2036, 176], [2036, 202], [2036, 211], [2036, 223], [2036, 224], [2036, 280], [2036, 284], [2036, 288], [2036, 300], [2036, 307], [2036, 309], [2036, 314], [2036, 318], [2036, 327], [2037, 128], [2037, 138], [2037, 218], [2037, 248], [2037, 279], [2039, 63], [2042, 1], [2042, 62], [2045, 13], [2048, 314], [2051, 183], [2051, 194], [2051, 200], [2051, 306], [2052, 310], [2053, 183], [2053, 186], [2053, 194], [2053, 287], [2053, 289], [2053, 292], [2053, 296], [2054, 149], [2054, 185], [2055, 53], [2059, 24], [2059, 157], [2060, 24], [2060, 157], [2061, 155], [2061, 157], [2061, 234], [2061, 246], [2061, 250], [2062, 155], [2062, 157], [2062, 234], [2062, 246], [2062, 250], [2069, 145], [2069, 147], [2070, 149], [2070, 313], [2072, 149], [2083, 150], [2083, 180], [2083, 202], [2083, 223], [2083, 280], [2083, 283], [2083, 284], [2083, 285], [2083, 288], [2084, 150], [2084, 180], [2084, 202], [2084, 223], [2084, 280], [2084, 283], [2084, 284], [2084, 285], [2084, 288], [2089, 219], [2093, 27], [2093, 29], [2093, 69], [2093, 70], [2093, 75], [2093, 82], [2093, 193], [2101, 229], [2101, 295], [2102, 229], [2102, 295], [2105, 25], [2105, 26], [2105, 31], [2106, 154], [2106, 189], [2106, 285], [2106, 288], [2107, 154], [2108, 154], [2108, 189], [2108, 288], [2110, 80], [2111, 129], [2112, 24], [2113, 18], [2113, 83], [2114, 259], [2115, 262], [2116, 164], [2126, 168], [2126, 174], [2126, 181], [2126, 206], [2127, 134], [2127, 166], [2127, 168], [2127, 174], [2127, 175], [2127, 206], [2127, 268], [2127, 274], [2133, 129], [2139, 252], [2142, 103], [2154, 314], [2158, 2], [2163, 126], [2163, 127], [2163, 161], [2163, 162], [2163, 186], [2163, 268], [2163, 269], [2163, 271], [2163, 272], [2163, 273], [2163, 274], [2163, 301], [2163, 303], [2163, 316], [2163, 348], [2164, 102], [2165, 102], [2169, 151], [2169, 156], [2169, 180], [2169, 181], [2169, 268], [2169, 269], [2169, 270], [2169, 271], [2169, 273], [2169, 274], [2169, 283], [2169, 285], [2171, 151], [2171, 156], [2171, 180], [2171, 181], [2171, 268], [2171, 269], [2171, 270], [2171, 271], [2171, 273], [2171, 274], [2171, 283], [2171, 285], [2174, 178], [2175, 309], [2175, 327], [2185, 305], [2186, 2], [2186, 36], [2186, 334], [2186, 348], [2188, 42], [2188, 43], [2189, 42], [2189, 43], [2191, 54], [2191, 152], [2196, 148], [2198, 54], [2211, 166], [2212, 183], [2214, 150], [2215, 150], [2220, 219], [2221, 155], [2221, 224], [2221, 245], [2221, 246], [2221, 250], [2222, 65], [2223, 65], [2224, 272], [2225, 123], [2225, 125], [2225, 131], [2225, 146], [2225, 150], [2225, 170], [2225, 171], [2225, 176], [2225, 179], [2225, 180], [2225, 181], [2225, 184], [2225, 186], [2225, 192], [2225, 216], [2225, 222], [2225, 223], [2225, 226], [2225, 231], [2225, 233], [2225, 235], [2225, 240], 