{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 74444], "name": "inputs", "sparse": false}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Diagonal", "config": {"name": "h0", "dtype": "float32", "activation": "tanh", "trainable": true, "units": 18611, "batch_input_shape": [null, 74444], "use_bias": true}, "inbound_nodes": [[["inputs", 0, 0, {}]]], "name": "h0"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_0"}, "inbound_nodes": [[["h0", 0, 0, {"training": false}]]], "name": "dropout_0"}, {"class_name": "SparseTF", "config": {"W_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "h1", "bias_regularizer": null, "activation": "tanh", "trainable": true, "nonzero_ind": [[0, 142], [1, 142], [4, 2], [4, 3], [5, 150], [7, 15], [7, 351], [8, 305], [9, 305], [10, 74], [12, 178], [14, 98], [16, 146], [16, 169], [16, 241], [16, 248], [16, 271], [16, 272], [16, 300], [16, 309], [16, 310], [16, 331], [16, 335], [16, 348], [26, 272], [33, 154], [33, 176], [33, 177], [33, 178], [33, 223], [33, 302], [33, 345], [33, 346], [33, 347], [34, 154], [34, 176], [34, 177], [34, 178], [34, 223], [34, 302], [34, 345], [34, 346], [34, 347], [35, 58], [36, 126], [36, 127], [36, 128], [36, 163], [36, 164], [36, 233], [36, 260], [36, 268], [36, 272], [36, 274], [36, 345], [36, 346], [36, 347], [36, 348], [37, 126], [37, 127], [37, 128], [37, 163], [37, 164], [37, 233], [37, 260], [37, 268], [37, 272], [37, 274], [37, 345], [37, 346], [37, 347], [37, 348], [38, 126], [38, 127], [38, 128], [38, 163], [38, 164], [38, 233], [38, 260], [38, 268], [38, 272], [38, 274], [38, 345], [38, 346], [38, 347], [38, 348], [39, 154], [39, 176], [39, 177], [39, 194], [39, 223], [39, 302], [39, 345], [39, 346], [39, 347], [40, 151], [40, 154], [40, 176], [40, 177], [40, 184], [40, 194], [40, 223], [40, 302], [40, 309], [40, 313], [40, 329], [40, 345], [40, 346], [40, 347], [41, 154], [41, 176], [41, 177], [41, 194], [41, 223], [41, 302], [41, 309], [41, 329], [41, 345], [41, 346], [41, 347], [42, 154], [42, 176], [42, 177], [42, 178], [42, 194], [42, 204], [42, 205], [42, 223], [42, 288], [42, 289], [42, 302], [42, 345], [42, 346], [42, 347], [43, 113], [43, 151], [43, 154], [43, 176], [43, 177], [43, 194], [43, 223], [43, 280], [43, 284], [43, 286], [43, 288], [43, 302], [43, 305], [43, 313], [43, 314], [43, 345], [43, 346], [43, 347], [44, 154], [44, 176], [44, 177], [44, 178], [44, 194], [44, 223], [44, 293], [44, 302], [44, 309], [44, 329], [44, 345], [44, 346], [44, 347], [45, 154], [45, 176], [45, 177], [45, 223], [45, 302], [45, 345], [45, 346], [45, 347], [46, 126], [46, 138], [60, 138], [61, 169], [63, 41], [64, 41], [66, 48], [67, 47], [68, 48], [70, 48], [71, 47], [72, 48], [73, 183], [73, 223], [73, 296], [74, 132], [74, 156], [74, 310], [74, 328], [75, 151], [75, 154], [75, 176], [75, 177], [75, 178], [75, 223], [75, 233], [75, 300], [75, 302], [75, 309], [75, 313], [75, 329], [75, 345], [75, 346], [75, 347], [75, 351], [76, 126], [76, 235], [76, 239], [76, 321], [77, 125], [77, 178], [77, 186], [77, 195], [77, 204], [77, 223], [77, 292], [77, 303], [77, 306], [77, 341], [77, 349], [78, 125], [78, 151], [78, 178], [78, 183], [78, 186], [78, 194], [78, 204], [78, 223], [78, 286], [78, 287], [78, 289], [78, 294], [78, 296], [78, 310], [78, 328], [79, 223], [82, 126], [82, 128], [82, 157], [82, 172], [82, 173], [82, 209], [82, 211], [82, 214], [82, 235], [82, 239], [82, 276], [82, 279], [82, 321], [83, 113], [83, 149], [83, 150], [84, 262], [85, 262], [86, 262], [87, 262], [94, 65], [94, 152], [98, 24], [98, 152], [101, 127], [101, 128], [101, 163], [101, 164], [101, 225], [101, 232], [101, 233], [101, 239], [101, 253], [101, 254], [101, 256], [101, 258], [101, 259], [101, 260], [101, 261], [101, 262], [101, 264], [101, 266], [102, 127], [102, 128], [102, 163], [102, 164], [102, 225], [102, 232], [102, 233], [102, 239], [102, 253], [102, 254], [102, 256], [102, 258], [102, 259], [102, 260], [102, 261], [102, 262], [102, 264], [102, 266], [103, 127], [103, 128], [103, 163], [103, 164], [103, 225], [103, 232], [103, 233], [103, 239], [103, 253], [103, 254], [103, 256], [103, 258], [103, 259], [103, 260], [103, 261], [103, 262], [103, 264], [103, 266], [104, 127], [104, 128], [104, 163], [104, 164], [104, 225], [104, 232], [104, 233], [104, 239], [104, 253], [104, 254], [104, 256], [104, 258], [104, 259], [104, 260], [104, 261], [104, 262], [104, 264], [104, 266], [106, 58], [106, 126], [106, 136], [106, 137], [106, 171], [106, 172], [106, 202], [106, 296], [107, 58], [107, 126], [107, 136], [107, 137], [107, 171], [107, 172], [107, 202], [107, 296], [108, 0], [109, 140], [109, 228], [110, 140], [110, 228], [111, 140], [111, 228], [112, 140], [112, 228], [115, 31], [115, 64], [115, 65], [115, 216], [116, 128], [121, 182], [122, 117], [123, 138], [123, 243], [124, 145], [124, 147], [125, 145], [125, 147], [126, 145], [126, 147], [127, 145], [127, 147], [131, 183], [132, 15], [133, 183], [133, 308], [134, 183], [134, 308], [135, 305], [136, 100], [146, 127], [146, 128], [146, 154], [146, 155], [146, 157], [146, 164], [146, 173], [146, 185], [146, 203], [146, 206], [146, 207], [146, 208], [146, 214], [146, 217], [146, 225], [146, 230], [146, 232], [146, 236], [146, 238], [146, 239], [146, 240], [146, 241], [146, 245], [146, 248], [146, 255], [146, 271], [146, 273], [146, 275], [146, 276], [146, 279], [146, 296], [146, 298], [146, 300], [146, 302], [146, 303], [146, 304], [146, 311], [146, 315], [146, 322], [147, 305], [150, 178], [151, 178], [152, 178], [156, 170], [157, 170], [159, 219], [162, 305], [163, 305], [169, 21], [174, 224], [175, 224], [177, 134], [177, 136], [177, 138], [178, 310], [180, 121], [183, 33], [183, 53], [183, 54], [185, 178], [186, 219], [188, 100], [188, 270], [191, 232], [192, 232], [194, 142], [194, 284], [195, 121], [196, 151], [196, 178], [196, 185], [196, 194], [196, 197], [196, 198], [196, 205], [196, 251], [196, 289], [196, 293], [196, 296], [196, 301], [196, 303], [196, 305], [196, 306], [196, 337], [196, 338], [196, 339], [196, 340], [196, 341], [196, 342], [196, 343], [196, 349], [199, 147], [203, 206], [204, 206], [205, 126], [205, 128], [205, 138], [205, 181], [205, 217], [205, 269], [205, 275], [205, 276], [205, 277], [205, 279], [208, 124], [208, 132], [208, 195], [208, 197], [208, 198], [208, 199], [208, 288], [208, 336], [208, 344], [212, 122], [212, 124], [212, 125], [212, 128], [212, 131], [212, 136], [212, 166], [212, 170], [212, 171], [212, 176], [212, 179], [212, 186], [212, 195], [212, 200], [212, 201], [212, 202], [212, 204], [212, 223], [212, 273], [212, 288], [212, 300], [212, 307], [212, 309], [212, 317], [212, 319], [212, 335], [212, 348], [212, 349], [212, 351], [213, 122], [213, 124], [213, 125], [213, 128], [213, 131], [213, 136], [213, 166], [213, 170], [213, 171], [213, 176], [213, 179], [213, 195], [213, 200], [213, 201], [213, 223], [213, 288], [213, 300], [213, 307], [213, 309], [213, 317], [213, 319], [213, 335], [213, 349], [213, 351], [214, 122], [214, 124], [214, 125], [214, 128], [214, 131], [214, 136], [214, 151], [214, 154], [214, 166], [214, 170], [214, 171], [214, 173], [214, 176], [214, 179], [214, 180], [214, 186], [214, 188], [214, 195], [214, 200], [214, 201], [214, 202], [214, 204], [214, 211], [214, 223], [214, 246], [214, 247], [214, 260], [214, 270], [214, 273], [214, 274], [214, 280], [214, 282], [214, 283], [214, 284], [214, 285], [214, 288], [214, 300], [214, 304], [214, 306], [214, 307], [214, 309], [214, 311], [214, 313], [214, 316], [214, 317], [214, 318], [214, 319], [214, 335], [214, 348], [214, 349], [214, 350], [214, 351], [215, 176], [215, 179], [215, 204], [215, 223], [215, 280], [215, 284], [215, 294], [216, 210], [217, 210], [218, 210], [219, 210], [223, 310], [224, 241], [224, 248], [224, 310], [225, 142], [225, 344], [226, 302], [229, 302], [233, 168], [233, 309], [233, 324], [234, 128], [234, 168], [234, 170], [234, 309], [234, 313], [234, 324], [237, 162], [238, 162], [243, 47], [243, 49], [244, 43], [245, 43], [247, 124], [247, 125], [247, 126], [247, 127], [247, 128], [247, 135], [247, 140], [247, 162], [247, 164], [247, 165], [247, 172], [247, 192], [247, 207], [247, 209], [247, 211], [247, 217], [247, 219], [247, 221], [247, 222], [247, 224], [247, 226], [247, 230], [247, 235], [247, 236], [247, 238], [247, 239], [247, 258], [247, 259], [247, 268], [247, 269], [247, 274], [247, 276], [247, 279], [247, 286], [247, 296], [247, 300], [247, 304], [247, 307], [247, 309], [247, 321], [247, 350], [247, 351], [248, 124], [248, 125], [248, 126], [248, 127], [248, 128], [248, 135], [248, 140], [248, 162], [248, 164], [248, 165], [248, 172], [248, 192], [248, 207], [248, 209], [248, 211], [248, 217], [248, 219], [248, 221], [248, 222], [248, 224], [248, 226], [248, 230], [248, 235], [248, 236], [248, 238], [248, 239], [248, 258], [248, 259], [248, 268], [248, 269], [248, 274], [248, 276], [248, 279], [248, 286], [248, 296], [248, 300], [248, 304], [248, 307], [248, 309], [248, 321], [248, 350], [248, 351], [249, 150], [250, 124], [250, 125], [250, 126], [250, 127], [250, 128], [250, 135], [250, 140], [250, 162], [250, 164], [250, 165], [250, 172], [250, 192], [250, 207], [250, 209], [250, 211], [250, 217], [250, 219], [250, 221], [250, 222], [250, 224], [250, 226], [250, 230], [250, 235], [250, 236], [250, 238], [250, 239], [250, 258], [250, 259], [250, 268], [250, 269], [250, 274], [250, 276], [250, 279], [250, 286], [250, 296], [250, 300], [250, 304], [250, 307], [250, 309], [250, 321], [250, 350], [250, 351], [254, 186], [254, 189], [254, 191], [254, 285], [259, 213], [262, 126], [262, 138], [262, 259], [263, 10], [263, 296], [265, 186], [266, 266], [270, 186], [271, 186], [274, 148], [275, 311], [276, 148], [278, 178], [279, 156], [281, 124], [281, 137], [281, 170], [281, 192], [281, 193], [281, 195], [281, 204], [281, 211], [281, 234], [281, 245], [281, 282], [281, 283], [281, 305], [281, 313], [281, 316], [281, 318], [281, 327], [281, 336], [283, 138], [284, 138], [285, 138], [288, 99], [289, 99], [290, 99], [291, 99], [292, 99], [293, 99], [294, 99], [303, 134], [303, 139], [303, 140], [303, 141], [303, 154], [303, 162], [303, 228], [303, 248], [303, 297], [303, 298], [303, 299], [303, 302], [303, 303], [303, 306], [303, 309], [303, 311], [303, 322], [303, 329], [303, 333], [307, 151], [307, 178], [307, 185], [307, 194], [307, 197], [307, 198], [307, 205], [307, 251], [307, 289], [307, 293], [307, 296], [307, 301], [307, 303], [307, 305], [307, 306], [307, 337], [307, 338], [307, 339], [307, 340], [307, 341], [307, 342], [307, 343], [307, 349], [313, 151], [313, 296], [320, 125], [320, 137], [320, 138], [320, 154], [320, 223], [320, 283], [320, 309], [325, 137], [325, 138], [325, 154], [325, 309], [326, 147], [326, 155], [326, 157], [326, 234], [326, 235], [326, 250], [326, 279], [327, 279], [330, 125], [330, 137], [330, 154], [330, 223], [330, 283], [330, 309], [331, 283], [332, 283], [333, 283], [334, 283], [335, 283], [336, 283], [337, 283], [338, 283], [340, 125], [340, 150], [340, 170], [340, 174], [340, 180], [340, 302], [341, 150], [341, 161], [342, 99], [342, 308], [343, 150], [343, 161], [344, 109], [344, 150], [344, 161], [345, 150], [345, 161], [347, 219], [348, 219], [349, 219], [350, 18], [351, 18], [352, 219], [357, 310], [358, 310], [359, 104], [359, 127], [360, 40], [360, 42], [362, 40], [362, 42], [371, 138], [372, 138], [374, 116], [375, 138], [377, 262], [380, 202], [380, 283], [382, 229], [382, 295], [391, 53], [394, 40], [395, 40], [396, 40], [397, 59], [398, 53], [398, 54], [399, 53], [399, 54], [400, 53], [400, 160], [401, 53], [401, 54], [405, 229], [405, 295], [407, 146], [409, 67], [409, 74], [417, 133], [417, 334], [418, 348], [419, 348], [420, 10], [421, 348], [422, 187], [423, 67], [423, 74], [424, 108], [424, 148], [424, 151], [424, 281], [425, 108], [425, 148], [425, 151], [425, 281], [426, 67], [426, 74], [427, 55], [427, 132], [427, 171], [427, 192], [427, 196], [427, 203], [427, 212], [427, 215], [427, 227], [427, 235], [427, 237], [427, 268], [427, 274], [427, 289], [427, 300], [427, 302], [427, 304], [427, 309], [427, 312], [427, 314], [427, 329], [428, 55], [428, 184], [428, 215], [428, 237], [429, 314], [435, 283], [436, 310], [437, 268], [437, 269], [438, 268], [438, 269], [439, 268], [439, 269], [440, 268], [440, 269], [442, 160], [442, 268], [442, 269], [449, 267], [451, 122], [451, 148], [451, 156], [451, 246], [451, 268], [451, 269], [451, 270], [451, 273], [451, 274], [451, 310], [451, 350], [452, 147], [452, 153], [452, 154], [452, 314], [455, 129], [455, 169], [455, 170], [455, 174], [456, 129], [456, 169], [456, 174], [456, 227], [457, 129], [457, 169], [457, 174], [458, 129], [458, 169], [458, 174], [458, 182], [458, 233], [458, 309], [458, 324], [458, 351], [459, 129], [460, 129], [460, 169], [460, 174], [460, 309], [460, 324], [473, 124], [473, 174], [473, 175], [473, 309], [473, 314], [473, 326], [473, 330], [475, 175], [476, 124], [476, 125], [476, 162], [476, 204], [476, 309], [476, 330], [477, 175], [479, 174], [479, 175], [485, 302], [485, 311], [489, 166], [492, 149], [492, 267], [493, 149], [493, 267], [501, 252], [502, 51], [502, 135], [502, 151], [502, 223], [506, 177], [506, 345], [506, 346], [506, 347], [506, 349], [509, 79], [510, 24], [510, 208], [511, 116], [518, 83], [518, 151], [518, 186], [518, 310], [518, 328], [519, 129], [519, 193], [520, 137], [520, 138], [520, 165], [520, 255], [521, 4], [521, 44], [525, 178], [527, 208], [529, 309], [529, 329], [530, 219], [531, 219], [533, 80], [534, 136], [534, 137], [534, 184], [534, 192], [534, 195], [534, 201], [534, 296], [534, 337], [535, 102], [536, 102], [537, 102], [538, 102], [539, 13], [539, 38], [540, 13], [540, 322], [541, 13], [545, 162], [546, 162], [547, 149], [549, 149], [550, 149], [554, 285], [556, 0], [556, 9], [556, 27], [556, 62], [556, 75], [556, 81], [556, 82], [556, 250], [557, 0], [557, 9], [557, 27], [557, 62], [557, 75], [557, 81], [557, 82], [557, 250], [558, 0], [558, 9], [558, 27], [558, 62], [558, 75], [558, 81], [558, 82], [558, 250], [559, 0], [559, 9], [559, 27], [559, 62], [559, 75], [559, 81], [559, 82], [559, 250], [563, 107], [564, 107], [565, 107], [565, 268], [565, 269], [565, 270], [565, 271], [565, 272], [565, 273], [565, 274], [566, 107], [566, 268], [566, 269], [566, 270], [566, 271], [566, 272], [566, 273], [566, 274], [567, 107], [567, 268], [567, 269], [567, 270], [567, 271], [567, 272], [567, 273], [567, 274], [568, 107], [568, 268], [568, 269], [568, 270], [568, 271], [568, 272], [568, 273], [568, 274], [569, 107], [569, 268], [569, 269], [569, 270], [569, 271], [569, 272], [569, 273], [569, 274], [570, 107], [570, 268], [570, 269], [570, 270], [570, 271], [570, 272], [570, 273], [570, 274], [571, 107], [571, 268], [571, 269], [571, 270], [571, 271], [571, 272], [571, 273], [571, 274], [576, 121], [577, 121], [582, 150], [587, 62], [590, 150], [608, 314], [609, 77], [609, 152], [610, 124], [610, 125], [610, 128], [610, 138], [610, 207], [610, 209], [610, 213], [610, 217], [610, 268], [610, 270], [610, 271], [610, 272], [610, 273], [610, 274], [610, 275], [610, 276], [610, 278], [610, 279], [610, 340], [611, 126], [611, 128], [611, 138], [611, 207], [611, 209], [611, 213], [611, 268], [611, 270], [611, 272], [611, 273], [611, 274], [611, 275], [611, 276], [611, 278], [611, 279], [612, 124], [612, 125], [612, 126], [612, 128], [612, 138], [612, 207], [612, 209], [612, 213], [612, 217], [612, 268], [612, 270], [612, 272], [612, 273], [612, 274], [612, 275], [612, 276], [612, 278], [612, 279], [612, 340], [614, 126], [614, 128], [614, 138], [614, 207], [614, 209], [614, 213], [614, 268], [614, 270], [614, 272], [614, 273], [614, 274], [614, 275], [614, 276], [614, 278], [614, 279], [616, 97], [616, 151], [616, 185], [616, 300], [616, 305], [616, 306], [616, 307], [616, 344], [617, 129], [617, 130], [617, 182], [617, 193], [617, 198], [617, 304], [617, 308], [617, 309], [617, 311], [623, 265], [624, 220], [625, 220], [626, 220], [627, 220], [628, 21], [628, 71], [629, 21], [629, 71], [630, 220], [634, 106], [635, 75], [636, 34], [636, 80], [643, 148], [643, 154], [643, 196], [643, 229], [643, 232], [643, 285], [643, 309], [643, 315], [643, 322], [643, 350], [643, 351], [646, 183], [648, 233], [649, 233], [650, 233], [654, 141], [662, 210], [662, 214], [663, 210], [663, 215], [663, 217], [663, 269], [663, 275], [663, 276], [663, 279], [664, 210], [664, 215], [664, 217], [664, 269], [664, 275], [664, 276], [664, 279], [666, 124], [666, 309], [666, 319], [670, 305], [675, 100], [677, 9], [677, 24], [677, 29], [677, 62], [677, 63], [677, 65], [677, 77], [677, 263], [678, 9], [678, 24], [678, 29], [678, 62], [678, 63], [678, 65], [678, 77], [678, 263], [681, 304], [682, 174], [682, 175], [690, 219], [691, 129], [691, 130], [691, 150], [691, 154], [691, 193], [691, 194], [691, 197], [691, 198], [691, 299], [691, 303], [691, 309], [692, 129], [692, 130], [692, 150], [692, 154], [692, 193], [692, 197], [692, 198], [692, 299], [692, 303], [692, 309], [692, 310], [693, 150], [694, 126], [695, 126], [695, 260], [696, 129], [696, 130], [696, 150], [696, 154], [696, 193], [696, 197], [696, 198], [696, 299], [696, 303], [696, 309], [696, 339], [696, 344], [698, 149], [699, 210], [699, 212], [699, 213], [699, 278], [700, 210], [700, 212], [700, 213], [700, 278], [710, 142], [710, 150], [710, 203], [710, 246], [711, 109], [711, 150], [711, 161], [712, 109], [712, 150], [712, 161], [713, 150], [713, 161], [714, 21], [720, 261], [726, 310], [729, 134], [729, 139], [729, 154], [729, 162], [729, 302], [729, 311], [730, 305], [732, 305], [733, 305], [737, 13], [746, 122], [746, 126], [746, 127], [746, 140], [746, 162], [746, 166], [746, 170], [746, 171], [746, 173], [746, 192], [746, 195], [746, 197], [746, 198], [746, 199], [746, 200], [746, 209], [746, 213], [746, 217], [746, 235], [746, 236], [746, 238], [746, 268], [746, 270], [746, 273], [746, 274], [746, 276], [746, 296], [746, 300], [746, 303], [746, 304], [746, 307], [746, 336], [746, 350], [747, 122], [747, 126], [747, 127], [747, 140], [747, 162], [747, 166], [747, 170], [747, 171], [747, 173], [747, 192], [747, 195], [747, 197], [747, 198], [747, 199], [747, 200], [747, 209], [747, 213], [747, 217], [747, 235], [747, 236], [747, 238], [747, 268], [747, 270], [747, 273], [747, 274], [747, 276], [747, 296], [747, 300], [747, 303], [747, 304], [747, 307], [747, 336], [747, 350], [748, 122], [748, 126], [748, 127], [748, 140], [748, 162], [748, 166], [748, 170], [748, 171], [748, 173], [748, 192], [748, 195], [748, 197], [748, 198], [748, 199], [748, 200], [748, 209], [748, 213], [748, 217], [748, 235], [748, 236], [748, 238], [748, 268], [748, 270], [748, 273], [748, 274], [748, 276], [748, 296], [748, 300], [748, 303], [748, 304], [748, 307], [748, 336], [748, 350], [750, 129], [750, 182], [750, 193], [750, 203], [754, 59], [755, 59], [756, 40], [757, 48], [758, 48], [758, 59], [759, 40], [759, 59], [761, 99], [761, 308], [763, 127], [763, 138], [764, 127], [764, 138], [765, 127], [765, 138], [768, 149], [768, 156], [772, 166], [773, 166], [774, 151], [774, 178], [774, 185], [774, 194], [774, 197], [774, 198], [774, 205], [774, 251], [774, 289], [774, 293], [774, 296], [774, 301], [774, 303], [774, 305], [774, 306], [774, 337], [774, 338], [774, 339], [774, 340], [774, 341], [774, 342], [774, 343], [774, 349], [776, 151], [776, 178], [776, 185], [776, 194], [776, 197], [776, 198], [776, 205], [776, 251], [776, 289], [776, 293], [776, 296], [776, 301], [776, 303], [776, 305], [776, 306], [776, 337], [776, 338], [776, 339], [776, 340], [776, 341], [776, 342], [776, 343], [776, 349], [787, 210], [794, 221], [804, 306], [805, 169], [809, 128], [809, 138], [809, 235], [815, 155], [827, 58], [828, 58], [828, 136], [828, 149], [828, 161], [829, 58], [830, 58], [830, 136], [831, 119], [831, 121], [832, 16], [832, 248], [832, 277], [841, 102], [842, 106], [843, 129], [843, 130], [843, 133], [843, 154], [843, 193], [843, 194], [843, 198], [843, 246], [843, 300], [843, 308], [843, 309], [844, 0], [844, 102], [844, 133], [845, 0], [845, 102], [845, 133], [846, 0], [846, 102], [846, 133], [847, 0], [847, 102], [847, 133], [848, 102], [850, 183], [854, 123], [854, 131], [854, 154], [854, 170], [854, 171], [854, 176], [854, 204], [854, 223], [854, 280], [854, 284], [854, 288], [854, 294], [854, 300], [854, 302], [854, 307], [854, 309], [854, 310], [854, 313], [854, 316], [854, 329], [854, 350], [854, 351], [857, 134], [857, 147], [857, 153], [857, 154], [857, 155], [857, 157], [857, 158], [857, 172], [857, 180], [857, 206], [857, 208], [857, 224], [857, 234], [857, 235], [857, 236], [857, 245], [857, 246], [857, 250], [857, 345], [857, 351], [858, 134], [858, 147], [858, 153], [858, 154], [858, 155], [858, 157], [858, 158], [858, 172], [858, 180], [858, 206], [858, 208], [858, 224], [858, 234], [858, 235], [858, 236], [858, 245], [858, 246], [858, 250], [858, 345], [858, 351], [860, 154], [860, 156], [860, 193], [860, 314], [861, 115], [861, 179], [861, 224], [864, 25], [864, 36], [865, 129], [865, 130], [865, 339], [866, 145], [866, 147], [866, 189], [866, 284], [867, 147], [870, 129], [870, 196], [870, 250], [871, 77], [874, 77], [875, 106], [879, 305], [880, 305], [881, 305], [885, 142], [885, 148], [885, 269], [885, 274], [896, 314], [896, 315], [899, 127], [899, 128], [899, 219], [899, 221], [901, 128], [902, 125], [902, 150], [902, 170], [902, 174], [902, 180], [902, 302], [903, 125], [903, 150], [903, 170], [903, 174], [903, 180], [903, 302], [904, 53], [904, 54], [904, 55], [904, 56], [904, 57], [904, 124], [904, 165], [904, 202], [904, 222], [905, 54], [906, 53], [906, 54], [906, 55], [906, 56], [906, 57], [906, 124], [906, 165], [906, 260], [906, 263], [907, 53], [907, 54], [907, 55], [907, 56], [907, 57], [907, 124], [907, 165], [907, 260], [907, 263], [913, 152], [915, 219], [916, 219], [917, 219], [921, 109], [934, 122], [934, 156], [934, 269], [934, 270], [934, 274], [934, 305], [935, 16], [935, 18], [935, 70], [936, 16], [936, 18], [936, 70], [938, 16], [938, 18], [938, 70], [947, 109], [948, 109], [951, 170], [952, 138], [953, 170], [954, 170], [955, 109], [958, 125], [958, 126], [958, 127], [958, 131], [958, 136], [958, 164], [958, 165], [958, 172], [958, 181], [958, 184], [958, 207], [958, 209], [958, 212], [958, 213], [958, 214], [958, 215], [958, 217], [958, 218], [958, 222], [958, 225], [958, 226], [958, 230], [958, 232], [958, 235], [958, 236], [958, 238], [958, 239], [958, 241], [958, 243], [958, 248], [958, 254], [958, 258], [958, 259], [958, 260], [958, 268], [958, 271], [958, 272], [958, 274], [958, 288], [958, 290], [958, 291], [958, 294], [958, 300], [958, 307], [958, 309], [959, 125], [959, 126], [959, 128], [959, 137], [959, 164], [959, 165], [959, 181], [959, 184], [959, 207], [959, 208], [959, 213], [959, 215], [959, 217], [959, 218], [959, 222], [959, 225], [959, 226], [959, 227], [959, 230], [959, 232], [959, 235], [959, 236], [959, 237], [959, 238], [959, 239], [959, 240], [959, 241], [959, 248], [959, 254], [959, 255], [959, 258], [959, 259], [959, 260], [959, 264], [959, 269], [959, 275], [959, 276], [959, 277], [959, 279], [959, 281], [959, 290], [959, 294], [959, 300], [959, 302], [959, 309], [959, 315], [959, 347], [964, 218], [966, 126], [966, 217], [966, 219], [966, 269], [966, 290], [966, 294], [970, 99], [970, 308], [971, 310], [972, 169], [983, 70], [984, 70], [985, 70], [986, 55], [986, 215], [989, 71], [993, 64], [994, 0], [994, 62], [994, 63], [994, 64], [995, 0], [995, 62], [995, 63], [995, 64], [996, 211], [997, 285], [998, 285], [1000, 305], [1001, 142], [1007, 36], [1007, 81], [1007, 82], [1007, 83], [1007, 309], [1007, 312], [1007, 315], [1007, 316], [1007, 332], [1007, 351], [1009, 153], [1009, 166], [1009, 174], [1009, 182], [1009, 230], [1009, 248], [1009, 268], [1009, 274], [1009, 302], [1009, 309], [1009, 313], [1009, 314], [1009, 324], [1009, 331], [1009, 332], [1009, 333], [1010, 153], [1010, 166], [1010, 174], [1010, 182], [1010, 230], [1010, 248], [1010, 268], [1010, 274], [1010, 302], [1010, 309], [1010, 313], [1010, 324], [1010, 331], [1010, 332], [1010, 333], [1011, 153], [1011, 166], [1011, 174], [1011, 182], [1011, 230], [1011, 248], [1011, 268], [1011, 274], [1011, 302], [1011, 309], [1011, 313], [1011, 315], [1011, 324], [1011, 331], [1011, 332], [1011, 333], [1013, 63], [1013, 152], [1014, 153], [1014, 166], [1014, 174], [1014, 182], [1014, 230], [1014, 248], [1014, 268], [1014, 274], [1014, 302], [1014, 309], [1014, 313], [1014, 324], [1014, 331], [1014, 332], [1014, 333], [1016, 153], [1016, 166], [1016, 170], [1016, 174], [1016, 182], [1016, 230], [1016, 233], [1016, 248], [1016, 268], [1016, 274], [1016, 302], [1016, 309], [1016, 313], [1016, 324], [1016, 331], [1016, 332], [1016, 333], [1019, 52], [1025, 305], [1032, 219], [1033, 105], [1033, 116], [1033, 117], [1033, 118], [1033, 139], [1033, 180], [1033, 298], [1034, 335], [1035, 335], [1036, 335], [1037, 335], [1038, 335], [1041, 101], [1042, 101], [1046, 39], [1050, 102], [1053, 106], [1054, 183], [1054, 286], [1054, 308], [1054, 340], [1055, 151], [1055, 183], [1055, 286], [1055, 308], [1055, 340], [1056, 12], [1057, 12], [1058, 12], [1059, 12], [1061, 80], [1062, 291], [1062, 292], [1065, 159], [1067, 168], [1067, 170], [1072, 314], [1073, 314], [1075, 8], [1075, 149], [1076, 8], [1076, 149], [1077, 51], [1077, 135], [1078, 51], [1078, 135], [1091, 142], [1091, 307], [1093, 148], [1095, 252], [1102, 148], [1105, 76], [1105, 266], [1106, 138], [1113, 219], [1120, 14], [1120, 163], [1120, 208], [1120, 246], [1120, 268], [1120, 269], [1120, 270], [1120, 271], [1120, 273], [1120, 274], [1120, 316], [1120, 348], [1121, 150], [1121, 180], [1121, 202], [1121, 223], [1121, 280], [1121, 283], [1121, 284], [1121, 285], [1121, 288], [1122, 150], [1122, 180], [1122, 202], [1122, 223], [1122, 280], [1122, 283], [1122, 284], [1122, 285], [1122, 288], [1124, 138], [1124, 226], [1128, 125], [1128, 138], [1128, 208], [1128, 212], [1130, 138], [1131, 98], [1135, 178], [1135, 199], [1135, 205], [1135, 344], [1141, 46], [1141, 149], [1142, 219], [1143, 138], [1143, 226], [1143, 243], [1144, 138], [1144, 226], [1144, 243], [1145, 99], [1145, 308], [1146, 268], [1146, 282], [1150, 167], [1150, 268], [1150, 282], [1150, 308], [1154, 62], [1156, 153], [1156, 166], [1156, 174], [1156, 182], [1156, 230], [1156, 248], [1156, 268], [1156, 274], [1156, 302], [1156, 309], [1156, 313], [1156, 324], [1156, 331], [1156, 332], [1156, 333], [1157, 153], [1157, 166], [1157, 174], [1157, 182], [1157, 230], [1157, 248], [1157, 268], [1157, 274], [1157, 302], [1157, 309], [1157, 313], [1157, 324], [1157, 331], [1157, 332], [1157, 333], [1160, 106], [1160, 284], [1162, 213], [1163, 213], [1164, 213], [1168, 267], [1175, 162], [1176, 162], [1177, 162], [1178, 162], [1185, 210], [1192, 262], [1195, 115], [1195, 267], [1197, 166], [1198, 166], [1199, 166], [1200, 139], [1201, 123], [1201, 133], [1201, 134], [1201, 139], [1201, 154], [1201, 247], [1201, 248], [1201, 299], [1201, 302], [1201, 306], [1201, 309], [1201, 310], [1201, 311], [1201, 314], [1201, 322], [1201, 327], [1201, 329], [1201, 333], [1202, 123], [1202, 133], [1202, 134], [1202, 139], [1202, 141], [1202, 154], [1202, 162], [1202, 193], [1202, 235], [1202, 248], [1202, 297], [1202, 298], [1202, 300], [1202, 302], [1202, 303], [1202, 304], [1202, 306], [1202, 309], [1202, 310], [1202, 311], [1202, 313], [1202, 314], [1202, 317], [1202, 318], [1202, 319], [1202, 320], [1202, 321], [1202, 322], [1202, 323], [1202, 324], [1202, 325], [1202, 326], [1202, 327], [1202, 329], [1202, 330], [1202, 331], [1202, 332], [1202, 333], [1209, 129], [1209, 130], [1209, 154], [1209, 192], [1209, 193], [1209, 197], [1209, 198], [1209, 199], [1209, 205], [1209, 251], [1209, 288], [1209, 290], [1209, 299], [1209, 303], [1209, 308], [1209, 309], [1209, 338], [1209, 339], [1209, 342], [1209, 343], [1227, 144], [1230, 167], [1234, 167], [1235, 142], [1236, 98], [1237, 154], [1238, 196], [1239, 196], [1243, 219], [1244, 219], [1246, 219], [1253, 132], [1253, 142], [1253, 156], [1253, 159], [1253, 161], [1253, 174], [1253, 176], [1253, 189], [1253, 203], [1253, 285], [1253, 293], [1253, 305], [1253, 309], [1253, 310], [1253, 329], [1254, 248], [1254, 315], [1255, 138], [1255, 172], [1258, 2], [1259, 11], [1259, 115], [1261, 149], [1263, 139], [1263, 155], [1263, 162], [1263, 228], [1263, 298], [1263, 302], [1263, 303], [1263, 306], [1263, 309], [1263, 310], [1263, 311], [1263, 328], [1264, 223], [1265, 139], [1265, 155], [1265, 162], [1265, 228], [1265, 298], [1265, 302], [1265, 303], [1265, 306], [1265, 309], [1265, 310], [1265, 311], [1265, 328], [1266, 151], [1266, 255], [1266, 285], [1267, 150], [1268, 151], [1268, 255], [1268, 285], [1269, 220], [1285, 38], [1285, 41], [1285, 148], [1287, 153], [1287, 166], [1287, 174], [1287, 182], [1287, 230], [1287, 248], [1287, 268], [1287, 274], [1287, 302], [1287, 309], [1287, 313], [1287, 324], [1287, 331], [1287, 332], [1287, 333], [1288, 153], [1288, 166], [1288, 174], [1288, 182], [1288, 230], [1288, 248], [1288, 268], [1288, 274], [1288, 302], [1288, 309], [1288, 313], [1288, 324], [1288, 331], [1288, 332], [1288, 333], [1289, 124], [1289, 131], [1289, 154], [1289, 172], [1289, 207], [1289, 212], [1289, 213], [1289, 214], [1289, 215], [1289, 216], [1289, 217], [1289, 240], [1289, 277], [1289, 279], [1289, 300], [1289, 304], [1289, 307], [1289, 309], [1290, 124], [1290, 131], [1290, 154], [1290, 172], [1290, 207], [1290, 212], [1290, 213], [1290, 214], [1290, 215], [1290, 216], [1290, 217], [1290, 240], [1290, 277], [1290, 279], [1290, 300], [1290, 304], [1290, 307], [1290, 309], [1291, 122], [1291, 124], [1291, 131], [1291, 154], [1291, 172], [1291, 207], [1291, 212], [1291, 213], [1291, 214], [1291, 215], [1291, 216], [1291, 217], [1291, 223], [1291, 240], [1291, 277], [1291, 279], [1291, 300], [1291, 304], [1291, 307], [1291, 309], [1292, 124], [1292, 131], [1292, 154], [1292, 172], [1292, 207], [1292, 212], [1292, 213], [1292, 214], [1292, 215], [1292, 216], [1292, 217], [1292, 219], [1292, 220], [1292, 240], [1292, 277], [1292, 279], [1292, 300], [1292, 304], [1292, 307], [1292, 309], [1297, 148], [1297, 283], [1298, 148], [1298, 283], [1299, 148], [1299, 283], [1300, 148], [1300, 283], [1301, 219], [1302, 138], [1308, 305], [1313, 154], [1313, 176], [1313, 177], [1313, 293], [1313, 294], [1313, 302], [1313, 309], [1313, 329], [1314, 154], [1314, 176], [1314, 177], [1314, 293], [1314, 294], [1314, 302], [1314, 309], [1314, 329], [1315, 154], [1315, 176], [1315, 177], [1315, 293], [1315, 294], [1315, 302], [1315, 309], [1315, 329], [1316, 126], [1316, 138], [1317, 154], [1317, 176], [1317, 177], [1317, 293], [1317, 294], [1317, 302], [1317, 309], [1317, 329], [1318, 126], [1318, 138], [1322, 166], [1324, 102], [1331, 168], [1331, 170], [1331, 309], [1331, 313], [1331, 324], [1331, 333], [1334, 151], [1334, 255], [1334, 285], [1337, 125], [1337, 154], [1337, 176], [1337, 177], [1337, 184], [1337, 186], [1337, 194], [1337, 223], [1337, 302], [1337, 309], [1337, 329], [1337, 345], [1337, 346], [1337, 347], [1337, 351], [1341, 219], [1342, 219], [1344, 219], [1346, 16], [1354, 36], [1354, 55], [1354, 81], [1354, 82], [1354, 312], [1355, 305], [1357, 305], [1362, 70], [1362, 152], [1363, 167], [1363, 197], [1363, 309], [1363, 315], [1363, 331], [1365, 167], [1365, 197], [1365, 309], [1365, 315], [1365, 331], [1366, 16], [1366, 102], [1371, 152], [1372, 144], [1374, 144], [1374, 210], [1375, 144], [1375, 210], [1376, 144], [1377, 144], [1377, 255], [1378, 144], [1378, 151], [1379, 144], [1380, 99], [1380, 308], [1383, 183], [1386, 183], [1392, 178], [1395, 126], [1396, 183], [1397, 126], [1397, 163], [1398, 178], [1402, 24], [1403, 149], [1412, 189], [1413, 190], [1414, 223], [1416, 283], [1416, 285], [1424, 229], [1424, 295], [1426, 229], [1426, 295], [1427, 229], [1427, 295], [1428, 229], [1428, 295], [1429, 229], [1429, 295], [1430, 229], [1430, 295], [1431, 229], [1431, 295], [1432, 129], [1432, 193], [1432, 198], [1432, 339], [1433, 129], [1433, 130], [1433, 193], [1434, 129], [1434, 193], [1434, 198], [1434, 339], [1435, 129], [1435, 196], [1436, 129], [1436, 130], [1436, 193], [1437, 129], [1437, 193], [1437, 198], [1438, 129], [1438, 193], [1442, 337], [1445, 119], [1445, 121], [1445, 142], [1445, 154], [1445, 314], [1445, 331], [1446, 119], [1446, 121], [1446, 309], [1446, 319], [1446, 331], [1447, 183], [1447, 250], [1447, 286], [1447, 308], [1447, 340], [1448, 264], [1450, 16], [1450, 125], [1450, 126], [1450, 127], [1450, 128], [1450, 131], [1450, 137], [1450, 140], [1450, 157], [1450, 158], [1450, 164], [1450, 165], [1450, 172], [1450, 181], [1450, 184], [1450, 207], [1450, 208], [1450, 212], [1450, 213], [1450, 214], [1450, 216], [1450, 220], [1450, 222], [1450, 225], [1450, 226], [1450, 227], [1450, 228], [1450, 230], [1450, 232], [1450, 235], [1450, 237], [1450, 239], [1450, 240], [1450, 241], [1450, 248], [1450, 258], [1450, 259], [1450, 260], [1450, 264], [1450, 277], [1450, 300], [1450, 303], [1450, 309], [1450, 315], [1450, 347], [1451, 16], [1451, 125], [1451, 127], [1451, 128], [1451, 131], [1451, 137], [1451, 140], [1451, 157], [1451, 158], [1451, 164], [1451, 165], [1451, 172], [1451, 181], [1451, 184], [1451, 207], [1451, 208], [1451, 212], [1451, 213], [1451, 214], [1451, 215], [1451, 216], [1451, 217], [1451, 222], [1451, 225], [1451, 226], [1451, 227], [1451, 228], [1451, 230], [1451, 232], [1451, 235], [1451, 237], [1451, 238], [1451, 239], [1451, 240], [1451, 241], [1451, 248], [1451, 258], [1451, 259], [1451, 260], [1451, 264], [1451, 269], [1451, 275], [1451, 276], [1451, 277], [1451, 279], [1451, 300], [1451, 303], [1451, 309], [1451, 315], [1451, 347], [1452, 16], [1452, 125], [1452, 127], [1452, 128], [1452, 131], [1452, 137], [1452, 140], [1452, 157], [1452, 158], [1452, 164], [1452, 165], [1452, 172], [1452, 181], [1452, 184], [1452, 207], [1452, 208], [1452, 212], [1452, 213], [1452, 214], [1452, 216], [1452, 220], [1452, 222], [1452, 225], [1452, 226], [1452, 227], [1452, 228], [1452, 230], [1452, 232], [1452, 235], [1452, 237], [1452, 238], [1452, 239], [1452, 240], [1452, 241], [1452, 248], [1452, 254], [1452, 255], [1452, 258], [1452, 259], [1452, 260], [1452, 264], [1452, 277], [1452, 300], [1452, 303], [1452, 309], [1452, 315], [1452, 347], [1453, 16], [1453, 125], [1453, 126], [1453, 127], [1453, 128], [1453, 131], [1453, 137], [1453, 140], [1453, 157], [1453, 158], [1453, 164], [1453, 165], [1453, 172], [1453, 181], [1453, 184], [1453, 207], [1453, 208], [1453, 212], [1453, 213], [1453, 214], [1453, 216], [1453, 222], [1453, 225], [1453, 226], [1453, 227], [1453, 228], [1453, 230], [1453, 232], [1453, 235], [1453, 237], [1453, 239], [1453, 240], [1453, 241], [1453, 248], [1453, 258], [1453, 259], [1453, 260], [1453, 264], [1453, 277], [1453, 300], [1453, 303], [1453, 309], [1453, 315], [1453, 347], [1454, 16], [1454, 125], [1454, 126], [1454, 127], [1454, 128], [1454, 131], [1454, 137], [1454, 140], [1454, 157], [1454, 158], [1454, 164], [1454, 165], [1454, 172], [1454, 181], [1454, 184], [1454, 207], [1454, 208], [1454, 209], [1454, 212], [1454, 213], [1454, 214], [1454, 216], [1454, 222], [1454, 225], [1454, 226], [1454, 227], [1454, 228], [1454, 230], [1454, 232], [1454, 235], [1454, 237], [1454, 239], [1454, 240], [1454, 241], [1454, 248], [1454, 258], [1454, 259], [1454, 260], [1454, 264], [1454, 277], [1454, 290], [1454, 294], [1454, 300], [1454, 303], [1454, 309], [1454, 315], [1454, 347], [1455, 16], [1455, 125], [1455, 126], [1455, 127], [1455, 128], [1455, 131], [1455, 137], [1455, 140], [1455, 157], [1455, 158], [1455, 164], [1455, 165], [1455, 172], [1455, 181], [1455, 184], [1455, 207], [1455, 208], [1455, 212], [1455, 213], [1455, 214], [1455, 216], [1455, 222], [1455, 225], [1455, 226], [1455, 227], [1455, 228], [1455, 230], [1455, 232], [1455, 235], [1455, 236], [1455, 237], [1455, 239], [1455, 240], [1455, 241], [1455, 248], [1455, 258], [1455, 259], [1455, 260], [1455, 264], [1455, 277], [1455, 300], [1455, 303], [1455, 309], [1455, 315], [1455, 347], [1456, 16], [1456, 125], [1456, 126], [1456, 127], [1456, 128], [1456, 131], [1456, 137], [1456, 140], [1456, 157], [1456, 158], [1456, 164], [1456, 165], [1456, 172], [1456, 181], [1456, 184], [1456, 207], [1456, 208], [1456, 212], [1456, 213], [1456, 214], [1456, 216], [1456, 219], [1456, 222], [1456, 225], [1456, 226], [1456, 227], [1456, 228], [1456, 230], [1456, 232], [1456, 235], [1456, 237], [1456, 239], [1456, 240], [1456, 241], [1456, 248], [1456, 255], [1456, 258], [1456, 259], [1456, 260], [1456, 264], [1456, 277], [1456, 281], [1456, 300], [1456, 303], [1456, 309], [1456, 315], [1456, 347], [1461, 16], [1461, 125], [1461, 126], [1461, 127], [1461, 128], [1461, 131], [1461, 137], [1461, 140], [1461, 157], [1461, 158], [1461, 164], [1461, 165], [1461, 172], [1461, 181], [1461, 184], [1461, 207], [1461, 208], [1461, 209], [1461, 212], [1461, 213], [1461, 214], [1461, 216], [1461, 220], [1461, 222], [1461, 225], [1461, 226], [1461, 227], [1461, 228], [1461, 230], [1461, 232], [1461, 235], [1461, 237], [1461, 239], [1461, 240], [1461, 241], [1461, 248], [1461, 258], [1461, 259], [1461, 260], [1461, 264], [1461, 277], [1461, 300], [1461, 303], [1461, 309], [1461, 315], [1461, 347], [1462, 16], [1462, 125], [1462, 126], [1462, 127], [1462, 128], [1462, 131], [1462, 137], [1462, 140], [1462, 157], [1462, 158], [1462, 164], [1462, 165], [1462, 172], [1462, 181], [1462, 184], [1462, 207], [1462, 208], [1462, 212], [1462, 213], [1462, 214], [1462, 216], [1462, 222], [1462, 225], [1462, 226], [1462, 227], [1462, 228], [1462, 230], [1462, 232], [1462, 235], [1462, 237], [1462, 239], [1462, 240], [1462, 241], [1462, 248], [1462, 254], [1462, 255], [1462, 258], [1462, 259], [1462, 260], [1462, 264], [1462, 277], [1462, 281], [1462, 300], [1462, 303], [1462, 309], [1462, 315], [1462, 347], [1463, 314], [1464, 228], [1467, 264], [1467, 335], [1472, 116], [1474, 119], [1475, 119], [1476, 120], [1477, 120], [1478, 120], [1479, 142], [1479, 150], [1479, 168], [1479, 169], [1480, 335], [1481, 142], [1481, 150], [1481, 168], [1481, 169], [1484, 182], [1484, 310], [1486, 133], [1486, 150], [1486, 151], [1486, 160], [1486, 194], [1487, 335], [1488, 178], [1488, 199], [1488, 338], [1488, 341], [1492, 219], [1501, 16], [1501, 128], [1501, 172], [1501, 207], [1501, 208], [1504, 241], [1504, 248], [1511, 146], [1511, 270], [1511, 274], [1512, 21], [1519, 7], [1519, 62], [1519, 64], [1519, 155], [1519, 224], [1519, 236], [1519, 250], [1520, 7], [1520, 62], [1520, 64], [1520, 155], [1520, 224], [1520, 234], [1520, 236], [1520, 245], [1520, 250], [1525, 53], [1525, 54], [1525, 55], [1525, 56], [1525, 57], [1525, 124], [1525, 165], [1525, 260], [1525, 263], [1526, 53], [1526, 54], [1526, 55], [1526, 56], [1526, 57], [1526, 124], [1526, 165], [1526, 260], [1526, 263], [1527, 53], [1527, 54], [1527, 55], [1527, 56], [1527, 57], [1527, 124], [1527, 165], [1527, 260], [1527, 263], [1528, 53], [1528, 54], [1528, 55], [1528, 56], [1528, 57], [1528, 124], [1528, 165], [1528, 260], [1528, 263], [1529, 53], [1529, 54], [1529, 55], [1529, 56], [1529, 57], [1529, 124], [1529, 165], [1529, 260], [1529, 263], [1530, 131], [1530, 132], [1530, 184], [1530, 200], [1530, 201], [1530, 202], [1530, 218], [1530, 282], [1530, 304], [1530, 306], [1530, 311], [1530, 350], [1531, 219], [1532, 138], [1533, 80], [1534, 223], [1534, 283], [1534, 285], [1541, 29], [1542, 14], [1543, 147], [1544, 100], [1544, 270], [1549, 219], [1550, 219], [1552, 219], [1555, 187], [1559, 98], [1565, 79], [1566, 15], [1568, 167], [1568, 302], [1568, 309], [1568, 331], [1570, 134], [1570, 310], [1570, 315], [1571, 192], [1571, 203], [1572, 132], [1572, 133], [1572, 136], [1572, 141], [1572, 147], [1572, 148], [1572, 154], [1572, 156], [1572, 159], [1572, 161], [1572, 164], [1572, 168], [1572, 176], [1572, 189], [1572, 193], [1572, 211], [1572, 214], [1572, 229], [1572, 247], [1572, 270], [1572, 274], [1572, 284], [1572, 285], [1572, 293], [1572, 296], [1572, 298], [1572, 299], [1572, 305], [1572, 306], [1572, 307], [1572, 309], [1572, 314], [1572, 315], [1572, 317], [1572, 322], [1572, 329], [1572, 333], [1572, 350], [1572, 351], [1575, 134], [1575, 139], [1575, 140], [1575, 228], [1577, 134], [1579, 134], [1582, 135], [1583, 135], [1584, 51], [1584, 135], [1586, 168], [1587, 168], [1588, 168], [1591, 294], [1592, 183], [1593, 141], [1593, 314], [1594, 294], [1596, 294], [1597, 182], [1599, 182], [1600, 182], [1601, 182], [1602, 129], [1602, 130], [1602, 131], [1603, 182], [1604, 211], [1607, 104], [1620, 223], [1620, 283], [1620, 285], [1633, 151], [1633, 154], [1633, 186], [1633, 188], [1633, 285], [1633, 287], [1633, 289], [1633, 290], [1633, 292], [1633, 293], [1633, 294], [1633, 296], [1633, 298], [1633, 299], [1633, 305], [1633, 306], [1633, 307], [1633, 308], [1633, 313], [1633, 336], [1633, 339], [1633, 341], [1633, 350], [1634, 161], [1634, 188], [1634, 297], [1634, 298], [1634, 301], [1634, 302], [1634, 304], [1634, 305], [1634, 308], [1639, 16], [1639, 18], [1640, 16], [1650, 186], [1650, 188], [1650, 299], [1650, 301], [1650, 308], [1651, 223], [1653, 139], [1653, 140], [1656, 14], [1656, 208], [1656, 212], [1656, 246], [1656, 268], [1656, 269], [1656, 270], [1656, 271], [1656, 273], [1656, 274], [1656, 316], [1656, 348], [1672, 148], [1672, 270], [1672, 274], [1672, 287], [1674, 100], [1674, 270], [1676, 305], [1679, 43], [1688, 29], [1688, 63], [1690, 131], [1690, 189], [1690, 190], [1690, 191], [1690, 197], [1690, 198], [1690, 199], [1690, 200], [1690, 211], [1690, 234], [1690, 283], [1690, 284], [1690, 289], [1690, 293], [1690, 299], [1690, 301], [1690, 306], [1690, 308], [1690, 336], [1692, 146], [1701, 66], [1702, 66], [1703, 150], [1703, 151], [1703, 162], [1703, 178], [1703, 185], [1703, 251], [1703, 300], [1703, 302], [1703, 303], [1703, 304], [1703, 305], [1703, 306], [1703, 307], [1703, 311], [1703, 338], [1703, 342], [1703, 343], [1703, 349], [1708, 314], [1709, 166], [1709, 168], [1709, 268], [1709, 274], [1709, 302], [1709, 331], [1709, 332], [1709, 333], [1711, 124], [1716, 129], [1716, 196], [1716, 198], [1716, 339], [1717, 132], [1717, 156], [1717, 161], [1717, 188], [1717, 189], [1717, 190], [1717, 191], [1717, 203], [1717, 250], [1717, 283], [1717, 284], [1717, 285], [1717, 297], [1717, 300], [1717, 306], [1717, 307], [1718, 174], [1718, 175], [1719, 174], [1719, 175], [1720, 38], [1720, 41], [1720, 148], [1724, 129], [1724, 196], [1724, 198], [1724, 250], [1724, 339], [1724, 341], [1731, 305], [1732, 305], [1733, 305], [1734, 305], [1735, 305], [1743, 126], [1743, 149], [1744, 126], [1745, 126], [1746, 124], [1748, 122], [1748, 124], [1748, 311], [1749, 124], [1750, 346], [1752, 176], [1752, 179], [1752, 180], [1752, 204], [1752, 223], [1752, 284], [1752, 294], [1752, 311], [1752, 340], [1753, 176], [1753, 179], [1753, 180], [1753, 204], [1753, 223], [1753, 284], [1753, 294], [1753, 311], [1753, 340], [1754, 180], [1754, 204], [1754, 223], [1754, 259], [1754, 283], [1754, 313], [1754, 314], [1762, 219], [1768, 170], [1769, 170], [1773, 40], [1773, 42], [1776, 183], [1777, 117], [1783, 27], [1784, 109], [1784, 297], [1784, 299], [1784, 301], [1784, 302], [1784, 308], [1787, 109], [1787, 297], [1787, 299], [1787, 301], [1787, 302], [1787, 308], [1791, 106], [1793, 309], [1793, 328], [1797, 229], [1797, 295], [1800, 166], [1809, 212], [1810, 156], [1811, 46], [1811, 149], [1812, 313], [1820, 219], [1821, 310], [1823, 49], [1826, 36], [1828, 17], [1828, 83], [1828, 312], [1829, 17], [1829, 83], [1829, 312], [1838, 129], [1841, 125], [1841, 128], [1841, 131], [1841, 176], [1841, 195], [1841, 199], [1841, 200], [1841, 201], [1841, 202], [1841, 204], [1841, 223], [1841, 288], [1841, 313], [1841, 350], [1843, 14], [1843, 163], [1843, 208], [1843, 246], [1843, 268], [1843, 269], [1843, 270], [1843, 271], [1843, 273], [1843, 274], [1843, 316], [1843, 348], [1851, 101], [1851, 109], [1852, 101], [1852, 109], [1853, 101], [1853, 301], [1854, 101], [1855, 101], [1856, 101], [1857, 139], [1857, 140], [1857, 228], [1857, 303], [1857, 311], [1859, 125], [1860, 125], [1861, 125], [1878, 148], [1883, 348], [1884, 348], [1900, 167], [1900, 197], [1900, 272], [1900, 302], [1900, 306], [1900, 311], [1905, 13], [1905, 227], [1907, 139], [1910, 76], [1911, 27], [1911, 230], [1913, 38], [1914, 69], [1915, 38], [1915, 41], [1916, 38], [1916, 41], [1917, 38], [1917, 41], [1918, 38], [1919, 38], [1920, 166], [1921, 69], [1922, 101], [1925, 138], [1925, 240], [1930, 138], [1930, 240], [1931, 285], [1937, 219], [1941, 225], [1941, 244], [1941, 252], [1942, 129], [1942, 156], [1942, 193], [1942, 309], [1943, 29], [1943, 34], [1945, 116], [1945, 156], [1946, 76], [1949, 100], [1949, 153], [1949, 270], [1950, 314], [1951, 314], [1957, 142], [1962, 124], [1962, 136], [1962, 137], [1962, 173], [1962, 201], [1962, 202], [1962, 327], [1963, 156], [1963, 203], [1964, 268], [1965, 219], [1968, 305], [1969, 138], [1973, 126], [1973, 163], [1978, 313], [1979, 183], [1983, 140], [1985, 152], [1987, 167], [1987, 233], [1987, 302], [1987, 309], [1987, 314], [1987, 331], [1991, 167], [1991, 197], [1991, 233], [1991, 273], [1991, 302], [1991, 309], [1991, 314], [1991, 331], [1992, 167], [1992, 197], [1992, 233], [1992, 302], [1992, 309], [1992, 314], [1992, 315], [1992, 331], [1993, 167], [1993, 172], [1993, 197], [1993, 233], [1993, 302], [1993, 309], [1993, 314], [1993, 331], [1994, 305], [1997, 126], [1997, 162], [1997, 189], [1997, 268], [1997, 269], [1997, 270], [1997, 272], [1997, 273], [1997, 274], [2001, 125], [2001, 128], [2001, 137], [2001, 164], [2001, 204], [2001, 225], [2002, 124], [2002, 125], [2003, 125], [2003, 180], [2005, 138], [2005, 240], [2006, 122], [2006, 125], [2006, 180], [2007, 125], [2007, 128], [2007, 137], [2007, 164], [2007, 204], [2007, 209], [2007, 215], [2009, 305], [2010, 305], [2011, 305], [2012, 305], [2013, 148], [2019, 134], [2019, 139], [2019, 141], [2019, 142], [2019, 150], [2019, 154], [2019, 162], [2019, 192], [2019, 233], [2019, 284], [2019, 300], [2019, 302], [2019, 306], [2019, 309], [2019, 310], [2019, 311], [2019, 313], [2019, 314], [2019, 321], [2019, 322], [2019, 325], [2019, 326], [2019, 327], [2020, 141], [2020, 314], [2021, 106], [2021, 340], [2022, 106], [2023, 106], [2023, 340], [2024, 183], [2024, 260], [2024, 262], [2025, 260], [2025, 262], [2027, 138], [2036, 122], [2036, 123], [2036, 125], [2036, 131], [2036, 176], [2036, 202], [2036, 211], [2036, 223], [2036, 224], [2036, 280], [2036, 284], [2036, 288], [2036, 300], [2036, 307], [2036, 309], [2036, 314], [2036, 318], [2036, 327], [2037, 128], [2037, 138], [2037, 218], [2037, 248], [2037, 279], [2039, 63], [2042, 1], [2042, 62], [2045, 13], [2048, 314], [2051, 183], [2051, 194], [2051, 200], [2051, 306], [2052, 310], [2053, 183], [2053, 186], [2053, 194], [2053, 287], [2053, 289], [2053, 292], [2053, 296], [2054, 149], [2054, 185], [2055, 53], [2059, 24], [2059, 157], [2060, 24], [2060, 157], [2061, 155], [2061, 157], [2061, 234], [2061, 246], [2061, 250], [2062, 155], [2062, 157], [2062, 234], [2062, 246], [2062, 250], [2069, 145], [2069, 147], [2070, 149], [2070, 313], [2072, 149], [2083, 150], [2083, 180], [2083, 202], [2083, 223], [2083, 280], [2083, 283], [2083, 284], [2083, 285], [2083, 288], [2084, 150], [2084, 180], [2084, 202], [2084, 223], [2084, 280], [2084, 283], [2084, 284], [2084, 285], [2084, 288], [2089, 219], [2093, 27], [2093, 29], [2093, 69], [2093, 70], [2093, 75], [2093, 82], [2093, 193], [2101, 229], [2101, 295], [2102, 229], [2102, 295], [2105, 25], [2105, 26], [2105, 31], [2106, 154], [2106, 189], [2106, 285], [2106, 288], [2107, 154], [2108, 154], [2108, 189], [2108, 288], [2110, 80], [2111, 129], [2112, 24], [2113, 18], [2113, 83], [2114, 259], [2115, 262], [2116, 164], [2126, 168], [2126, 174], [2126, 181], [2126, 206], [2127, 134], [2127, 166], [2127, 168], [2127, 174], [2127, 175], [2127, 206], [2127, 268], [2127, 274], [2133, 129], [2139, 252], [2142, 103], [2154, 314], [2158, 2], [2163, 126], [2163, 127], [2163, 161], [2163, 162], [2163, 186], [2163, 268], [2163, 269], [2163, 271], [2163, 272], [2163, 273], [2163, 274], [2163, 301], [2163, 303], [2163, 316], [2163, 348], [2164, 102], [2165, 102], [2169, 151], [2169, 156], [2169, 180], [2169, 181], [2169, 268], [2169, 269], [2169, 270], [2169, 271], [2169, 273], [2169, 274], [2169, 283], [2169, 285], [2171, 151], [2171, 156], [2171, 180], [2171, 181], [2171, 268], [2171, 269], [2171, 270], [2171, 271], [2171, 273], [2171, 274], [2171, 283], [2171, 285], [2174, 178], [2175, 309], [2175, 327], [2185, 305], [2186, 2], [2186, 36], [2186, 334], [2186, 348], [2188, 42], [2188, 43], [2189, 42], [2189, 43], [2191, 54], [2191, 152], [2196, 148], [2198, 54], [2211, 166], [2212, 183], [2214, 150], [2215, 150], [2220, 219], [2221, 155], [2221, 224], [2221, 245], [2221, 246], [2221, 250], [2222, 65], [2223, 65], [2224, 272], [2225, 123], [2225, 125], [2225, 131], [2225, 146], [2225, 150], [2225, 170], [2225, 171], [2225, 176], [2225, 179], [2225, 180], [2225, 181], [2225, 184], [2225, 186], [2225, 192], [2225, 216], [2225, 222], [2225, 223], [2225, 226], [2225, 231], [2225, 233], [2225, 235], [2225, 240], [2225, 280], [2225, 282], [2225, 283], [2225, 284], [2225, 288], [2225, 296], [2225, 298], [2225, 300], [2225, 304], [2225, 305], [2225, 311], [2225, 313], [2225, 315], [2225, 316], [2225, 326], [2225, 350], [2225, 351], [2228, 219], [2230, 122], 